zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXE/periph6/PERI_EMAC.h
  __IO uint32_t MTL_FPE_ADVANCE;                   /**< MTL FPE Advance, offset: 0xC94 */
       uint8_t RESERVED_41[8];
  __IO uint32_t MTL_RXP_CONTROL_STATUS;            /**< MTL Rx Parser Control Status, offset: 0xCA0 */
  __IO uint32_t MTL_RXP_INTERRUPT_CONTROL_STATUS;  /**< MTL Rx Parser Interrupt Control Status, offset: 0xCA4 */
  __I  uint32_t MTL_RXP_DROP_CNT;                  /**< MTL Rx Parser Drop Count, offset: 0xCA8 */
  __I  uint32_t MTL_RXP_ERROR_CNT;                 /**< MTL Rx Parser Error Count, offset: 0xCAC */
  __IO uint32_t MTL_RXP_INDIRECT_ACC_CONTROL_STATUS; /**< MTL Rx Parser Indirect Access Control Status, offset: 0xCB0 */
  __IO uint32_t MTL_RXP_INDIRECT_ACC_DATA;         /**< MTL Rx Parser Indirect Access Data, offset: 0xCB4 */
       uint8_t RESERVED_42[8];
  __IO uint32_t MTL_ECC_CONTROL;                   /**< MTL ECC Control, offset: 0xCC0 */
  __I  uint32_t MTL_SAFETY_INTERRUPT_STATUS;       /**< MTL Safety Interript Status, offset: 0xCC4 */
  __IO uint32_t MTL_ECC_INTERRUPT_ENABLE;          /**< MTL ECC Interrupt Enable, offset: 0xCC8 */
  __IO uint32_t MTL_ECC_INTERRUPT_STATUS;          /**< MTL ECC Interrupt Status, offset: 0xCCC */
  __IO uint32_t MTL_ECC_ERR_STS_RCTL;              /**< MTL ECC Error Status, offset: 0xCD0 */
  __I  uint32_t MTL_ECC_ERR_ADDR_STATUS;           /**< MTL ECC Error Adress Status, offset: 0xCD4 */
  __I  uint32_t MTL_ECC_ERR_CNTR_STATUS;           /**< MTL ECC Error Control Status, offset: 0xCD8 */
       uint8_t RESERVED_43[4];
  __IO uint32_t MTL_DPP_CONTROL;                   /**< MTL DPP Control, offset: 0xCE0 */
       uint8_t RESERVED_44[28];
  struct {                                         /* offset: 0xD00, array step: 0x40 */
    __IO uint32_t MTL_TXQX_OP_MODE;                  /**< MTL Tx Queue 0 Operation Mode..MTL Tx Queue 1 Operation Mode, array offset: 0xD00, array step: 0x40 */
    __I  uint32_t MTL_TXQX_UNDRFLW;                  /**< MTL Tx Queue 0 Underflow..MTL Tx Queue 1 Underflow, array offset: 0xD04, array step: 0x40 */
    __I  uint32_t MTL_TXQX_DBG;                      /**< MTL Tx Queue 0 Debug..MTL Tx Queue 1 Debug, array offset: 0xD08, array step: 0x40 */
         uint8_t RESERVED_0[4];
    __IO uint32_t MTL_TXQX_ETS_CTRL;                 /**< MTL Tx Queue 1 ETS Control, array offset: 0xD10, array step: 0x40, valid indices: [1] */
    __I  uint32_t MTL_TXQX_ETS_STAT;                 /**< MTL Tx Queue 0 ETS Status..MTL Tx Queue 1 ETS Status, array offset: 0xD14, array step: 0x40 */
    __IO uint32_t MTL_TXQX_QNTM_WGHT;                /**< MTL Tx Queue Quantum Weight..MTL Tx Queue 1 Quantum Weight, array offset: 0xD18, array step: 0x40 */
    __IO uint32_t MTL_TXQX_SNDSLP_CRDT;              /**< MTL Tx Queue 1 Sendslope Credit, array offset: 0xD1C, array step: 0x40, valid indices: [1] */
    __IO uint32_t MTL_TXQX_HI_CRDT;                  /**< MTL Tx Queue 1 HiCredit, array offset: 0xD20, array step: 0x40, valid indices: [1] */
    __IO uint32_t MTL_TXQX_LO_CRDT;                  /**< MTL Tx Queue 1 LoCredit, array offset: 0xD24, array step: 0x40, valid indices: [1] */
         uint8_t RESERVED_1[4];
    __IO uint32_t MTL_QX_INTCTRL_STAT;               /**< MTL Queue 0 Interrupt Control Status..MTL Queue 1 Interrupt Control Status, array offset: 0xD2C, array step: 0x40 */
    __IO uint32_t MTL_RXQX_OP_MODE;                  /**< MTL Rx Queue 0 Operation Mode..MTL Rx Queue 1 Operation Mode, array offset: 0xD30, array step: 0x40 */
    __I  uint32_t MTL_RXQX_MISSPKT_OVRFLW_CNT;       /**< MTL Rx Queue Missed Packet Overflow Count..MTL Rx Queue 1 Missed Packet Overflow Counter, array offset: 0xD34, array step: 0x40 */
    __I  uint32_t MTL_RXQX_DBG;                      /**< MTL Rx Queue 0 Debug..MTL Rx Queue 1 Debug, array offset: 0xD38, array step: 0x40 */
    __IO uint32_t MTL_RXQX_CTRL;                     /**< MTL Rx Queue 0 Control 0..MTL Rx Queue 1 Control, array offset: 0xD3C, array step: 0x40 */
  } MTL_QUEUE[EMAC_MTL_QUEUE_COUNT];
       uint8_t RESERVED_45[640];
  __IO uint32_t DMA_MODE;                          /**< DMA Mode, offset: 0x1000 */
  __IO uint32_t DMA_SYSBUS_MODE;                   /**< DMA System Bus Mode, offset: 0x1004 */
  __I  uint32_t DMA_INTERRUPT_STATUS;              /**< DMA Interrupt Status, offset: 0x1008 */
  __I  uint32_t DMA_DEBUG_STATUS0;                 /**< DMA Debug Status 0, offset: 0x100C */
       uint8_t RESERVED_46[64];
  __IO uint32_t DMA_TBS_CTRL;                      /**< DMA TBS Control, offset: 0x1050 */
       uint8_t RESERVED_47[44];
  __I  uint32_t DMA_SAFETY_INTERRUPT_STATUS;       /**< DMA Safety Interrupt Status, offset: 0x1080 */
       uint8_t RESERVED_48[124];
  struct {                                         /* offset: 0x1100, array step: 0x80 */
    __IO uint32_t DMA_CHX_CTRL;                      /**< DMA Channel 0 Control..DMA Channel 1 Control, array offset: 0x1100, array step: 0x80 */
    __IO uint32_t DMA_CHX_TX_CTRL;                   /**< DMA Channel Tx Control..DMA Channel 1 Tx Control, array offset: 0x1104, array step: 0x80 */
    __IO uint32_t DMA_CHX_RX_CTRL;                   /**< DMA Channel Rx Control..DMA Channel 1 Rx Control, array offset: 0x1108, array step: 0x80 */
         uint8_t RESERVED_0[8];
    __IO uint32_t DMA_CHX_TXDESC_LIST_ADDR;          /**< DMA Channel 0 Tx Descriptor List Address..DMA Channel 1 Tx Descriptor List Address, array offset: 0x1114, array step: 0x80 */
         uint8_t RESERVED_1[4];
    __IO uint32_t DMA_CHX_RXDESC_LIST_ADDR;          /**< DMA Channel 0 Rx Descriptor List Address..DMA Channel 1 Rx Descriptor List Address, array offset: 0x111C, array step: 0x80 */
    __IO uint32_t DMA_CHX_TXDESC_TAIL_PTR;           /**< DMA Channel 0 Tx Descriptor Tail Pointer..DMA Channel 1 Tx Descriptor Tail Pointer, array offset: 0x1120, array step: 0x80 */
         uint8_t RESERVED_2[4];
    __IO uint32_t DMA_CHX_RXDESC_TAIL_PTR;           /**< DMA Channeli 0 Rx Descriptor List Pointer..DMA Channel 1 Rx Descriptor Tail Pointer, array offset: 0x1128, array step: 0x80 */
    __IO uint32_t DMA_CHX_TXDESC_RING_LENGTH;        /**< DMA Channel 0 Tx Descriptor Ring Length..DMA Channel 1 Tx Descriptor Ring Length, array offset: 0x112C, array step: 0x80 */
    __IO uint32_t DMA_CHX_RXDESC_RING_LENGTH;        /**< DMA Channel 0 Rx Descriptor Ring Length..DMA Channel 1 Rx Descriptor Ring Length, array offset: 0x1130, array step: 0x80 */
    __IO uint32_t DMA_CHX_INT_EN;                    /**< DMA Channel 0 Interrupt Enable..DMA Channel 1 Interrupt Enable, array offset: 0x1134, array step: 0x80 */
    __IO uint32_t DMA_CHX_RX_INT_WDTIMER;            /**< DMA Channel 0 Rx Interrupt Watchdog Timer..DMA Channel 1 Rx Interrupt Watchdog Timer, array offset: 0x1138, array step: 0x80 */
    __IO uint32_t DMA_CHX_SLOT_FUNC_CTRL_STAT;       /**< DMA Channel 0 Slot Function Control Status..DMA Channel 1 Slot Function Control Status, array offset: 0x113C, array step: 0x80 */
         uint8_t RESERVED_3[4];
    __I  uint32_t DMA_CHX_CUR_HST_TXDESC;            /**< DMA Channel 0 Current Application Transmit Descriptor..DMA Channel 1 Current Application Transmit Descriptor, array offset: 0x1144, array step: 0x80 */
         uint8_t RESERVED_4[4];
    __I  uint32_t DMA_CHX_CUR_HST_RXDESC;            /**< DMA Channel 0 Current Application Receive Descriptor..DMA Channel 1 Current Application Receive Descriptor, array offset: 0x114C, array step: 0x80 */
         uint8_t RESERVED_5[4];
    __I  uint32_t DMA_CHX_CUR_HST_TXBUF;             /**< DMA Channel 0 Current Application Transmit Descriptor..DMA Channel 1 Current Application Transmit Buffer, array offset: 0x1154, array step: 0x80 */
         uint8_t RESERVED_6[4];
    __I  uint32_t DMA_CHX_CUR_HST_RXBUF;             /**< DMA Channel 0 Current Application Receive Buffer..DMA Channel 1 Current Application Receive Buffer, array offset: 0x115C, array step: 0x80 */
    __IO uint32_t DMA_CHX_STAT;                      /**< DMA Channel 0 Status..DMA Channel 1 Status, array offset: 0x1160, array step: 0x80 */
    __I  uint32_t DMA_CHX_MISS_FRAME_CNT;            /**< DMA Channel 0 Miss Frame Counter..DMA Channel 1 Miss Frame Counter, array offset: 0x1164, array step: 0x80 */
    __I  uint32_t DMA_CHX_RXP_ACCEPT_CNT;            /**< DMA Channel 0 Rx Parser Accept Count..DMA Channel 1 Rx Parser Accept Count, array offset: 0x1168, array step: 0x80 */
    __I  uint32_t DMA_CHX_RX_ERI_CNT;                /**< DMA Channel 0 Rx ERI Count..DMA Channel 1 Rx ERI Count, array offset: 0x116C, array step: 0x80 */
         uint8_t RESERVED_7[16];
  } DMA_CH[EMAC_DMA_CH_COUNT];
} EMAC_Type;

/* ----------------------------------------------------------------------------
   -- EMAC Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup EMAC_Register_Masks EMAC Register Masks
 * @{
 */

/*! @name MAC_CONFIGURATION - MAC Configuration */
/*! @{ */

#define EMAC_MAC_CONFIGURATION_RE_MASK           (0x1U)
#define EMAC_MAC_CONFIGURATION_RE_SHIFT          (0U)
/*! RE - Receiver Enable
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define EMAC_MAC_CONFIGURATION_RE(x)             (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_CONFIGURATION_RE_SHIFT)) & EMAC_MAC_CONFIGURATION_RE_MASK)

#define EMAC_MAC_CONFIGURATION_TE_MASK           (0x2U)
#define EMAC_MAC_CONFIGURATION_TE_SHIFT          (1U)
/*! TE - Transmitter Enable
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define EMAC_MAC_CONFIGURATION_TE(x)             (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_CONFIGURATION_TE_SHIFT)) & EMAC_MAC_CONFIGURATION_TE_MASK)

#define EMAC_MAC_CONFIGURATION_PRELEN_MASK       (0xCU)
#define EMAC_MAC_CONFIGURATION_PRELEN_SHIFT      (2U)
/*! PRELEN - Preamble Length for Transmit Packets
 *  0b00..7 bytes
 *  0b01..5 bytes
 *  0b10..3 bytes
 *  0b11..Reserved
 */
#define EMAC_MAC_CONFIGURATION_PRELEN(x)         (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_CONFIGURATION_PRELEN_SHIFT)) & EMAC_MAC_CONFIGURATION_PRELEN_MASK)

#define EMAC_MAC_CONFIGURATION_DC_MASK           (0x10U)
#define EMAC_MAC_CONFIGURATION_DC_SHIFT          (4U)
/*! DC - Deferral Check
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define EMAC_MAC_CONFIGURATION_DC(x)             (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_CONFIGURATION_DC_SHIFT)) & EMAC_MAC_CONFIGURATION_DC_MASK)

#define EMAC_MAC_CONFIGURATION_BL_MASK           (0x60U)
#define EMAC_MAC_CONFIGURATION_BL_SHIFT          (5U)
/*! BL - Back-Off Limit
 *  0b00..k = min(n,10)
 *  0b01..k = min(n,8)
 *  0b10..k = min(n,4)
 *  0b11..k = min(n,1)
 */
#define EMAC_MAC_CONFIGURATION_BL(x)             (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_CONFIGURATION_BL_SHIFT)) & EMAC_MAC_CONFIGURATION_BL_MASK)

