zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXE/periph6/PERI_EMAC.h
/*! @name MAC_EXT_CONFIGURATION - MAC Extended Configuration */
/*! @{ */

#define EMAC_MAC_EXT_CONFIGURATION_GPSL_MASK     (0x3FFFU)
#define EMAC_MAC_EXT_CONFIGURATION_GPSL_SHIFT    (0U)
/*! GPSL - Giant Packet Size Limit */
#define EMAC_MAC_EXT_CONFIGURATION_GPSL(x)       (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_EXT_CONFIGURATION_GPSL_SHIFT)) & EMAC_MAC_EXT_CONFIGURATION_GPSL_MASK)

#define EMAC_MAC_EXT_CONFIGURATION_DCRCC_MASK    (0x10000U)
#define EMAC_MAC_EXT_CONFIGURATION_DCRCC_SHIFT   (16U)
/*! DCRCC - Disable CRC Checking For Received Packets
 *  0b0..Enabled
 *  0b1..Disabled
 */
#define EMAC_MAC_EXT_CONFIGURATION_DCRCC(x)      (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_EXT_CONFIGURATION_DCRCC_SHIFT)) & EMAC_MAC_EXT_CONFIGURATION_DCRCC_MASK)

#define EMAC_MAC_EXT_CONFIGURATION_SPEN_MASK     (0x20000U)
#define EMAC_MAC_EXT_CONFIGURATION_SPEN_SHIFT    (17U)
/*! SPEN - Slow Protocol Detection Enable
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define EMAC_MAC_EXT_CONFIGURATION_SPEN(x)       (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_EXT_CONFIGURATION_SPEN_SHIFT)) & EMAC_MAC_EXT_CONFIGURATION_SPEN_MASK)

#define EMAC_MAC_EXT_CONFIGURATION_USP_MASK      (0x40000U)
#define EMAC_MAC_EXT_CONFIGURATION_USP_SHIFT     (18U)
/*! USP - Unicast Slow Protocol Packet Detect
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define EMAC_MAC_EXT_CONFIGURATION_USP(x)        (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_EXT_CONFIGURATION_USP_SHIFT)) & EMAC_MAC_EXT_CONFIGURATION_USP_MASK)

#define EMAC_MAC_EXT_CONFIGURATION_PDC_MASK      (0x80000U)
#define EMAC_MAC_EXT_CONFIGURATION_PDC_SHIFT     (19U)
/*! PDC - Packet Duplication Control
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define EMAC_MAC_EXT_CONFIGURATION_PDC(x)        (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_EXT_CONFIGURATION_PDC_SHIFT)) & EMAC_MAC_EXT_CONFIGURATION_PDC_MASK)

#define EMAC_MAC_EXT_CONFIGURATION_EIPGEN_MASK   (0x1000000U)
#define EMAC_MAC_EXT_CONFIGURATION_EIPGEN_SHIFT  (24U)
/*! EIPGEN - Extended Inter-Packet Gap Enable
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define EMAC_MAC_EXT_CONFIGURATION_EIPGEN(x)     (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_EXT_CONFIGURATION_EIPGEN_SHIFT)) & EMAC_MAC_EXT_CONFIGURATION_EIPGEN_MASK)

#define EMAC_MAC_EXT_CONFIGURATION_EIPG_MASK     (0x3E000000U)
#define EMAC_MAC_EXT_CONFIGURATION_EIPG_SHIFT    (25U)
/*! EIPG - Extended Inter-Packet Gap */
#define EMAC_MAC_EXT_CONFIGURATION_EIPG(x)       (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_EXT_CONFIGURATION_EIPG_SHIFT)) & EMAC_MAC_EXT_CONFIGURATION_EIPG_MASK)
/*! @} */

/*! @name MAC_PACKET_FILTER - MAC Packet Filter */
/*! @{ */

#define EMAC_MAC_PACKET_FILTER_PR_MASK           (0x1U)
#define EMAC_MAC_PACKET_FILTER_PR_SHIFT          (0U)
/*! PR - Promiscuous Mode
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define EMAC_MAC_PACKET_FILTER_PR(x)             (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_PACKET_FILTER_PR_SHIFT)) & EMAC_MAC_PACKET_FILTER_PR_MASK)

#define EMAC_MAC_PACKET_FILTER_HUC_MASK          (0x2U)
#define EMAC_MAC_PACKET_FILTER_HUC_SHIFT         (1U)
/*! HUC - Hash Unicast
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define EMAC_MAC_PACKET_FILTER_HUC(x)            (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_PACKET_FILTER_HUC_SHIFT)) & EMAC_MAC_PACKET_FILTER_HUC_MASK)

#define EMAC_MAC_PACKET_FILTER_HMC_MASK          (0x4U)
#define EMAC_MAC_PACKET_FILTER_HMC_SHIFT         (2U)
/*! HMC - Hash Multicast
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define EMAC_MAC_PACKET_FILTER_HMC(x)            (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_PACKET_FILTER_HMC_SHIFT)) & EMAC_MAC_PACKET_FILTER_HMC_MASK)

#define EMAC_MAC_PACKET_FILTER_DAIF_MASK         (0x8U)
#define EMAC_MAC_PACKET_FILTER_DAIF_SHIFT        (3U)
/*! DAIF - DA Inverse Filtering
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define EMAC_MAC_PACKET_FILTER_DAIF(x)           (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_PACKET_FILTER_DAIF_SHIFT)) & EMAC_MAC_PACKET_FILTER_DAIF_MASK)

#define EMAC_MAC_PACKET_FILTER_PM_MASK           (0x10U)
#define EMAC_MAC_PACKET_FILTER_PM_SHIFT          (4U)
/*! PM - Pass All Multicast
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define EMAC_MAC_PACKET_FILTER_PM(x)             (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_PACKET_FILTER_PM_SHIFT)) & EMAC_MAC_PACKET_FILTER_PM_MASK)

#define EMAC_MAC_PACKET_FILTER_DBF_MASK          (0x20U)
#define EMAC_MAC_PACKET_FILTER_DBF_SHIFT         (5U)
/*! DBF - Disable Broadcast Packets
 *  0b0..Enabled
 *  0b1..Disabled
 */
#define EMAC_MAC_PACKET_FILTER_DBF(x)            (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_PACKET_FILTER_DBF_SHIFT)) & EMAC_MAC_PACKET_FILTER_DBF_MASK)

#define EMAC_MAC_PACKET_FILTER_PCF_MASK          (0xC0U)
#define EMAC_MAC_PACKET_FILTER_PCF_SHIFT         (6U)
/*! PCF - Pass Control Packets
 *  0b00..MAC filters all the control packets from reaching the application
 *  0b01..MAC forwards all the control packets, except pause packets, to the application even if they fail the address filter
 *  0b10..MAC forwards all the control packets to the application even if they fail the address filter
 *  0b11..MAC forwards all the control packets that pass the address filter
 */
#define EMAC_MAC_PACKET_FILTER_PCF(x)            (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_PACKET_FILTER_PCF_SHIFT)) & EMAC_MAC_PACKET_FILTER_PCF_MASK)

#define EMAC_MAC_PACKET_FILTER_SAIF_MASK         (0x100U)
#define EMAC_MAC_PACKET_FILTER_SAIF_SHIFT        (8U)
/*! SAIF - SA Inverse Filtering
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define EMAC_MAC_PACKET_FILTER_SAIF(x)           (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_PACKET_FILTER_SAIF_SHIFT)) & EMAC_MAC_PACKET_FILTER_SAIF_MASK)

#define EMAC_MAC_PACKET_FILTER_SAF_MASK          (0x200U)
#define EMAC_MAC_PACKET_FILTER_SAF_SHIFT         (9U)
/*! SAF - Source Address Filter Enable
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define EMAC_MAC_PACKET_FILTER_SAF(x)            (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_PACKET_FILTER_SAF_SHIFT)) & EMAC_MAC_PACKET_FILTER_SAF_MASK)

#define EMAC_MAC_PACKET_FILTER_HPF_MASK          (0x400U)
#define EMAC_MAC_PACKET_FILTER_HPF_SHIFT         (10U)
/*! HPF - Hash Or Perfect Filter
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define EMAC_MAC_PACKET_FILTER_HPF(x)            (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_PACKET_FILTER_HPF_SHIFT)) & EMAC_MAC_PACKET_FILTER_HPF_MASK)

#define EMAC_MAC_PACKET_FILTER_VTFE_MASK         (0x10000U)
#define EMAC_MAC_PACKET_FILTER_VTFE_SHIFT        (16U)
/*! VTFE - VLAN Tag Filter Enable
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define EMAC_MAC_PACKET_FILTER_VTFE(x)           (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_PACKET_FILTER_VTFE_SHIFT)) & EMAC_MAC_PACKET_FILTER_VTFE_MASK)

#define EMAC_MAC_PACKET_FILTER_IPFE_MASK         (0x100000U)
#define EMAC_MAC_PACKET_FILTER_IPFE_SHIFT        (20U)
/*! IPFE - Layer 3 and Layer 4 Filter Enable
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define EMAC_MAC_PACKET_FILTER_IPFE(x)           (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_PACKET_FILTER_IPFE_SHIFT)) & EMAC_MAC_PACKET_FILTER_IPFE_MASK)

#define EMAC_MAC_PACKET_FILTER_DNTU_MASK         (0x200000U)
#define EMAC_MAC_PACKET_FILTER_DNTU_SHIFT        (21U)
/*! DNTU - Drop Non-TCP/UDP Over IP Packets
 *  0b0..Forwards
 *  0b1..Drops
 */
#define EMAC_MAC_PACKET_FILTER_DNTU(x)           (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_PACKET_FILTER_DNTU_SHIFT)) & EMAC_MAC_PACKET_FILTER_DNTU_MASK)

#define EMAC_MAC_PACKET_FILTER_RA_MASK           (0x80000000U)
#define EMAC_MAC_PACKET_FILTER_RA_SHIFT          (31U)
/*! RA - Receive All
 *  0b0..Receive All is disabled
 *  0b1..Receive All is enabled
 */
#define EMAC_MAC_PACKET_FILTER_RA(x)             (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_PACKET_FILTER_RA_SHIFT)) & EMAC_MAC_PACKET_FILTER_RA_MASK)
/*! @} */

