zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXE/periph6/PERI_EMAC.h
/*! @name MAC_WATCHDOG_TIMEOUT - MAC Watchdog Timeout */
/*! @{ */

#define EMAC_MAC_WATCHDOG_TIMEOUT_WTO_MASK       (0xFU)
#define EMAC_MAC_WATCHDOG_TIMEOUT_WTO_SHIFT      (0U)
/*! WTO - Watchdog Timeout
 *  0b0000..2 KB
 *  0b0001..3 KB
 *  0b0010..4 KB
 *  0b0011..5 KB
 *  0b0100..6 KB
 *  0b0101..7 KB
 *  0b0110..8 KB
 *  0b0111..9 KB
 *  0b1000..10 KB
 *  0b1001..11 KB
 *  0b1010..12 KB
 *  0b1011..13 KB
 *  0b1100..14 KB
 *  0b1101..15 KB
 *  0b1110..16383 bytes
 *  0b1111..Reserved
 */
#define EMAC_MAC_WATCHDOG_TIMEOUT_WTO(x)         (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_WATCHDOG_TIMEOUT_WTO_SHIFT)) & EMAC_MAC_WATCHDOG_TIMEOUT_WTO_MASK)

#define EMAC_MAC_WATCHDOG_TIMEOUT_PWE_MASK       (0x100U)
#define EMAC_MAC_WATCHDOG_TIMEOUT_PWE_SHIFT      (8U)
/*! PWE - Programmable Watchdog Enable
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define EMAC_MAC_WATCHDOG_TIMEOUT_PWE(x)         (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_WATCHDOG_TIMEOUT_PWE_SHIFT)) & EMAC_MAC_WATCHDOG_TIMEOUT_PWE_MASK)
/*! @} */

/*! @name MAC_HASH_TABLE_REG0 - MAC Hash Table First 32 Bits */
/*! @{ */

#define EMAC_MAC_HASH_TABLE_REG0_HT31T0_MASK     (0xFFFFFFFFU)
#define EMAC_MAC_HASH_TABLE_REG0_HT31T0_SHIFT    (0U)
/*! HT31T0 - MAC Hash Table First 32 Bits */
#define EMAC_MAC_HASH_TABLE_REG0_HT31T0(x)       (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_HASH_TABLE_REG0_HT31T0_SHIFT)) & EMAC_MAC_HASH_TABLE_REG0_HT31T0_MASK)
/*! @} */

/*! @name MAC_HASH_TABLE_REG1 - MAC Hash Table Second 32 Bits */
/*! @{ */

#define EMAC_MAC_HASH_TABLE_REG1_HT63T32_MASK    (0xFFFFFFFFU)
#define EMAC_MAC_HASH_TABLE_REG1_HT63T32_SHIFT   (0U)
/*! HT63T32 - MAC Hash Table Second 32 Bits */
#define EMAC_MAC_HASH_TABLE_REG1_HT63T32(x)      (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_HASH_TABLE_REG1_HT63T32_SHIFT)) & EMAC_MAC_HASH_TABLE_REG1_HT63T32_MASK)
/*! @} */

/*! @name MAC_VLAN_TAG_CTRL - MAC VLAN Tag Control */
/*! @{ */

#define EMAC_MAC_VLAN_TAG_CTRL_OB_MASK           (0x1U)
#define EMAC_MAC_VLAN_TAG_CTRL_OB_SHIFT          (0U)
/*! OB - Operation Busy
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define EMAC_MAC_VLAN_TAG_CTRL_OB(x)             (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_VLAN_TAG_CTRL_OB_SHIFT)) & EMAC_MAC_VLAN_TAG_CTRL_OB_MASK)

#define EMAC_MAC_VLAN_TAG_CTRL_CT_MASK           (0x2U)
#define EMAC_MAC_VLAN_TAG_CTRL_CT_SHIFT          (1U)
/*! CT - Command Type
 *  0b0..Write operation
 *  0b1..Read operation
 */
#define EMAC_MAC_VLAN_TAG_CTRL_CT(x)             (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_VLAN_TAG_CTRL_CT_SHIFT)) & EMAC_MAC_VLAN_TAG_CTRL_CT_MASK)

#define EMAC_MAC_VLAN_TAG_CTRL_OFS_MASK          (0xCU)
#define EMAC_MAC_VLAN_TAG_CTRL_OFS_SHIFT         (2U)
/*! OFS - Offset */
#define EMAC_MAC_VLAN_TAG_CTRL_OFS(x)            (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_VLAN_TAG_CTRL_OFS_SHIFT)) & EMAC_MAC_VLAN_TAG_CTRL_OFS_MASK)

#define EMAC_MAC_VLAN_TAG_CTRL_ETV_MASK          (0x10000U)
#define EMAC_MAC_VLAN_TAG_CTRL_ETV_SHIFT         (16U)
/*! ETV - Enable Tag For VLAN
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define EMAC_MAC_VLAN_TAG_CTRL_ETV(x)            (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_VLAN_TAG_CTRL_ETV_SHIFT)) & EMAC_MAC_VLAN_TAG_CTRL_ETV_MASK)

#define EMAC_MAC_VLAN_TAG_CTRL_VTIM_MASK         (0x20000U)
#define EMAC_MAC_VLAN_TAG_CTRL_VTIM_SHIFT        (17U)
/*! VTIM - VLAN Tag Inverse Match Enable
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define EMAC_MAC_VLAN_TAG_CTRL_VTIM(x)           (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_VLAN_TAG_CTRL_VTIM_SHIFT)) & EMAC_MAC_VLAN_TAG_CTRL_VTIM_MASK)

#define EMAC_MAC_VLAN_TAG_CTRL_ESVL_MASK         (0x40000U)
#define EMAC_MAC_VLAN_TAG_CTRL_ESVL_SHIFT        (18U)
/*! ESVL - Enable S-VLAN
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define EMAC_MAC_VLAN_TAG_CTRL_ESVL(x)           (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_VLAN_TAG_CTRL_ESVL_SHIFT)) & EMAC_MAC_VLAN_TAG_CTRL_ESVL_MASK)

#define EMAC_MAC_VLAN_TAG_CTRL_ERSVLM_MASK       (0x80000U)
#define EMAC_MAC_VLAN_TAG_CTRL_ERSVLM_SHIFT      (19U)
/*! ERSVLM - Enable Receive S-VLAN Match
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define EMAC_MAC_VLAN_TAG_CTRL_ERSVLM(x)         (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_VLAN_TAG_CTRL_ERSVLM_SHIFT)) & EMAC_MAC_VLAN_TAG_CTRL_ERSVLM_MASK)

#define EMAC_MAC_VLAN_TAG_CTRL_DOVLTC_MASK       (0x100000U)
#define EMAC_MAC_VLAN_TAG_CTRL_DOVLTC_SHIFT      (20U)
/*! DOVLTC - Disable VLAN Type Check
 *  0b0..Enabled
 *  0b1..Disabled
 */
#define EMAC_MAC_VLAN_TAG_CTRL_DOVLTC(x)         (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_VLAN_TAG_CTRL_DOVLTC_SHIFT)) & EMAC_MAC_VLAN_TAG_CTRL_DOVLTC_MASK)

#define EMAC_MAC_VLAN_TAG_CTRL_EVLS_MASK         (0x600000U)
#define EMAC_MAC_VLAN_TAG_CTRL_EVLS_SHIFT        (21U)
/*! EVLS - Enable VLAN Tag Stripping
 *  0b00..Do not strip
 *  0b01..Strip if VLAN filter passes
 *  0b10..Strip if VLAN filter fails
 *  0b11..Always strip
 */
#define EMAC_MAC_VLAN_TAG_CTRL_EVLS(x)           (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_VLAN_TAG_CTRL_EVLS_SHIFT)) & EMAC_MAC_VLAN_TAG_CTRL_EVLS_MASK)

#define EMAC_MAC_VLAN_TAG_CTRL_EVLRXS_MASK       (0x1000000U)
#define EMAC_MAC_VLAN_TAG_CTRL_EVLRXS_SHIFT      (24U)
/*! EVLRXS - Enable VLAN Tag In Receive Status
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define EMAC_MAC_VLAN_TAG_CTRL_EVLRXS(x)         (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_VLAN_TAG_CTRL_EVLRXS_SHIFT)) & EMAC_MAC_VLAN_TAG_CTRL_EVLRXS_MASK)

#define EMAC_MAC_VLAN_TAG_CTRL_VTHM_MASK         (0x2000000U)
#define EMAC_MAC_VLAN_TAG_CTRL_VTHM_SHIFT        (25U)
/*! VTHM - VLAN Tag Hash Table Match
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define EMAC_MAC_VLAN_TAG_CTRL_VTHM(x)           (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_VLAN_TAG_CTRL_VTHM_SHIFT)) & EMAC_MAC_VLAN_TAG_CTRL_VTHM_MASK)

#define EMAC_MAC_VLAN_TAG_CTRL_EDVLP_MASK        (0x4000000U)
#define EMAC_MAC_VLAN_TAG_CTRL_EDVLP_SHIFT       (26U)
/*! EDVLP - Enable Double VLAN Processing
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define EMAC_MAC_VLAN_TAG_CTRL_EDVLP(x)          (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_VLAN_TAG_CTRL_EDVLP_SHIFT)) & EMAC_MAC_VLAN_TAG_CTRL_EDVLP_MASK)

#define EMAC_MAC_VLAN_TAG_CTRL_ERIVLT_MASK       (0x8000000U)
#define EMAC_MAC_VLAN_TAG_CTRL_ERIVLT_SHIFT      (27U)
/*! ERIVLT - Enable Inner VLAN Tag Comparison
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define EMAC_MAC_VLAN_TAG_CTRL_ERIVLT(x)         (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_VLAN_TAG_CTRL_ERIVLT_SHIFT)) & EMAC_MAC_VLAN_TAG_CTRL_ERIVLT_MASK)

#define EMAC_MAC_VLAN_TAG_CTRL_EIVLS_MASK        (0x30000000U)
#define EMAC_MAC_VLAN_TAG_CTRL_EIVLS_SHIFT       (28U)
/*! EIVLS - Enable Inner VLAN Tag Stripping
 *  0b00..Do not strip
 *  0b01..Strip if VLAN filter passes
 *  0b10..Strip if VLAN filter fails
 *  0b11..Always strip
 */
#define EMAC_MAC_VLAN_TAG_CTRL_EIVLS(x)          (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_VLAN_TAG_CTRL_EIVLS_SHIFT)) & EMAC_MAC_VLAN_TAG_CTRL_EIVLS_MASK)

#define EMAC_MAC_VLAN_TAG_CTRL_EIVLRXS_MASK      (0x80000000U)
#define EMAC_MAC_VLAN_TAG_CTRL_EIVLRXS_SHIFT     (31U)
/*! EIVLRXS - Enable Inner VLAN Tag In Receive Status
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define EMAC_MAC_VLAN_TAG_CTRL_EIVLRXS(x)        (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_VLAN_TAG_CTRL_EIVLRXS_SHIFT)) & EMAC_MAC_VLAN_TAG_CTRL_EIVLRXS_MASK)
/*! @} */

/*! @name MAC_VLAN_TAG - MAC VLAN Tag */
/*! @{ */

#define EMAC_MAC_VLAN_TAG_VL_MASK                (0xFFFFU)
#define EMAC_MAC_VLAN_TAG_VL_SHIFT               (0U)
/*! VL - VLAN Tag Identifier for Receive Packets */
#define EMAC_MAC_VLAN_TAG_VL(x)                  (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_VLAN_TAG_VL_SHIFT)) & EMAC_MAC_VLAN_TAG_VL_MASK)

#define EMAC_MAC_VLAN_TAG_ETV_MASK               (0x10000U)
#define EMAC_MAC_VLAN_TAG_ETV_SHIFT              (16U)
/*! ETV - Enable Tag For VLAN
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define EMAC_MAC_VLAN_TAG_ETV(x)                 (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_VLAN_TAG_ETV_SHIFT)) & EMAC_MAC_VLAN_TAG_ETV_MASK)

#define EMAC_MAC_VLAN_TAG_VTIM_MASK              (0x20000U)
#define EMAC_MAC_VLAN_TAG_VTIM_SHIFT             (17U)
/*! VTIM - VLAN Tag Inverse Match Enable
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define EMAC_MAC_VLAN_TAG_VTIM(x)                (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_VLAN_TAG_VTIM_SHIFT)) & EMAC_MAC_VLAN_TAG_VTIM_MASK)

#define EMAC_MAC_VLAN_TAG_ESVL_MASK              (0x40000U)
#define EMAC_MAC_VLAN_TAG_ESVL_SHIFT             (18U)
/*! ESVL - Enable S-VLAN
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define EMAC_MAC_VLAN_TAG_ESVL(x)                (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_VLAN_TAG_ESVL_SHIFT)) & EMAC_MAC_VLAN_TAG_ESVL_MASK)

#define EMAC_MAC_VLAN_TAG_ERSVLM_MASK            (0x80000U)
#define EMAC_MAC_VLAN_TAG_ERSVLM_SHIFT           (19U)
/*! ERSVLM - Enable Receive S-VLAN Match
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define EMAC_MAC_VLAN_TAG_ERSVLM(x)              (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_VLAN_TAG_ERSVLM_SHIFT)) & EMAC_MAC_VLAN_TAG_ERSVLM_MASK)

