zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXE/periph6/PERI_EMAC.h
#define EMAC_MAC_VLAN_TAG_DOVLTC_MASK            (0x100000U)
#define EMAC_MAC_VLAN_TAG_DOVLTC_SHIFT           (20U)
/*! DOVLTC - Disable VLAN Type Check
 *  0b0..Enabled
 *  0b1..Disabled
 */
#define EMAC_MAC_VLAN_TAG_DOVLTC(x)              (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_VLAN_TAG_DOVLTC_SHIFT)) & EMAC_MAC_VLAN_TAG_DOVLTC_MASK)

#define EMAC_MAC_VLAN_TAG_EVLS_MASK              (0x600000U)
#define EMAC_MAC_VLAN_TAG_EVLS_SHIFT             (21U)
/*! EVLS - Enable VLAN Tag Stripping
 *  0b00..Do not strip
 *  0b01..Strip if VLAN filter passes
 *  0b10..Strip if VLAN filter fails
 *  0b11..Always strip
 */
#define EMAC_MAC_VLAN_TAG_EVLS(x)                (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_VLAN_TAG_EVLS_SHIFT)) & EMAC_MAC_VLAN_TAG_EVLS_MASK)

#define EMAC_MAC_VLAN_TAG_EVLRXS_MASK            (0x1000000U)
#define EMAC_MAC_VLAN_TAG_EVLRXS_SHIFT           (24U)
/*! EVLRXS - Enable VLAN Tag In Receive Status
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define EMAC_MAC_VLAN_TAG_EVLRXS(x)              (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_VLAN_TAG_EVLRXS_SHIFT)) & EMAC_MAC_VLAN_TAG_EVLRXS_MASK)

#define EMAC_MAC_VLAN_TAG_VTHM_MASK              (0x2000000U)
#define EMAC_MAC_VLAN_TAG_VTHM_SHIFT             (25U)
/*! VTHM - VLAN Tag Hash Table Match
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define EMAC_MAC_VLAN_TAG_VTHM(x)                (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_VLAN_TAG_VTHM_SHIFT)) & EMAC_MAC_VLAN_TAG_VTHM_MASK)

#define EMAC_MAC_VLAN_TAG_EDVLP_MASK             (0x4000000U)
#define EMAC_MAC_VLAN_TAG_EDVLP_SHIFT            (26U)
/*! EDVLP - Enable Double VLAN Processing
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define EMAC_MAC_VLAN_TAG_EDVLP(x)               (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_VLAN_TAG_EDVLP_SHIFT)) & EMAC_MAC_VLAN_TAG_EDVLP_MASK)

#define EMAC_MAC_VLAN_TAG_ERIVLT_MASK            (0x8000000U)
#define EMAC_MAC_VLAN_TAG_ERIVLT_SHIFT           (27U)
/*! ERIVLT - Enable Inner VLAN Tag Comparison
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define EMAC_MAC_VLAN_TAG_ERIVLT(x)              (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_VLAN_TAG_ERIVLT_SHIFT)) & EMAC_MAC_VLAN_TAG_ERIVLT_MASK)

#define EMAC_MAC_VLAN_TAG_EIVLS_MASK             (0x30000000U)
#define EMAC_MAC_VLAN_TAG_EIVLS_SHIFT            (28U)
/*! EIVLS - Enable Inner VLAN Tag Stripping
 *  0b00..Do not strip
 *  0b01..Strip if VLAN filter passes
 *  0b10..Strip if VLAN filter fails
 *  0b11..Always strip
 */
#define EMAC_MAC_VLAN_TAG_EIVLS(x)               (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_VLAN_TAG_EIVLS_SHIFT)) & EMAC_MAC_VLAN_TAG_EIVLS_MASK)

#define EMAC_MAC_VLAN_TAG_EIVLRXS_MASK           (0x80000000U)
#define EMAC_MAC_VLAN_TAG_EIVLRXS_SHIFT          (31U)
/*! EIVLRXS - Enable Inner VLAN Tag In Receive Status
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define EMAC_MAC_VLAN_TAG_EIVLRXS(x)             (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_VLAN_TAG_EIVLRXS_SHIFT)) & EMAC_MAC_VLAN_TAG_EIVLRXS_MASK)
/*! @} */

/*! @name MAC_VLAN_TAG_DATA - MAC VLAN Tag Data */
/*! @{ */

#define EMAC_MAC_VLAN_TAG_DATA_VID_MASK          (0xFFFFU)
#define EMAC_MAC_VLAN_TAG_DATA_VID_SHIFT         (0U)
/*! VID - VLAN Tag ID */
#define EMAC_MAC_VLAN_TAG_DATA_VID(x)            (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_VLAN_TAG_DATA_VID_SHIFT)) & EMAC_MAC_VLAN_TAG_DATA_VID_MASK)

#define EMAC_MAC_VLAN_TAG_DATA_VEN_MASK          (0x10000U)
#define EMAC_MAC_VLAN_TAG_DATA_VEN_SHIFT         (16U)
/*! VEN - VLAN Tag Enable
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define EMAC_MAC_VLAN_TAG_DATA_VEN(x)            (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_VLAN_TAG_DATA_VEN_SHIFT)) & EMAC_MAC_VLAN_TAG_DATA_VEN_MASK)

#define EMAC_MAC_VLAN_TAG_DATA_ETV_MASK          (0x20000U)
#define EMAC_MAC_VLAN_TAG_DATA_ETV_SHIFT         (17U)
/*! ETV - VLAN Comparison
 *  0b0..16-bit VLAN comparison
 *  0b1..12-bit VLAN comparison
 */
#define EMAC_MAC_VLAN_TAG_DATA_ETV(x)            (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_VLAN_TAG_DATA_ETV_SHIFT)) & EMAC_MAC_VLAN_TAG_DATA_ETV_MASK)

#define EMAC_MAC_VLAN_TAG_DATA_DOVLTC_MASK       (0x40000U)
#define EMAC_MAC_VLAN_TAG_DATA_DOVLTC_SHIFT      (18U)
/*! DOVLTC - Disable VLAN Type Comparison
 *  0b0..Enabled
 *  0b1..Disabled
 */
#define EMAC_MAC_VLAN_TAG_DATA_DOVLTC(x)         (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_VLAN_TAG_DATA_DOVLTC_SHIFT)) & EMAC_MAC_VLAN_TAG_DATA_DOVLTC_MASK)

#define EMAC_MAC_VLAN_TAG_DATA_ERSVLM_MASK       (0x80000U)
#define EMAC_MAC_VLAN_TAG_DATA_ERSVLM_SHIFT      (19U)
/*! ERSVLM - Enable S-VLAN Match
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define EMAC_MAC_VLAN_TAG_DATA_ERSVLM(x)         (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_VLAN_TAG_DATA_ERSVLM_SHIFT)) & EMAC_MAC_VLAN_TAG_DATA_ERSVLM_MASK)

#define EMAC_MAC_VLAN_TAG_DATA_ERIVLT_MASK       (0x100000U)
#define EMAC_MAC_VLAN_TAG_DATA_ERIVLT_SHIFT      (20U)
/*! ERIVLT - Enable Inner VLAN Tag
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define EMAC_MAC_VLAN_TAG_DATA_ERIVLT(x)         (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_VLAN_TAG_DATA_ERIVLT_SHIFT)) & EMAC_MAC_VLAN_TAG_DATA_ERIVLT_MASK)

#define EMAC_MAC_VLAN_TAG_DATA_DMACHEN_MASK      (0x1000000U)
#define EMAC_MAC_VLAN_TAG_DATA_DMACHEN_SHIFT     (24U)
/*! DMACHEN - DMA Channel Number Enable
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define EMAC_MAC_VLAN_TAG_DATA_DMACHEN(x)        (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_VLAN_TAG_DATA_DMACHEN_SHIFT)) & EMAC_MAC_VLAN_TAG_DATA_DMACHEN_MASK)

#define EMAC_MAC_VLAN_TAG_DATA_DMACHN_MASK       (0x2000000U)
#define EMAC_MAC_VLAN_TAG_DATA_DMACHN_SHIFT      (25U)
/*! DMACHN - DMA Channel Number */
#define EMAC_MAC_VLAN_TAG_DATA_DMACHN(x)         (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_VLAN_TAG_DATA_DMACHN_SHIFT)) & EMAC_MAC_VLAN_TAG_DATA_DMACHN_MASK)
/*! @} */

/*! @name MAC_VLAN_TAG_FILTER0 - MAC VLAN Tag Filter 0 */
/*! @{ */

#define EMAC_MAC_VLAN_TAG_FILTER0_VID_MASK       (0xFFFFU)
#define EMAC_MAC_VLAN_TAG_FILTER0_VID_SHIFT      (0U)
/*! VID - VLAN Tag ID */
#define EMAC_MAC_VLAN_TAG_FILTER0_VID(x)         (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_VLAN_TAG_FILTER0_VID_SHIFT)) & EMAC_MAC_VLAN_TAG_FILTER0_VID_MASK)

#define EMAC_MAC_VLAN_TAG_FILTER0_VEN_MASK       (0x10000U)
#define EMAC_MAC_VLAN_TAG_FILTER0_VEN_SHIFT      (16U)
/*! VEN - VLAN Tag Enable
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define EMAC_MAC_VLAN_TAG_FILTER0_VEN(x)         (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_VLAN_TAG_FILTER0_VEN_SHIFT)) & EMAC_MAC_VLAN_TAG_FILTER0_VEN_MASK)

#define EMAC_MAC_VLAN_TAG_FILTER0_ETV_MASK       (0x20000U)
#define EMAC_MAC_VLAN_TAG_FILTER0_ETV_SHIFT      (17U)
/*! ETV - VLAN Comparison
 *  0b0..16-bit VLAN comparison
 *  0b1..12-bit VLAN comparison
 */
#define EMAC_MAC_VLAN_TAG_FILTER0_ETV(x)         (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_VLAN_TAG_FILTER0_ETV_SHIFT)) & EMAC_MAC_VLAN_TAG_FILTER0_ETV_MASK)

#define EMAC_MAC_VLAN_TAG_FILTER0_DOVLTC_MASK    (0x40000U)
#define EMAC_MAC_VLAN_TAG_FILTER0_DOVLTC_SHIFT   (18U)
/*! DOVLTC - Disable VLAN Type Comparison
 *  0b0..Enabled
 *  0b1..Disabled
 */
#define EMAC_MAC_VLAN_TAG_FILTER0_DOVLTC(x)      (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_VLAN_TAG_FILTER0_DOVLTC_SHIFT)) & EMAC_MAC_VLAN_TAG_FILTER0_DOVLTC_MASK)

