zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXE/periph6/PERI_EMAC.h
#define EMAC_MAC_VLAN_TAG_FILTER0_ERSVLM_MASK    (0x80000U)
#define EMAC_MAC_VLAN_TAG_FILTER0_ERSVLM_SHIFT   (19U)
/*! ERSVLM - Enable S-VLAN Match
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define EMAC_MAC_VLAN_TAG_FILTER0_ERSVLM(x)      (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_VLAN_TAG_FILTER0_ERSVLM_SHIFT)) & EMAC_MAC_VLAN_TAG_FILTER0_ERSVLM_MASK)

#define EMAC_MAC_VLAN_TAG_FILTER0_ERIVLT_MASK    (0x100000U)
#define EMAC_MAC_VLAN_TAG_FILTER0_ERIVLT_SHIFT   (20U)
/*! ERIVLT - Enable Inner VLAN Tag
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define EMAC_MAC_VLAN_TAG_FILTER0_ERIVLT(x)      (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_VLAN_TAG_FILTER0_ERIVLT_SHIFT)) & EMAC_MAC_VLAN_TAG_FILTER0_ERIVLT_MASK)

#define EMAC_MAC_VLAN_TAG_FILTER0_DMACHEN_MASK   (0x1000000U)
#define EMAC_MAC_VLAN_TAG_FILTER0_DMACHEN_SHIFT  (24U)
/*! DMACHEN - DMA Channel Number Enable
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define EMAC_MAC_VLAN_TAG_FILTER0_DMACHEN(x)     (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_VLAN_TAG_FILTER0_DMACHEN_SHIFT)) & EMAC_MAC_VLAN_TAG_FILTER0_DMACHEN_MASK)

#define EMAC_MAC_VLAN_TAG_FILTER0_DMACHN_MASK    (0x2000000U)
#define EMAC_MAC_VLAN_TAG_FILTER0_DMACHN_SHIFT   (25U)
/*! DMACHN - DMA Channel Number */
#define EMAC_MAC_VLAN_TAG_FILTER0_DMACHN(x)      (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_VLAN_TAG_FILTER0_DMACHN_SHIFT)) & EMAC_MAC_VLAN_TAG_FILTER0_DMACHN_MASK)
/*! @} */

/*! @name MAC_VLAN_TAG_FILTER1 - MAC VLAN Tag Filter 1 */
/*! @{ */

#define EMAC_MAC_VLAN_TAG_FILTER1_VID_MASK       (0xFFFFU)
#define EMAC_MAC_VLAN_TAG_FILTER1_VID_SHIFT      (0U)
/*! VID - VLAN Tag ID */
#define EMAC_MAC_VLAN_TAG_FILTER1_VID(x)         (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_VLAN_TAG_FILTER1_VID_SHIFT)) & EMAC_MAC_VLAN_TAG_FILTER1_VID_MASK)

#define EMAC_MAC_VLAN_TAG_FILTER1_VEN_MASK       (0x10000U)
#define EMAC_MAC_VLAN_TAG_FILTER1_VEN_SHIFT      (16U)
/*! VEN - VLAN Tag Enable
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define EMAC_MAC_VLAN_TAG_FILTER1_VEN(x)         (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_VLAN_TAG_FILTER1_VEN_SHIFT)) & EMAC_MAC_VLAN_TAG_FILTER1_VEN_MASK)

#define EMAC_MAC_VLAN_TAG_FILTER1_ETV_MASK       (0x20000U)
#define EMAC_MAC_VLAN_TAG_FILTER1_ETV_SHIFT      (17U)
/*! ETV - VLAN Comparison
 *  0b0..16-bit VLAN comparison
 *  0b1..12-bit VLAN comparison
 */
#define EMAC_MAC_VLAN_TAG_FILTER1_ETV(x)         (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_VLAN_TAG_FILTER1_ETV_SHIFT)) & EMAC_MAC_VLAN_TAG_FILTER1_ETV_MASK)

#define EMAC_MAC_VLAN_TAG_FILTER1_DOVLTC_MASK    (0x40000U)
#define EMAC_MAC_VLAN_TAG_FILTER1_DOVLTC_SHIFT   (18U)
/*! DOVLTC - Disable VLAN Type Comparison
 *  0b0..Enabled
 *  0b1..Disabled
 */
#define EMAC_MAC_VLAN_TAG_FILTER1_DOVLTC(x)      (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_VLAN_TAG_FILTER1_DOVLTC_SHIFT)) & EMAC_MAC_VLAN_TAG_FILTER1_DOVLTC_MASK)

#define EMAC_MAC_VLAN_TAG_FILTER1_ERSVLM_MASK    (0x80000U)
#define EMAC_MAC_VLAN_TAG_FILTER1_ERSVLM_SHIFT   (19U)
/*! ERSVLM - Enable S-VLAN Match
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define EMAC_MAC_VLAN_TAG_FILTER1_ERSVLM(x)      (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_VLAN_TAG_FILTER1_ERSVLM_SHIFT)) & EMAC_MAC_VLAN_TAG_FILTER1_ERSVLM_MASK)

#define EMAC_MAC_VLAN_TAG_FILTER1_ERIVLT_MASK    (0x100000U)
#define EMAC_MAC_VLAN_TAG_FILTER1_ERIVLT_SHIFT   (20U)
/*! ERIVLT - Enable Inner VLAN Tag
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define EMAC_MAC_VLAN_TAG_FILTER1_ERIVLT(x)      (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_VLAN_TAG_FILTER1_ERIVLT_SHIFT)) & EMAC_MAC_VLAN_TAG_FILTER1_ERIVLT_MASK)

#define EMAC_MAC_VLAN_TAG_FILTER1_DMACHEN_MASK   (0x1000000U)
#define EMAC_MAC_VLAN_TAG_FILTER1_DMACHEN_SHIFT  (24U)
/*! DMACHEN - DMA Channel Number Enable
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define EMAC_MAC_VLAN_TAG_FILTER1_DMACHEN(x)     (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_VLAN_TAG_FILTER1_DMACHEN_SHIFT)) & EMAC_MAC_VLAN_TAG_FILTER1_DMACHEN_MASK)

#define EMAC_MAC_VLAN_TAG_FILTER1_DMACHN_MASK    (0x2000000U)
#define EMAC_MAC_VLAN_TAG_FILTER1_DMACHN_SHIFT   (25U)
/*! DMACHN - DMA Channel Number */
#define EMAC_MAC_VLAN_TAG_FILTER1_DMACHN(x)      (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_VLAN_TAG_FILTER1_DMACHN_SHIFT)) & EMAC_MAC_VLAN_TAG_FILTER1_DMACHN_MASK)
/*! @} */

/*! @name MAC_VLAN_TAG_FILTER2 - MAC VLAN Tag Filter 2 */
/*! @{ */

#define EMAC_MAC_VLAN_TAG_FILTER2_VID_MASK       (0xFFFFU)
#define EMAC_MAC_VLAN_TAG_FILTER2_VID_SHIFT      (0U)
/*! VID - VLAN Tag ID */
#define EMAC_MAC_VLAN_TAG_FILTER2_VID(x)         (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_VLAN_TAG_FILTER2_VID_SHIFT)) & EMAC_MAC_VLAN_TAG_FILTER2_VID_MASK)

#define EMAC_MAC_VLAN_TAG_FILTER2_VEN_MASK       (0x10000U)
#define EMAC_MAC_VLAN_TAG_FILTER2_VEN_SHIFT      (16U)
/*! VEN - VLAN Tag Enable
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define EMAC_MAC_VLAN_TAG_FILTER2_VEN(x)         (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_VLAN_TAG_FILTER2_VEN_SHIFT)) & EMAC_MAC_VLAN_TAG_FILTER2_VEN_MASK)

#define EMAC_MAC_VLAN_TAG_FILTER2_ETV_MASK       (0x20000U)
#define EMAC_MAC_VLAN_TAG_FILTER2_ETV_SHIFT      (17U)
/*! ETV - VLAN Comparison
 *  0b0..16-bit VLAN comparison
 *  0b1..12-bit VLAN comparison
 */
#define EMAC_MAC_VLAN_TAG_FILTER2_ETV(x)         (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_VLAN_TAG_FILTER2_ETV_SHIFT)) & EMAC_MAC_VLAN_TAG_FILTER2_ETV_MASK)

#define EMAC_MAC_VLAN_TAG_FILTER2_DOVLTC_MASK    (0x40000U)
#define EMAC_MAC_VLAN_TAG_FILTER2_DOVLTC_SHIFT   (18U)
/*! DOVLTC - Disable VLAN Type Comparison
 *  0b0..Enabled
 *  0b1..Disabled
 */
#define EMAC_MAC_VLAN_TAG_FILTER2_DOVLTC(x)      (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_VLAN_TAG_FILTER2_DOVLTC_SHIFT)) & EMAC_MAC_VLAN_TAG_FILTER2_DOVLTC_MASK)

#define EMAC_MAC_VLAN_TAG_FILTER2_ERSVLM_MASK    (0x80000U)
#define EMAC_MAC_VLAN_TAG_FILTER2_ERSVLM_SHIFT   (19U)
/*! ERSVLM - Enable S-VLAN Match
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define EMAC_MAC_VLAN_TAG_FILTER2_ERSVLM(x)      (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_VLAN_TAG_FILTER2_ERSVLM_SHIFT)) & EMAC_MAC_VLAN_TAG_FILTER2_ERSVLM_MASK)

#define EMAC_MAC_VLAN_TAG_FILTER2_ERIVLT_MASK    (0x100000U)
#define EMAC_MAC_VLAN_TAG_FILTER2_ERIVLT_SHIFT   (20U)
/*! ERIVLT - Enable Inner VLAN Tag
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define EMAC_MAC_VLAN_TAG_FILTER2_ERIVLT(x)      (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_VLAN_TAG_FILTER2_ERIVLT_SHIFT)) & EMAC_MAC_VLAN_TAG_FILTER2_ERIVLT_MASK)

