zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXE/periph6/PERI_EMAC.h
#define EMAC_MAC_VLAN_TAG_FILTER2_DMACHEN_MASK   (0x1000000U)
#define EMAC_MAC_VLAN_TAG_FILTER2_DMACHEN_SHIFT  (24U)
/*! DMACHEN - DMA Channel Number Enable
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define EMAC_MAC_VLAN_TAG_FILTER2_DMACHEN(x)     (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_VLAN_TAG_FILTER2_DMACHEN_SHIFT)) & EMAC_MAC_VLAN_TAG_FILTER2_DMACHEN_MASK)

#define EMAC_MAC_VLAN_TAG_FILTER2_DMACHN_MASK    (0x2000000U)
#define EMAC_MAC_VLAN_TAG_FILTER2_DMACHN_SHIFT   (25U)
/*! DMACHN - DMA Channel Number */
#define EMAC_MAC_VLAN_TAG_FILTER2_DMACHN(x)      (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_VLAN_TAG_FILTER2_DMACHN_SHIFT)) & EMAC_MAC_VLAN_TAG_FILTER2_DMACHN_MASK)
/*! @} */

/*! @name MAC_VLAN_TAG_FILTER3 - MAC VLAN Tag Filter 3 */
/*! @{ */

#define EMAC_MAC_VLAN_TAG_FILTER3_VID_MASK       (0xFFFFU)
#define EMAC_MAC_VLAN_TAG_FILTER3_VID_SHIFT      (0U)
/*! VID - VLAN Tag ID */
#define EMAC_MAC_VLAN_TAG_FILTER3_VID(x)         (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_VLAN_TAG_FILTER3_VID_SHIFT)) & EMAC_MAC_VLAN_TAG_FILTER3_VID_MASK)

#define EMAC_MAC_VLAN_TAG_FILTER3_VEN_MASK       (0x10000U)
#define EMAC_MAC_VLAN_TAG_FILTER3_VEN_SHIFT      (16U)
/*! VEN - VLAN Tag Enable
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define EMAC_MAC_VLAN_TAG_FILTER3_VEN(x)         (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_VLAN_TAG_FILTER3_VEN_SHIFT)) & EMAC_MAC_VLAN_TAG_FILTER3_VEN_MASK)

#define EMAC_MAC_VLAN_TAG_FILTER3_ETV_MASK       (0x20000U)
#define EMAC_MAC_VLAN_TAG_FILTER3_ETV_SHIFT      (17U)
/*! ETV - VLAN Comparison
 *  0b0..16-bit VLAN comparison
 *  0b1..12-bit VLAN comparison
 */
#define EMAC_MAC_VLAN_TAG_FILTER3_ETV(x)         (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_VLAN_TAG_FILTER3_ETV_SHIFT)) & EMAC_MAC_VLAN_TAG_FILTER3_ETV_MASK)

#define EMAC_MAC_VLAN_TAG_FILTER3_DOVLTC_MASK    (0x40000U)
#define EMAC_MAC_VLAN_TAG_FILTER3_DOVLTC_SHIFT   (18U)
/*! DOVLTC - Disable VLAN Type Comparison
 *  0b0..Enabled
 *  0b1..Disabled
 */
#define EMAC_MAC_VLAN_TAG_FILTER3_DOVLTC(x)      (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_VLAN_TAG_FILTER3_DOVLTC_SHIFT)) & EMAC_MAC_VLAN_TAG_FILTER3_DOVLTC_MASK)

#define EMAC_MAC_VLAN_TAG_FILTER3_ERSVLM_MASK    (0x80000U)
#define EMAC_MAC_VLAN_TAG_FILTER3_ERSVLM_SHIFT   (19U)
/*! ERSVLM - Enable S-VLAN Match
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define EMAC_MAC_VLAN_TAG_FILTER3_ERSVLM(x)      (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_VLAN_TAG_FILTER3_ERSVLM_SHIFT)) & EMAC_MAC_VLAN_TAG_FILTER3_ERSVLM_MASK)

#define EMAC_MAC_VLAN_TAG_FILTER3_ERIVLT_MASK    (0x100000U)
#define EMAC_MAC_VLAN_TAG_FILTER3_ERIVLT_SHIFT   (20U)
/*! ERIVLT - Enable Inner VLAN Tag
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define EMAC_MAC_VLAN_TAG_FILTER3_ERIVLT(x)      (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_VLAN_TAG_FILTER3_ERIVLT_SHIFT)) & EMAC_MAC_VLAN_TAG_FILTER3_ERIVLT_MASK)

#define EMAC_MAC_VLAN_TAG_FILTER3_DMACHEN_MASK   (0x1000000U)
#define EMAC_MAC_VLAN_TAG_FILTER3_DMACHEN_SHIFT  (24U)
/*! DMACHEN - DMA Channel Number Enable
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define EMAC_MAC_VLAN_TAG_FILTER3_DMACHEN(x)     (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_VLAN_TAG_FILTER3_DMACHEN_SHIFT)) & EMAC_MAC_VLAN_TAG_FILTER3_DMACHEN_MASK)

#define EMAC_MAC_VLAN_TAG_FILTER3_DMACHN_MASK    (0x2000000U)
#define EMAC_MAC_VLAN_TAG_FILTER3_DMACHN_SHIFT   (25U)
/*! DMACHN - DMA Channel Number */
#define EMAC_MAC_VLAN_TAG_FILTER3_DMACHN(x)      (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_VLAN_TAG_FILTER3_DMACHN_SHIFT)) & EMAC_MAC_VLAN_TAG_FILTER3_DMACHN_MASK)
/*! @} */

/*! @name MAC_VLAN_HASH_TABLE - MAC VLAN Hash Table */
/*! @{ */

#define EMAC_MAC_VLAN_HASH_TABLE_VLHT_MASK       (0xFFFFU)
#define EMAC_MAC_VLAN_HASH_TABLE_VLHT_SHIFT      (0U)
/*! VLHT - VLAN Hash Table */
#define EMAC_MAC_VLAN_HASH_TABLE_VLHT(x)         (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_VLAN_HASH_TABLE_VLHT_SHIFT)) & EMAC_MAC_VLAN_HASH_TABLE_VLHT_MASK)
/*! @} */

/*! @name MAC_VLAN_INCL0 - MAC VLAN Inclusion 0 */
/*! @{ */

#define EMAC_MAC_VLAN_INCL0_VLT_MASK             (0xFFFFU)
#define EMAC_MAC_VLAN_INCL0_VLT_SHIFT            (0U)
/*! VLT - VLAN Tag for Transmit Packets */
#define EMAC_MAC_VLAN_INCL0_VLT(x)               (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_VLAN_INCL0_VLT_SHIFT)) & EMAC_MAC_VLAN_INCL0_VLT_MASK)

#define EMAC_MAC_VLAN_INCL0_CSVL_MASK            (0x80000U)
#define EMAC_MAC_VLAN_INCL0_CSVL_SHIFT           (19U)
/*! CSVL - C-VLAN or S-VLAN
 *  0b0..C-VLAN type (0x8100) is inserted
 *  0b1..S-VLAN type (0x88A8) is inserted
 */
#define EMAC_MAC_VLAN_INCL0_CSVL(x)              (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_VLAN_INCL0_CSVL_SHIFT)) & EMAC_MAC_VLAN_INCL0_CSVL_MASK)
/*! @} */

/*! @name MAC_VLAN_INCL1 - MAC VLAN Inclusion 1 */
/*! @{ */

#define EMAC_MAC_VLAN_INCL1_VLT_MASK             (0xFFFFU)
#define EMAC_MAC_VLAN_INCL1_VLT_SHIFT            (0U)
/*! VLT - VLAN Tag for Transmit Packets */
#define EMAC_MAC_VLAN_INCL1_VLT(x)               (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_VLAN_INCL1_VLT_SHIFT)) & EMAC_MAC_VLAN_INCL1_VLT_MASK)

#define EMAC_MAC_VLAN_INCL1_CSVL_MASK            (0x80000U)
#define EMAC_MAC_VLAN_INCL1_CSVL_SHIFT           (19U)
/*! CSVL - C-VLAN or S-VLAN
 *  0b0..C-VLAN type (0x8100) is inserted
 *  0b1..S-VLAN type (0x88A8) is inserted
 */
#define EMAC_MAC_VLAN_INCL1_CSVL(x)              (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_VLAN_INCL1_CSVL_SHIFT)) & EMAC_MAC_VLAN_INCL1_CSVL_MASK)
/*! @} */

/*! @name MAC_VLAN_INCL2 - MAC VLAN Inclusion 2 */
/*! @{ */

#define EMAC_MAC_VLAN_INCL2_VLT_MASK             (0xFFFFU)
#define EMAC_MAC_VLAN_INCL2_VLT_SHIFT            (0U)
/*! VLT - VLAN Tag for Transmit Packets */
#define EMAC_MAC_VLAN_INCL2_VLT(x)               (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_VLAN_INCL2_VLT_SHIFT)) & EMAC_MAC_VLAN_INCL2_VLT_MASK)

#define EMAC_MAC_VLAN_INCL2_CSVL_MASK            (0x80000U)
#define EMAC_MAC_VLAN_INCL2_CSVL_SHIFT           (19U)
/*! CSVL - C-VLAN or S-VLAN
 *  0b0..C-VLAN type (0x8100) is inserted
 *  0b1..S-VLAN type (0x88A8) is inserted
 */
#define EMAC_MAC_VLAN_INCL2_CSVL(x)              (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_VLAN_INCL2_CSVL_SHIFT)) & EMAC_MAC_VLAN_INCL2_CSVL_MASK)
/*! @} */

/*! @name MAC_VLAN_INCL3 - MAC VLAN Inclusion 3 */
/*! @{ */

#define EMAC_MAC_VLAN_INCL3_VLT_MASK             (0xFFFFU)
#define EMAC_MAC_VLAN_INCL3_VLT_SHIFT            (0U)
/*! VLT - VLAN Tag for Transmit Packets */
#define EMAC_MAC_VLAN_INCL3_VLT(x)               (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_VLAN_INCL3_VLT_SHIFT)) & EMAC_MAC_VLAN_INCL3_VLT_MASK)

