zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXE/periph6/PERI_EMAC.h
#define EMAC_MAC_VLAN_INCL3_CSVL_MASK            (0x80000U)
#define EMAC_MAC_VLAN_INCL3_CSVL_SHIFT           (19U)
/*! CSVL - C-VLAN or S-VLAN
 *  0b0..C-VLAN type (0x8100) is inserted
 *  0b1..S-VLAN type (0x88A8) is inserted
 */
#define EMAC_MAC_VLAN_INCL3_CSVL(x)              (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_VLAN_INCL3_CSVL_SHIFT)) & EMAC_MAC_VLAN_INCL3_CSVL_MASK)
/*! @} */

/*! @name MAC_VLAN_INCL4 - MAC VLAN Inclusion 4 */
/*! @{ */

#define EMAC_MAC_VLAN_INCL4_VLT_MASK             (0xFFFFU)
#define EMAC_MAC_VLAN_INCL4_VLT_SHIFT            (0U)
/*! VLT - VLAN Tag for Transmit Packets */
#define EMAC_MAC_VLAN_INCL4_VLT(x)               (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_VLAN_INCL4_VLT_SHIFT)) & EMAC_MAC_VLAN_INCL4_VLT_MASK)

#define EMAC_MAC_VLAN_INCL4_CSVL_MASK            (0x80000U)
#define EMAC_MAC_VLAN_INCL4_CSVL_SHIFT           (19U)
/*! CSVL - C-VLAN or S-VLAN
 *  0b0..C-VLAN type (0x8100) is inserted
 *  0b1..S-VLAN type (0x88A8) is inserted
 */
#define EMAC_MAC_VLAN_INCL4_CSVL(x)              (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_VLAN_INCL4_CSVL_SHIFT)) & EMAC_MAC_VLAN_INCL4_CSVL_MASK)
/*! @} */

/*! @name MAC_VLAN_INCL5 - MAC VLAN Inclusion 5 */
/*! @{ */

#define EMAC_MAC_VLAN_INCL5_VLT_MASK             (0xFFFFU)
#define EMAC_MAC_VLAN_INCL5_VLT_SHIFT            (0U)
/*! VLT - VLAN Tag for Transmit Packets */
#define EMAC_MAC_VLAN_INCL5_VLT(x)               (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_VLAN_INCL5_VLT_SHIFT)) & EMAC_MAC_VLAN_INCL5_VLT_MASK)

#define EMAC_MAC_VLAN_INCL5_CSVL_MASK            (0x80000U)
#define EMAC_MAC_VLAN_INCL5_CSVL_SHIFT           (19U)
/*! CSVL - C-VLAN or S-VLAN
 *  0b0..C-VLAN type (0x8100) is inserted
 *  0b1..S-VLAN type (0x88A8) is inserted
 */
#define EMAC_MAC_VLAN_INCL5_CSVL(x)              (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_VLAN_INCL5_CSVL_SHIFT)) & EMAC_MAC_VLAN_INCL5_CSVL_MASK)
/*! @} */

/*! @name MAC_VLAN_INCL6 - MAC VLAN Inclusion 6 */
/*! @{ */

#define EMAC_MAC_VLAN_INCL6_VLT_MASK             (0xFFFFU)
#define EMAC_MAC_VLAN_INCL6_VLT_SHIFT            (0U)
/*! VLT - VLAN Tag for Transmit Packets */
#define EMAC_MAC_VLAN_INCL6_VLT(x)               (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_VLAN_INCL6_VLT_SHIFT)) & EMAC_MAC_VLAN_INCL6_VLT_MASK)

#define EMAC_MAC_VLAN_INCL6_CSVL_MASK            (0x80000U)
#define EMAC_MAC_VLAN_INCL6_CSVL_SHIFT           (19U)
/*! CSVL - C-VLAN or S-VLAN
 *  0b0..C-VLAN type (0x8100) is inserted
 *  0b1..S-VLAN type (0x88A8) is inserted
 */
#define EMAC_MAC_VLAN_INCL6_CSVL(x)              (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_VLAN_INCL6_CSVL_SHIFT)) & EMAC_MAC_VLAN_INCL6_CSVL_MASK)
/*! @} */

/*! @name MAC_VLAN_INCL7 - MAC VLAN Inclusion 7 */
/*! @{ */

#define EMAC_MAC_VLAN_INCL7_VLT_MASK             (0xFFFFU)
#define EMAC_MAC_VLAN_INCL7_VLT_SHIFT            (0U)
/*! VLT - VLAN Tag for Transmit Packets */
#define EMAC_MAC_VLAN_INCL7_VLT(x)               (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_VLAN_INCL7_VLT_SHIFT)) & EMAC_MAC_VLAN_INCL7_VLT_MASK)

#define EMAC_MAC_VLAN_INCL7_CSVL_MASK            (0x80000U)
#define EMAC_MAC_VLAN_INCL7_CSVL_SHIFT           (19U)
/*! CSVL - C-VLAN or S-VLAN
 *  0b0..C-VLAN type (0x8100) is inserted
 *  0b1..S-VLAN type (0x88A8) is inserted
 */
#define EMAC_MAC_VLAN_INCL7_CSVL(x)              (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_VLAN_INCL7_CSVL_SHIFT)) & EMAC_MAC_VLAN_INCL7_CSVL_MASK)
/*! @} */

/*! @name MAC_VLAN_INCL - MAC VLAN Inclusion Or Replacement */
/*! @{ */

#define EMAC_MAC_VLAN_INCL_VLT_MASK              (0xFFFFU)
#define EMAC_MAC_VLAN_INCL_VLT_SHIFT             (0U)
/*! VLT - VLAN Tag For Transmit Packets */
#define EMAC_MAC_VLAN_INCL_VLT(x)                (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_VLAN_INCL_VLT_SHIFT)) & EMAC_MAC_VLAN_INCL_VLT_MASK)

#define EMAC_MAC_VLAN_INCL_VLC_MASK              (0x30000U)
#define EMAC_MAC_VLAN_INCL_VLC_SHIFT             (16U)
/*! VLC - VLAN Tag Control
 *  0b00..No VLAN tag deletion, insertion, or replacement
 *  0b01..VLAN tag deletion
 *  0b10..VLAN tag insertion
 *  0b11..VLAN tag replacement
 */
#define EMAC_MAC_VLAN_INCL_VLC(x)                (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_VLAN_INCL_VLC_SHIFT)) & EMAC_MAC_VLAN_INCL_VLC_MASK)

#define EMAC_MAC_VLAN_INCL_VLP_MASK              (0x40000U)
#define EMAC_MAC_VLAN_INCL_VLP_SHIFT             (18U)
/*! VLP - VLAN Priority Control
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define EMAC_MAC_VLAN_INCL_VLP(x)                (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_VLAN_INCL_VLP_SHIFT)) & EMAC_MAC_VLAN_INCL_VLP_MASK)

#define EMAC_MAC_VLAN_INCL_CSVL_MASK             (0x80000U)
#define EMAC_MAC_VLAN_INCL_CSVL_SHIFT            (19U)
/*! CSVL - C-VLAN Or S-VLAN
 *  0b0..C-VLAN
 *  0b1..S-VLAN
 */
#define EMAC_MAC_VLAN_INCL_CSVL(x)               (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_VLAN_INCL_CSVL_SHIFT)) & EMAC_MAC_VLAN_INCL_CSVL_MASK)

#define EMAC_MAC_VLAN_INCL_VLTI_MASK             (0x100000U)
#define EMAC_MAC_VLAN_INCL_VLTI_SHIFT            (20U)
/*! VLTI - VLAN Tag Input
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define EMAC_MAC_VLAN_INCL_VLTI(x)               (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_VLAN_INCL_VLTI_SHIFT)) & EMAC_MAC_VLAN_INCL_VLTI_MASK)

#define EMAC_MAC_VLAN_INCL_CBTI_MASK             (0x200000U)
#define EMAC_MAC_VLAN_INCL_CBTI_SHIFT            (21U)
/*! CBTI - Channel-Based Tag Insertion
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define EMAC_MAC_VLAN_INCL_CBTI(x)               (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_VLAN_INCL_CBTI_SHIFT)) & EMAC_MAC_VLAN_INCL_CBTI_MASK)

#define EMAC_MAC_VLAN_INCL_ADDR_MASK             (0x1000000U)
#define EMAC_MAC_VLAN_INCL_ADDR_SHIFT            (24U)
/*! ADDR - Address */
#define EMAC_MAC_VLAN_INCL_ADDR(x)               (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_VLAN_INCL_ADDR_SHIFT)) & EMAC_MAC_VLAN_INCL_ADDR_MASK)

#define EMAC_MAC_VLAN_INCL_RDWR_MASK             (0x40000000U)
#define EMAC_MAC_VLAN_INCL_RDWR_SHIFT            (30U)
/*! RDWR - Read Write Control
 *  0b0..Read operation of indirect access
 *  0b1..Write operation of indirect access
 */
#define EMAC_MAC_VLAN_INCL_RDWR(x)               (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_VLAN_INCL_RDWR_SHIFT)) & EMAC_MAC_VLAN_INCL_RDWR_MASK)

#define EMAC_MAC_VLAN_INCL_BUSY_MASK             (0x80000000U)
#define EMAC_MAC_VLAN_INCL_BUSY_SHIFT            (31U)
/*! BUSY - Busy
 *  0b0..Busy status not detected
 *  0b1..Busy status detected
 */
#define EMAC_MAC_VLAN_INCL_BUSY(x)               (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_VLAN_INCL_BUSY_SHIFT)) & EMAC_MAC_VLAN_INCL_BUSY_MASK)
/*! @} */

