zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXE/periph6/PERI_EMAC.h
/*! @name MAC_INNER_VLAN_INCL - Inner VLAN Tag Inclusion Or Replacement */
/*! @{ */

#define EMAC_MAC_INNER_VLAN_INCL_VLT_MASK        (0xFFFFU)
#define EMAC_MAC_INNER_VLAN_INCL_VLT_SHIFT       (0U)
/*! VLT - VLAN Tag For Transmit Packets */
#define EMAC_MAC_INNER_VLAN_INCL_VLT(x)          (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_INNER_VLAN_INCL_VLT_SHIFT)) & EMAC_MAC_INNER_VLAN_INCL_VLT_MASK)

#define EMAC_MAC_INNER_VLAN_INCL_VLC_MASK        (0x30000U)
#define EMAC_MAC_INNER_VLAN_INCL_VLC_SHIFT       (16U)
/*! VLC - VLAN Tag Control in Transmit Packets
 *  0b00..No VLAN tag deletion, insertion, or replacement
 *  0b01..VLAN tag deletion
 *  0b10..VLAN tag insertion
 *  0b11..VLAN tag replacement
 */
#define EMAC_MAC_INNER_VLAN_INCL_VLC(x)          (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_INNER_VLAN_INCL_VLC_SHIFT)) & EMAC_MAC_INNER_VLAN_INCL_VLC_MASK)

#define EMAC_MAC_INNER_VLAN_INCL_VLP_MASK        (0x40000U)
#define EMAC_MAC_INNER_VLAN_INCL_VLP_SHIFT       (18U)
/*! VLP - VLAN Priority Control
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define EMAC_MAC_INNER_VLAN_INCL_VLP(x)          (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_INNER_VLAN_INCL_VLP_SHIFT)) & EMAC_MAC_INNER_VLAN_INCL_VLP_MASK)

#define EMAC_MAC_INNER_VLAN_INCL_CSVL_MASK       (0x80000U)
#define EMAC_MAC_INNER_VLAN_INCL_CSVL_SHIFT      (19U)
/*! CSVL - C-VLAN Or S-VLAN
 *  0b0..C-VLAN type (8100h)
 *  0b1..S-VLAN type (88A8h)
 */
#define EMAC_MAC_INNER_VLAN_INCL_CSVL(x)         (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_INNER_VLAN_INCL_CSVL_SHIFT)) & EMAC_MAC_INNER_VLAN_INCL_CSVL_MASK)

#define EMAC_MAC_INNER_VLAN_INCL_VLTI_MASK       (0x100000U)
#define EMAC_MAC_INNER_VLAN_INCL_VLTI_SHIFT      (20U)
/*! VLTI - VLAN Tag Input
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define EMAC_MAC_INNER_VLAN_INCL_VLTI(x)         (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_INNER_VLAN_INCL_VLTI_SHIFT)) & EMAC_MAC_INNER_VLAN_INCL_VLTI_MASK)
/*! @} */

/*! @name MAC_TX_FLOW_CTRL_Q - MAC Q0 Tx Flow Control */
/*! @{ */

#define EMAC_MAC_TX_FLOW_CTRL_Q_FCB_BPA_MASK     (0x1U)
#define EMAC_MAC_TX_FLOW_CTRL_Q_FCB_BPA_SHIFT    (0U)
/*! FCB_BPA - Flow Control Busy Or Backpressure Activate
 *  0b0..Flow control busy or backpressure activate is disabled
 *  0b1..Flow control busy or backpressure activate is enabled
 */
#define EMAC_MAC_TX_FLOW_CTRL_Q_FCB_BPA(x)       (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_TX_FLOW_CTRL_Q_FCB_BPA_SHIFT)) & EMAC_MAC_TX_FLOW_CTRL_Q_FCB_BPA_MASK)

#define EMAC_MAC_TX_FLOW_CTRL_Q_TFE_MASK         (0x2U)
#define EMAC_MAC_TX_FLOW_CTRL_Q_TFE_SHIFT        (1U)
/*! TFE - Transmit Flow Control Enable
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define EMAC_MAC_TX_FLOW_CTRL_Q_TFE(x)           (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_TX_FLOW_CTRL_Q_TFE_SHIFT)) & EMAC_MAC_TX_FLOW_CTRL_Q_TFE_MASK)

#define EMAC_MAC_TX_FLOW_CTRL_Q_PLT_MASK         (0x70U)
#define EMAC_MAC_TX_FLOW_CTRL_Q_PLT_SHIFT        (4U)
/*! PLT - Pause Low Threshold
 *  0b000..Pause time minus 4 slot times (PT is 4 slot times)
 *  0b001..Pause time minus 28 slot times (PT is 28 slot times)
 *  0b010..Pause time minus 36 slot times (PT is 36 slot times)
 *  0b011..Pause time minus 144 slot times (PT is 144 slot times)
 *  0b100..Pause time minus 256 slot times (PT is 256 slot times)
 *  0b101..Pause time minus 512 slot times (PT is 512 slot times)
 *  0b110..Reserved
 */
#define EMAC_MAC_TX_FLOW_CTRL_Q_PLT(x)           (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_TX_FLOW_CTRL_Q_PLT_SHIFT)) & EMAC_MAC_TX_FLOW_CTRL_Q_PLT_MASK)

#define EMAC_MAC_TX_FLOW_CTRL_Q_DZPQ_MASK        (0x80U)
#define EMAC_MAC_TX_FLOW_CTRL_Q_DZPQ_SHIFT       (7U)
/*! DZPQ - Disable Zero-Quanta Pause
 *  0b0..Enabled
 *  0b1..Disabled
 */
#define EMAC_MAC_TX_FLOW_CTRL_Q_DZPQ(x)          (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_TX_FLOW_CTRL_Q_DZPQ_SHIFT)) & EMAC_MAC_TX_FLOW_CTRL_Q_DZPQ_MASK)

#define EMAC_MAC_TX_FLOW_CTRL_Q_PT_MASK          (0xFFFF0000U)
#define EMAC_MAC_TX_FLOW_CTRL_Q_PT_SHIFT         (16U)
/*! PT - Pause Time */
#define EMAC_MAC_TX_FLOW_CTRL_Q_PT(x)            (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_TX_FLOW_CTRL_Q_PT_SHIFT)) & EMAC_MAC_TX_FLOW_CTRL_Q_PT_MASK)
/*! @} */

/*! @name MAC_RX_FLOW_CTRL - MAC Receive Flow Control */
/*! @{ */

#define EMAC_MAC_RX_FLOW_CTRL_RFE_MASK           (0x1U)
#define EMAC_MAC_RX_FLOW_CTRL_RFE_SHIFT          (0U)
/*! RFE - Receive Flow Control Enable
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define EMAC_MAC_RX_FLOW_CTRL_RFE(x)             (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_RX_FLOW_CTRL_RFE_SHIFT)) & EMAC_MAC_RX_FLOW_CTRL_RFE_MASK)

#define EMAC_MAC_RX_FLOW_CTRL_UP_MASK            (0x2U)
#define EMAC_MAC_RX_FLOW_CTRL_UP_SHIFT           (1U)
/*! UP - Unicast Pause Packet Detect
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define EMAC_MAC_RX_FLOW_CTRL_UP(x)              (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_RX_FLOW_CTRL_UP_SHIFT)) & EMAC_MAC_RX_FLOW_CTRL_UP_MASK)
/*! @} */

/*! @name MAC_RXQ_CTRL4 - MAC RxQ Control 4 */
/*! @{ */

#define EMAC_MAC_RXQ_CTRL4_UFFQE_MASK            (0x1U)
#define EMAC_MAC_RXQ_CTRL4_UFFQE_SHIFT           (0U)
/*! UFFQE - Unicast Address Filter Fail Packets Queuing Enable
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define EMAC_MAC_RXQ_CTRL4_UFFQE(x)              (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_RXQ_CTRL4_UFFQE_SHIFT)) & EMAC_MAC_RXQ_CTRL4_UFFQE_MASK)

#define EMAC_MAC_RXQ_CTRL4_UFFQ_MASK             (0x2U)
#define EMAC_MAC_RXQ_CTRL4_UFFQ_SHIFT            (1U)
/*! UFFQ - Unicast Address Filter Fail Packets Queue */
#define EMAC_MAC_RXQ_CTRL4_UFFQ(x)               (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_RXQ_CTRL4_UFFQ_SHIFT)) & EMAC_MAC_RXQ_CTRL4_UFFQ_MASK)

#define EMAC_MAC_RXQ_CTRL4_MFFQE_MASK            (0x100U)
#define EMAC_MAC_RXQ_CTRL4_MFFQE_SHIFT           (8U)
/*! MFFQE - Multicast Address Filter Fail Packets Queuing Enable
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define EMAC_MAC_RXQ_CTRL4_MFFQE(x)              (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_RXQ_CTRL4_MFFQE_SHIFT)) & EMAC_MAC_RXQ_CTRL4_MFFQE_MASK)

#define EMAC_MAC_RXQ_CTRL4_MFFQ_MASK             (0x200U)
#define EMAC_MAC_RXQ_CTRL4_MFFQ_SHIFT            (9U)
/*! MFFQ - Multicast Address Filter Fail Packets Queue */
#define EMAC_MAC_RXQ_CTRL4_MFFQ(x)               (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_RXQ_CTRL4_MFFQ_SHIFT)) & EMAC_MAC_RXQ_CTRL4_MFFQ_MASK)

