zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXE/periph6/PERI_EMAC.h
#define EMAC_MAC_RXQ_CTRL4_VFFQE_MASK            (0x10000U)
#define EMAC_MAC_RXQ_CTRL4_VFFQE_SHIFT           (16U)
/*! VFFQE - VLAN Tag Filter Fail Packets Queuing Enable
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define EMAC_MAC_RXQ_CTRL4_VFFQE(x)              (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_RXQ_CTRL4_VFFQE_SHIFT)) & EMAC_MAC_RXQ_CTRL4_VFFQE_MASK)

#define EMAC_MAC_RXQ_CTRL4_VFFQ_MASK             (0x20000U)
#define EMAC_MAC_RXQ_CTRL4_VFFQ_SHIFT            (17U)
/*! VFFQ - VLAN Tag Filter Fail Packets Queue */
#define EMAC_MAC_RXQ_CTRL4_VFFQ(x)               (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_RXQ_CTRL4_VFFQ_SHIFT)) & EMAC_MAC_RXQ_CTRL4_VFFQ_MASK)
/*! @} */

/*! @name MAC_RXQ_CTRL - MAC RxQ Control 0..MAC RxQ Control 2 */
/*! @{ */

#define EMAC_MAC_RXQ_CTRL_AVCPQ_MASK             (0x7U)
#define EMAC_MAC_RXQ_CTRL_AVCPQ_SHIFT            (0U)
/*! AVCPQ - AV Untagged Control Packets Queue
 *  0b000..Receive queue 0
 *  0b001..Receive queue 1
 *  0b010..Receive queue 2
 *  0b011..Receive queue 3
 *  0b100..Receive queue 4
 *  0b101..Receive queue 5
 *  0b110..Receive queue 6
 *  0b111..Receive queue 7
 */
#define EMAC_MAC_RXQ_CTRL_AVCPQ(x)               (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_RXQ_CTRL_AVCPQ_SHIFT)) & EMAC_MAC_RXQ_CTRL_AVCPQ_MASK)

#define EMAC_MAC_RXQ_CTRL_PSRQ0_MASK             (0xFFU)
#define EMAC_MAC_RXQ_CTRL_PSRQ0_SHIFT            (0U)
/*! PSRQ0 - Priorities Selected In Receive Queue 0 */
#define EMAC_MAC_RXQ_CTRL_PSRQ0(x)               (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_RXQ_CTRL_PSRQ0_SHIFT)) & EMAC_MAC_RXQ_CTRL_PSRQ0_MASK)

#define EMAC_MAC_RXQ_CTRL_RXQ0EN_MASK            (0x3U)
#define EMAC_MAC_RXQ_CTRL_RXQ0EN_SHIFT           (0U)
/*! RXQ0EN - Receive Queue 0 Enable
 *  0b00..Queue not enabled
 *  0b01..Queue enabled for AV
 *  0b10..Queue enabled for DCB/generic
 *  0b11..Reserved
 */
#define EMAC_MAC_RXQ_CTRL_RXQ0EN(x)              (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_RXQ_CTRL_RXQ0EN_SHIFT)) & EMAC_MAC_RXQ_CTRL_RXQ0EN_MASK)

#define EMAC_MAC_RXQ_CTRL_RXQ1EN_MASK            (0xCU)
#define EMAC_MAC_RXQ_CTRL_RXQ1EN_SHIFT           (2U)
/*! RXQ1EN - Receive Queue 1 Enable
 *  0b00..Queue not enabled
 *  0b01..Queue enabled for AV
 *  0b10..Queue enabled for DCB/generic
 *  0b11..Reserved
 */
#define EMAC_MAC_RXQ_CTRL_RXQ1EN(x)              (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_RXQ_CTRL_RXQ1EN_SHIFT)) & EMAC_MAC_RXQ_CTRL_RXQ1EN_MASK)

#define EMAC_MAC_RXQ_CTRL_PTPQ_MASK              (0x70U)
#define EMAC_MAC_RXQ_CTRL_PTPQ_SHIFT             (4U)
/*! PTPQ - PTP Packets Queue
 *  0b000..Receive queue 0
 *  0b001..Receive queue 1
 *  0b010..Receive queue 2
 *  0b011..Receive queue 3
 *  0b100..Receive queue 4
 *  0b101..Receive queue 5
 *  0b110..Receive queue 6
 *  0b111..Receive queue 7
 */
#define EMAC_MAC_RXQ_CTRL_PTPQ(x)                (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_RXQ_CTRL_PTPQ_SHIFT)) & EMAC_MAC_RXQ_CTRL_PTPQ_MASK)

#define EMAC_MAC_RXQ_CTRL_PSRQ1_MASK             (0xFF00U)
#define EMAC_MAC_RXQ_CTRL_PSRQ1_SHIFT            (8U)
/*! PSRQ1 - Priorities Selected In Receive Queue 1 */
#define EMAC_MAC_RXQ_CTRL_PSRQ1(x)               (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_RXQ_CTRL_PSRQ1_SHIFT)) & EMAC_MAC_RXQ_CTRL_PSRQ1_MASK)

#define EMAC_MAC_RXQ_CTRL_UPQ_MASK               (0x7000U)
#define EMAC_MAC_RXQ_CTRL_UPQ_SHIFT              (12U)
/*! UPQ - Untagged Packet Queue
 *  0b000..Receive queue 0
 *  0b001..Receive queue 1
 *  0b010..Receive queue 2
 *  0b011..Receive queue 3
 *  0b100..Receive queue 4
 *  0b101..Receive queue 5
 *  0b110..Receive queue 6
 *  0b111..Receive queue 7
 */
#define EMAC_MAC_RXQ_CTRL_UPQ(x)                 (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_RXQ_CTRL_UPQ_SHIFT)) & EMAC_MAC_RXQ_CTRL_UPQ_MASK)

#define EMAC_MAC_RXQ_CTRL_MCBCQ_MASK             (0x70000U)
#define EMAC_MAC_RXQ_CTRL_MCBCQ_SHIFT            (16U)
/*! MCBCQ - Multicast And Broadcast Queue
 *  0b000..Receive queue 0
 *  0b001..Receive queue 1
 *  0b010..Receive queue 2
 *  0b011..Receive queue 3
 *  0b100..Receive queue 4
 *  0b101..Receive queue 5
 *  0b110..Receive queue 6
 *  0b111..Receive queue 7
 */
#define EMAC_MAC_RXQ_CTRL_MCBCQ(x)               (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_RXQ_CTRL_MCBCQ_SHIFT)) & EMAC_MAC_RXQ_CTRL_MCBCQ_MASK)

#define EMAC_MAC_RXQ_CTRL_MCBCQEN_MASK           (0x100000U)
#define EMAC_MAC_RXQ_CTRL_MCBCQEN_SHIFT          (20U)
/*! MCBCQEN - Multicast And Broadcast Queue Enable
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define EMAC_MAC_RXQ_CTRL_MCBCQEN(x)             (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_RXQ_CTRL_MCBCQEN_SHIFT)) & EMAC_MAC_RXQ_CTRL_MCBCQEN_MASK)

#define EMAC_MAC_RXQ_CTRL_TACPQE_MASK            (0x200000U)
#define EMAC_MAC_RXQ_CTRL_TACPQE_SHIFT           (21U)
/*! TACPQE - Tagged AV Control Packets Queuing Enable
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define EMAC_MAC_RXQ_CTRL_TACPQE(x)              (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_RXQ_CTRL_TACPQE_SHIFT)) & EMAC_MAC_RXQ_CTRL_TACPQE_MASK)

#define EMAC_MAC_RXQ_CTRL_TPQC_MASK              (0xC00000U)
#define EMAC_MAC_RXQ_CTRL_TPQC_SHIFT             (22U)
/*! TPQC - Tagged PTP Over Ethernet Packets Queuing Control */
#define EMAC_MAC_RXQ_CTRL_TPQC(x)                (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_RXQ_CTRL_TPQC_SHIFT)) & EMAC_MAC_RXQ_CTRL_TPQC_MASK)

#define EMAC_MAC_RXQ_CTRL_FPRQ_MASK              (0x7000000U)
#define EMAC_MAC_RXQ_CTRL_FPRQ_SHIFT             (24U)
/*! FPRQ - Frame Preemption Residue Queue */
#define EMAC_MAC_RXQ_CTRL_FPRQ(x)                (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_RXQ_CTRL_FPRQ_SHIFT)) & EMAC_MAC_RXQ_CTRL_FPRQ_MASK)
/*! @} */

/*! @name MAC_INTERRUPT_STATUS - MAC Interrupt Status */
/*! @{ */

#define EMAC_MAC_INTERRUPT_STATUS_PHYIS_MASK     (0x8U)
#define EMAC_MAC_INTERRUPT_STATUS_PHYIS_SHIFT    (3U)
/*! PHYIS - PHY Interrupt
 *  0b0..Not detected
 *  0b1..Detected
 */
#define EMAC_MAC_INTERRUPT_STATUS_PHYIS(x)       (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_INTERRUPT_STATUS_PHYIS_SHIFT)) & EMAC_MAC_INTERRUPT_STATUS_PHYIS_MASK)

#define EMAC_MAC_INTERRUPT_STATUS_MMCIS_MASK     (0x100U)
#define EMAC_MAC_INTERRUPT_STATUS_MMCIS_SHIFT    (8U)
/*! MMCIS - MMC Interrupt Status
 *  0b0..Inactive
 *  0b1..Active
 */
#define EMAC_MAC_INTERRUPT_STATUS_MMCIS(x)       (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_INTERRUPT_STATUS_MMCIS_SHIFT)) & EMAC_MAC_INTERRUPT_STATUS_MMCIS_MASK)

#define EMAC_MAC_INTERRUPT_STATUS_MMCRXIS_MASK   (0x200U)
#define EMAC_MAC_INTERRUPT_STATUS_MMCRXIS_SHIFT  (9U)
/*! MMCRXIS - MMC Receive Interrupt Status
 *  0b0..Inactive
 *  0b1..Active
 */
#define EMAC_MAC_INTERRUPT_STATUS_MMCRXIS(x)     (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_INTERRUPT_STATUS_MMCRXIS_SHIFT)) & EMAC_MAC_INTERRUPT_STATUS_MMCRXIS_MASK)

#define EMAC_MAC_INTERRUPT_STATUS_MMCTXIS_MASK   (0x400U)
#define EMAC_MAC_INTERRUPT_STATUS_MMCTXIS_SHIFT  (10U)
/*! MMCTXIS - MMC Transmit Interrupt Status
 *  0b0..Inactive
 *  0b1..Active
 */
#define EMAC_MAC_INTERRUPT_STATUS_MMCTXIS(x)     (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_INTERRUPT_STATUS_MMCTXIS_SHIFT)) & EMAC_MAC_INTERRUPT_STATUS_MMCTXIS_MASK)

