zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXE/periph6/PERI_EMAC.h
#define EMAC_MAC_INTERRUPT_STATUS_TSIS_MASK      (0x1000U)
#define EMAC_MAC_INTERRUPT_STATUS_TSIS_SHIFT     (12U)
/*! TSIS - Timestamp Interrupt Status
 *  0b0..Inactive
 *  0b1..Active
 */
#define EMAC_MAC_INTERRUPT_STATUS_TSIS(x)        (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_INTERRUPT_STATUS_TSIS_SHIFT)) & EMAC_MAC_INTERRUPT_STATUS_TSIS_MASK)

#define EMAC_MAC_INTERRUPT_STATUS_TXSTSIS_MASK   (0x2000U)
#define EMAC_MAC_INTERRUPT_STATUS_TXSTSIS_SHIFT  (13U)
/*! TXSTSIS - Transmit Status Interrupt
 *  0b0..Inactive
 *  0b1..Active
 */
#define EMAC_MAC_INTERRUPT_STATUS_TXSTSIS(x)     (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_INTERRUPT_STATUS_TXSTSIS_SHIFT)) & EMAC_MAC_INTERRUPT_STATUS_TXSTSIS_MASK)

#define EMAC_MAC_INTERRUPT_STATUS_RXSTSIS_MASK   (0x4000U)
#define EMAC_MAC_INTERRUPT_STATUS_RXSTSIS_SHIFT  (14U)
/*! RXSTSIS - Receive Status Interrupt
 *  0b0..Inactive
 *  0b1..Active
 */
#define EMAC_MAC_INTERRUPT_STATUS_RXSTSIS(x)     (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_INTERRUPT_STATUS_RXSTSIS_SHIFT)) & EMAC_MAC_INTERRUPT_STATUS_RXSTSIS_MASK)

#define EMAC_MAC_INTERRUPT_STATUS_FPEIS_MASK     (0x20000U)
#define EMAC_MAC_INTERRUPT_STATUS_FPEIS_SHIFT    (17U)
/*! FPEIS - Frame Preemption Interrupt Status
 *  0b0..Inactive
 *  0b1..Ative
 */
#define EMAC_MAC_INTERRUPT_STATUS_FPEIS(x)       (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_INTERRUPT_STATUS_FPEIS_SHIFT)) & EMAC_MAC_INTERRUPT_STATUS_FPEIS_MASK)

#define EMAC_MAC_INTERRUPT_STATUS_MDIOIS_MASK    (0x40000U)
#define EMAC_MAC_INTERRUPT_STATUS_MDIOIS_SHIFT   (18U)
/*! MDIOIS - MDIO Interrupt Status
 *  0b0..Inactive
 *  0b1..Active
 */
#define EMAC_MAC_INTERRUPT_STATUS_MDIOIS(x)      (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_INTERRUPT_STATUS_MDIOIS_SHIFT)) & EMAC_MAC_INTERRUPT_STATUS_MDIOIS_MASK)

#define EMAC_MAC_INTERRUPT_STATUS_MFTIS_MASK     (0x80000U)
#define EMAC_MAC_INTERRUPT_STATUS_MFTIS_SHIFT    (19U)
/*! MFTIS - MMC FPE Transmit Interrupt Status
 *  0b0..Inactive
 *  0b1..Active
 */
#define EMAC_MAC_INTERRUPT_STATUS_MFTIS(x)       (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_INTERRUPT_STATUS_MFTIS_SHIFT)) & EMAC_MAC_INTERRUPT_STATUS_MFTIS_MASK)

#define EMAC_MAC_INTERRUPT_STATUS_MFRIS_MASK     (0x100000U)
#define EMAC_MAC_INTERRUPT_STATUS_MFRIS_SHIFT    (20U)
/*! MFRIS - MMC FPE Receive Interrupt Status
 *  0b0..Inactive
 *  0b1..Active
 */
#define EMAC_MAC_INTERRUPT_STATUS_MFRIS(x)       (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_INTERRUPT_STATUS_MFRIS_SHIFT)) & EMAC_MAC_INTERRUPT_STATUS_MFRIS_MASK)
/*! @} */

/*! @name MAC_INTERRUPT_ENABLE - MAC Interrupt Enable */
/*! @{ */

#define EMAC_MAC_INTERRUPT_ENABLE_PHYIE_MASK     (0x8U)
#define EMAC_MAC_INTERRUPT_ENABLE_PHYIE_SHIFT    (3U)
/*! PHYIE - PHY Interrupt Enable
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define EMAC_MAC_INTERRUPT_ENABLE_PHYIE(x)       (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_INTERRUPT_ENABLE_PHYIE_SHIFT)) & EMAC_MAC_INTERRUPT_ENABLE_PHYIE_MASK)

#define EMAC_MAC_INTERRUPT_ENABLE_TSIE_MASK      (0x1000U)
#define EMAC_MAC_INTERRUPT_ENABLE_TSIE_SHIFT     (12U)
/*! TSIE - Timestamp Interrupt Enable
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define EMAC_MAC_INTERRUPT_ENABLE_TSIE(x)        (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_INTERRUPT_ENABLE_TSIE_SHIFT)) & EMAC_MAC_INTERRUPT_ENABLE_TSIE_MASK)

#define EMAC_MAC_INTERRUPT_ENABLE_TXSTSIE_MASK   (0x2000U)
#define EMAC_MAC_INTERRUPT_ENABLE_TXSTSIE_SHIFT  (13U)
/*! TXSTSIE - Transmit Status Interrupt Enable
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define EMAC_MAC_INTERRUPT_ENABLE_TXSTSIE(x)     (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_INTERRUPT_ENABLE_TXSTSIE_SHIFT)) & EMAC_MAC_INTERRUPT_ENABLE_TXSTSIE_MASK)

#define EMAC_MAC_INTERRUPT_ENABLE_RXSTSIE_MASK   (0x4000U)
#define EMAC_MAC_INTERRUPT_ENABLE_RXSTSIE_SHIFT  (14U)
/*! RXSTSIE - Receive Status Interrupt Enable
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define EMAC_MAC_INTERRUPT_ENABLE_RXSTSIE(x)     (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_INTERRUPT_ENABLE_RXSTSIE_SHIFT)) & EMAC_MAC_INTERRUPT_ENABLE_RXSTSIE_MASK)

#define EMAC_MAC_INTERRUPT_ENABLE_FPEIE_MASK     (0x20000U)
#define EMAC_MAC_INTERRUPT_ENABLE_FPEIE_SHIFT    (17U)
/*! FPEIE - Frame Preemption Interrupt Enable
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define EMAC_MAC_INTERRUPT_ENABLE_FPEIE(x)       (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_INTERRUPT_ENABLE_FPEIE_SHIFT)) & EMAC_MAC_INTERRUPT_ENABLE_FPEIE_MASK)

#define EMAC_MAC_INTERRUPT_ENABLE_MDIOIE_MASK    (0x40000U)
#define EMAC_MAC_INTERRUPT_ENABLE_MDIOIE_SHIFT   (18U)
/*! MDIOIE - MDIO Interrupt Enable
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define EMAC_MAC_INTERRUPT_ENABLE_MDIOIE(x)      (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_INTERRUPT_ENABLE_MDIOIE_SHIFT)) & EMAC_MAC_INTERRUPT_ENABLE_MDIOIE_MASK)
/*! @} */

/*! @name MAC_RX_TX_STATUS - MAC Rx Transmit Status */
/*! @{ */

#define EMAC_MAC_RX_TX_STATUS_TJT_MASK           (0x1U)
#define EMAC_MAC_RX_TX_STATUS_TJT_SHIFT          (0U)
/*! TJT - Transmit Jabber Timeout
 *  0b0..No transmit jabber timeout occurred
 *  0b1..Transmit jabber timeout occurred
 */
#define EMAC_MAC_RX_TX_STATUS_TJT(x)             (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_RX_TX_STATUS_TJT_SHIFT)) & EMAC_MAC_RX_TX_STATUS_TJT_MASK)

#define EMAC_MAC_RX_TX_STATUS_NCARR_MASK         (0x2U)
#define EMAC_MAC_RX_TX_STATUS_NCARR_SHIFT        (1U)
/*! NCARR - No Carrier
 *  0b0..Present
 *  0b1..Absent
 */
#define EMAC_MAC_RX_TX_STATUS_NCARR(x)           (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_RX_TX_STATUS_NCARR_SHIFT)) & EMAC_MAC_RX_TX_STATUS_NCARR_MASK)

#define EMAC_MAC_RX_TX_STATUS_LCARR_MASK         (0x4U)
#define EMAC_MAC_RX_TX_STATUS_LCARR_SHIFT        (2U)
/*! LCARR - Loss of Carrier
 *  0b0..Carrier is present
 *  0b1..Loss of carrier
 */
#define EMAC_MAC_RX_TX_STATUS_LCARR(x)           (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_RX_TX_STATUS_LCARR_SHIFT)) & EMAC_MAC_RX_TX_STATUS_LCARR_MASK)

#define EMAC_MAC_RX_TX_STATUS_EXDEF_MASK         (0x8U)
#define EMAC_MAC_RX_TX_STATUS_EXDEF_SHIFT        (3U)
/*! EXDEF - Excessive Deferral
 *  0b0..No excessive deferral
 *  0b1..Excessive deferral
 */
#define EMAC_MAC_RX_TX_STATUS_EXDEF(x)           (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_RX_TX_STATUS_EXDEF_SHIFT)) & EMAC_MAC_RX_TX_STATUS_EXDEF_MASK)

