zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXE/periph6/PERI_EMAC.h
#define EMAC_MAC_RX_TX_STATUS_LCOL_MASK          (0x10U)
#define EMAC_MAC_RX_TX_STATUS_LCOL_SHIFT         (4U)
/*! LCOL - Late Collision
 *  0b0..No collision
 *  0b1..Late collision is sensed
 */
#define EMAC_MAC_RX_TX_STATUS_LCOL(x)            (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_RX_TX_STATUS_LCOL_SHIFT)) & EMAC_MAC_RX_TX_STATUS_LCOL_MASK)

#define EMAC_MAC_RX_TX_STATUS_EXCOL_MASK         (0x20U)
#define EMAC_MAC_RX_TX_STATUS_EXCOL_SHIFT        (5U)
/*! EXCOL - Excessive Collisions
 *  0b0..No collision
 *  0b1..Excessive collision is sensed
 */
#define EMAC_MAC_RX_TX_STATUS_EXCOL(x)           (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_RX_TX_STATUS_EXCOL_SHIFT)) & EMAC_MAC_RX_TX_STATUS_EXCOL_MASK)

#define EMAC_MAC_RX_TX_STATUS_RWT_MASK           (0x100U)
#define EMAC_MAC_RX_TX_STATUS_RWT_SHIFT          (8U)
/*! RWT - Receive Watchdog Timeout
 *  0b0..No receive watchdog timed out
 *  0b1..Receive watchdog timed out
 */
#define EMAC_MAC_RX_TX_STATUS_RWT(x)             (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_RX_TX_STATUS_RWT_SHIFT)) & EMAC_MAC_RX_TX_STATUS_RWT_MASK)
/*! @} */

/*! @name MAC_VERSION - MAC Version */
/*! @{ */

#define EMAC_MAC_VERSION_IPVER_MASK              (0xFFU)
#define EMAC_MAC_VERSION_IPVER_SHIFT             (0U)
/*! IPVER - IP Version */
#define EMAC_MAC_VERSION_IPVER(x)                (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_VERSION_IPVER_SHIFT)) & EMAC_MAC_VERSION_IPVER_MASK)

#define EMAC_MAC_VERSION_CFGVER_MASK             (0xFF00U)
#define EMAC_MAC_VERSION_CFGVER_SHIFT            (8U)
/*! CFGVER - IP Configuration Version */
#define EMAC_MAC_VERSION_CFGVER(x)               (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_VERSION_CFGVER_SHIFT)) & EMAC_MAC_VERSION_CFGVER_MASK)
/*! @} */

/*! @name MAC_DEBUG - MAC Debug */
/*! @{ */

#define EMAC_MAC_DEBUG_RPESTS_MASK               (0x1U)
#define EMAC_MAC_DEBUG_RPESTS_SHIFT              (0U)
/*! RPESTS - Receive Protocol Engine Status
 *  0b0..Not detected
 *  0b1..Detected
 */
#define EMAC_MAC_DEBUG_RPESTS(x)                 (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_DEBUG_RPESTS_SHIFT)) & EMAC_MAC_DEBUG_RPESTS_MASK)

#define EMAC_MAC_DEBUG_RFCFCSTS_MASK             (0x6U)
#define EMAC_MAC_DEBUG_RFCFCSTS_SHIFT            (1U)
/*! RFCFCSTS - MAC Receive Packet Controller FIFO Status
 *  0b00..Inactive
 *  0b01..Active
 */
#define EMAC_MAC_DEBUG_RFCFCSTS(x)               (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_DEBUG_RFCFCSTS_SHIFT)) & EMAC_MAC_DEBUG_RFCFCSTS_MASK)

#define EMAC_MAC_DEBUG_TPESTS_MASK               (0x10000U)
#define EMAC_MAC_DEBUG_TPESTS_SHIFT              (16U)
/*! TPESTS - MAC GMII Or MII Transmit Protocol Engine Status
 *  0b0..Not detected
 *  0b1..Detected
 */
#define EMAC_MAC_DEBUG_TPESTS(x)                 (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_DEBUG_TPESTS_SHIFT)) & EMAC_MAC_DEBUG_TPESTS_MASK)

#define EMAC_MAC_DEBUG_TFCSTS_MASK               (0x60000U)
#define EMAC_MAC_DEBUG_TFCSTS_SHIFT              (17U)
/*! TFCSTS - MAC Transmit Packet Controller Status
 *  0b00..Idle state
 *  0b01..Waiting for one of these: status of the previous packet or IPG, or for the back-off period to be over
 *  0b10..Generating and transmitting a pause control packet (in Full-Duplex mode)
 *  0b11..Transferring input packet for transmission
 */
#define EMAC_MAC_DEBUG_TFCSTS(x)                 (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_DEBUG_TFCSTS_SHIFT)) & EMAC_MAC_DEBUG_TFCSTS_MASK)
/*! @} */

/*! @name MAC_HW_FEAT - MAC Hardware Feature 0..MAC Hardware Feature 3 */
/*! @{ */

#define EMAC_MAC_HW_FEAT_MIISEL_MASK             (0x1U)
#define EMAC_MAC_HW_FEAT_MIISEL_SHIFT            (0U)
/*! MIISEL - 10 or 100 Mbit/s Support Feature
 *  0b0..Unavailable
 *  0b1..Available
 */
#define EMAC_MAC_HW_FEAT_MIISEL(x)               (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_HW_FEAT_MIISEL_SHIFT)) & EMAC_MAC_HW_FEAT_MIISEL_MASK)

#define EMAC_MAC_HW_FEAT_NRVF_MASK               (0x7U)
#define EMAC_MAC_HW_FEAT_NRVF_SHIFT              (0U)
/*! NRVF
 *  0b000..No filters (0)
 *  0b001..4
 *  0b010..8
 *  0b011..16
 *  0b100..24
 *  0b101..32
 *  0b110..Reserved
 */
#define EMAC_MAC_HW_FEAT_NRVF(x)                 (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_HW_FEAT_NRVF_SHIFT)) & EMAC_MAC_HW_FEAT_NRVF_MASK)

#define EMAC_MAC_HW_FEAT_RXFIFOSIZE_MASK         (0x1FU)
#define EMAC_MAC_HW_FEAT_RXFIFOSIZE_SHIFT        (0U)
/*! RXFIFOSIZE - MTL Receive FIFO Size Feature
 *  0b00000..128 bytes
 *  0b00001..256 bytes
 *  0b00010..512 bytes
 *  0b00011..1024 bytes
 *  0b00100..2048 bytes
 *  0b00101..4096 bytes
 *  0b00110..8192 bytes
 *  0b00111..16384 bytes
 *  0b01000..32 KB
 *  0b01001..64 KB
 *  0b01010..128 KB
 *  0b01011..256 KB
 *  0b01100..Reserved
 */
#define EMAC_MAC_HW_FEAT_RXFIFOSIZE(x)           (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_HW_FEAT_RXFIFOSIZE_SHIFT)) & EMAC_MAC_HW_FEAT_RXFIFOSIZE_MASK)

#define EMAC_MAC_HW_FEAT_RXQCNT_MASK             (0xFU)
#define EMAC_MAC_HW_FEAT_RXQCNT_SHIFT            (0U)
/*! RXQCNT - Number Of MTL Receive Queues
 *  0b0000..1
 *  0b0001..2
 *  0b0010..3
 *  0b0011..4
 *  0b0100..5
 *  0b0101..6
 *  0b0110..7
 *  0b0111..8
 */
#define EMAC_MAC_HW_FEAT_RXQCNT(x)               (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_HW_FEAT_RXQCNT_SHIFT)) & EMAC_MAC_HW_FEAT_RXQCNT_MASK)

#define EMAC_MAC_HW_FEAT_GMIISEL_MASK            (0x2U)
#define EMAC_MAC_HW_FEAT_GMIISEL_SHIFT           (1U)
/*! GMIISEL - 1000 Mbit/s Support Feature
 *  0b0..Unavailable
 *  0b1..Available
 */
#define EMAC_MAC_HW_FEAT_GMIISEL(x)              (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_HW_FEAT_GMIISEL_SHIFT)) & EMAC_MAC_HW_FEAT_GMIISEL_MASK)

#define EMAC_MAC_HW_FEAT_HDSEL_MASK              (0x4U)
#define EMAC_MAC_HW_FEAT_HDSEL_SHIFT             (2U)
/*! HDSEL - Half-Duplex Support Feature
 *  0b0..Unavailable
 *  0b1..Available
 */
#define EMAC_MAC_HW_FEAT_HDSEL(x)                (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_HW_FEAT_HDSEL_SHIFT)) & EMAC_MAC_HW_FEAT_HDSEL_MASK)

#define EMAC_MAC_HW_FEAT_PCSSEL_MASK             (0x8U)
#define EMAC_MAC_HW_FEAT_PCSSEL_SHIFT            (3U)
/*! PCSSEL - PCS Select
 *  0b0..No
 *  0b1..Yes
 */
#define EMAC_MAC_HW_FEAT_PCSSEL(x)               (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_HW_FEAT_PCSSEL_SHIFT)) & EMAC_MAC_HW_FEAT_PCSSEL_MASK)

