zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXE/periph6/PERI_EMAC.h
#define EMAC_MAC_HW_FEAT_CBTISEL_MASK            (0x10U)
#define EMAC_MAC_HW_FEAT_CBTISEL_SHIFT           (4U)
/*! CBTISEL - Queue/Channel Based VLAN Tag Insertion On Transmit Feature
 *  0b0..Not selected
 *  0b1..Selected
 */
#define EMAC_MAC_HW_FEAT_CBTISEL(x)              (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_HW_FEAT_CBTISEL_SHIFT)) & EMAC_MAC_HW_FEAT_CBTISEL_MASK)

#define EMAC_MAC_HW_FEAT_VLHASH_MASK             (0x10U)
#define EMAC_MAC_HW_FEAT_VLHASH_SHIFT            (4U)
/*! VLHASH - VLAN Hash Filter Feature
 *  0b0..Not selected
 *  0b1..Selected
 */
#define EMAC_MAC_HW_FEAT_VLHASH(x)               (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_HW_FEAT_VLHASH_SHIFT)) & EMAC_MAC_HW_FEAT_VLHASH_MASK)

#define EMAC_MAC_HW_FEAT_DVLAN_MASK              (0x20U)
#define EMAC_MAC_HW_FEAT_DVLAN_SHIFT             (5U)
/*! DVLAN - Double VLAN Tag Processing Feature
 *  0b0..Not selected
 *  0b1..Selected
 */
#define EMAC_MAC_HW_FEAT_DVLAN(x)                (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_HW_FEAT_DVLAN_SHIFT)) & EMAC_MAC_HW_FEAT_DVLAN_MASK)

#define EMAC_MAC_HW_FEAT_SMASEL_MASK             (0x20U)
#define EMAC_MAC_HW_FEAT_SMASEL_SHIFT            (5U)
/*! SMASEL - SMA (MDIO) Interface Feature
 *  0b0..Not selected
 *  0b1..Selected
 */
#define EMAC_MAC_HW_FEAT_SMASEL(x)               (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_HW_FEAT_SMASEL_SHIFT)) & EMAC_MAC_HW_FEAT_SMASEL_MASK)

#define EMAC_MAC_HW_FEAT_SPRAM_MASK              (0x20U)
#define EMAC_MAC_HW_FEAT_SPRAM_SHIFT             (5U)
/*! SPRAM - Single Port RAM Feature
 *  0b0..Not selected
 *  0b1..Selected
 */
#define EMAC_MAC_HW_FEAT_SPRAM(x)                (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_HW_FEAT_SPRAM_SHIFT)) & EMAC_MAC_HW_FEAT_SPRAM_MASK)

#define EMAC_MAC_HW_FEAT_RWKSEL_MASK             (0x40U)
#define EMAC_MAC_HW_FEAT_RWKSEL_SHIFT            (6U)
/*! RWKSEL - PMT Remote Wake-Up Packet Feature
 *  0b0..Not selected
 *  0b1..Selected
 */
#define EMAC_MAC_HW_FEAT_RWKSEL(x)               (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_HW_FEAT_RWKSEL_SHIFT)) & EMAC_MAC_HW_FEAT_RWKSEL_MASK)

#define EMAC_MAC_HW_FEAT_TXFIFOSIZE_MASK         (0x7C0U)
#define EMAC_MAC_HW_FEAT_TXFIFOSIZE_SHIFT        (6U)
/*! TXFIFOSIZE - MTL Transmit FIFO Size Feature
 *  0b00000..128 bytes
 *  0b00001..256 bytes
 *  0b00010..512 bytes
 *  0b00011..1024 bytes
 *  0b00100..2048 bytes
 *  0b00101..4096 bytes
 *  0b00110..8192 bytes
 *  0b00111..16384 bytes
 *  0b01000..32 KB
 *  0b01001..64 KB
 *  0b01010..128 KB
 *  0b01011..Reserved
 */
#define EMAC_MAC_HW_FEAT_TXFIFOSIZE(x)           (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_HW_FEAT_TXFIFOSIZE_SHIFT)) & EMAC_MAC_HW_FEAT_TXFIFOSIZE_MASK)

#define EMAC_MAC_HW_FEAT_TXQCNT_MASK             (0x3C0U)
#define EMAC_MAC_HW_FEAT_TXQCNT_SHIFT            (6U)
/*! TXQCNT - Number Of MTL Transmit Queues
 *  0b0000..1
 *  0b0001..2
 *  0b0010..3
 *  0b0011..4
 *  0b0100..5
 *  0b0101..6
 *  0b0110..7
 *  0b0111..8
 */
#define EMAC_MAC_HW_FEAT_TXQCNT(x)               (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_HW_FEAT_TXQCNT_SHIFT)) & EMAC_MAC_HW_FEAT_TXQCNT_MASK)

#define EMAC_MAC_HW_FEAT_MGKSEL_MASK             (0x80U)
#define EMAC_MAC_HW_FEAT_MGKSEL_SHIFT            (7U)
/*! MGKSEL - PMT Magic Packet Feature
 *  0b0..Not selected
 *  0b1..Selected
 */
#define EMAC_MAC_HW_FEAT_MGKSEL(x)               (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_HW_FEAT_MGKSEL_SHIFT)) & EMAC_MAC_HW_FEAT_MGKSEL_MASK)

#define EMAC_MAC_HW_FEAT_MMCSEL_MASK             (0x100U)
#define EMAC_MAC_HW_FEAT_MMCSEL_SHIFT            (8U)
/*! MMCSEL - MAC Management Counters (MMC) Feature
 *  0b0..Not selected
 *  0b1..Selected
 */
#define EMAC_MAC_HW_FEAT_MMCSEL(x)               (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_HW_FEAT_MMCSEL_SHIFT)) & EMAC_MAC_HW_FEAT_MMCSEL_MASK)

#define EMAC_MAC_HW_FEAT_ARPOFFSEL_MASK          (0x200U)
#define EMAC_MAC_HW_FEAT_ARPOFFSEL_SHIFT         (9U)
/*! ARPOFFSEL - ARP Offload Feature
 *  0b0..Not selected
 *  0b1..Selected
 */
#define EMAC_MAC_HW_FEAT_ARPOFFSEL(x)            (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_HW_FEAT_ARPOFFSEL_SHIFT)) & EMAC_MAC_HW_FEAT_ARPOFFSEL_MASK)

#define EMAC_MAC_HW_FEAT_PDUPSEL_MASK            (0x200U)
#define EMAC_MAC_HW_FEAT_PDUPSEL_SHIFT           (9U)
/*! PDUPSEL - Broadcast/Multicast Packet Duplication Feature
 *  0b0..Not selected
 *  0b1..Selected
 */
#define EMAC_MAC_HW_FEAT_PDUPSEL(x)              (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_HW_FEAT_PDUPSEL_SHIFT)) & EMAC_MAC_HW_FEAT_PDUPSEL_MASK)

#define EMAC_MAC_HW_FEAT_FRPSEL_MASK             (0x400U)
#define EMAC_MAC_HW_FEAT_FRPSEL_SHIFT            (10U)
/*! FRPSEL - Flexible Receive Parser Feature
 *  0b0..Not selected
 *  0b1..Selected
 */
#define EMAC_MAC_HW_FEAT_FRPSEL(x)               (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_HW_FEAT_FRPSEL_SHIFT)) & EMAC_MAC_HW_FEAT_FRPSEL_MASK)

#define EMAC_MAC_HW_FEAT_FRPBS_MASK              (0x1800U)
#define EMAC_MAC_HW_FEAT_FRPBS_SHIFT             (11U)
/*! FRPBS - Flexible Receive Parser Buffer Size
 *  0b00..64
 *  0b01..128
 *  0b10..256
 *  0b11..Reserved
 */
#define EMAC_MAC_HW_FEAT_FRPBS(x)                (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_HW_FEAT_FRPBS_SHIFT)) & EMAC_MAC_HW_FEAT_FRPBS_MASK)

#define EMAC_MAC_HW_FEAT_OSTEN_MASK              (0x800U)
#define EMAC_MAC_HW_FEAT_OSTEN_SHIFT             (11U)
/*! OSTEN - One-Step Timestamping Enable Feature
 *  0b0..Not selected
 *  0b1..Selected
 */
#define EMAC_MAC_HW_FEAT_OSTEN(x)                (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_HW_FEAT_OSTEN_SHIFT)) & EMAC_MAC_HW_FEAT_OSTEN_MASK)

#define EMAC_MAC_HW_FEAT_PTOEN_MASK              (0x1000U)
#define EMAC_MAC_HW_FEAT_PTOEN_SHIFT             (12U)
/*! PTOEN - PTP Offload Enable Feature
 *  0b0..Not selected
 *  0b1..Selected
 */
#define EMAC_MAC_HW_FEAT_PTOEN(x)                (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_HW_FEAT_PTOEN_SHIFT)) & EMAC_MAC_HW_FEAT_PTOEN_MASK)

#define EMAC_MAC_HW_FEAT_RXCHCNT_MASK            (0xF000U)
#define EMAC_MAC_HW_FEAT_RXCHCNT_SHIFT           (12U)
/*! RXCHCNT - Number Of DMA Receive Channels
 *  0b0000..1
 *  0b0001..2
 *  0b0010..3
 *  0b0011..4
 *  0b0100..5
 *  0b0101..6
 *  0b0110..7
 *  0b0111..8
 */
#define EMAC_MAC_HW_FEAT_RXCHCNT(x)              (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_HW_FEAT_RXCHCNT_SHIFT)) & EMAC_MAC_HW_FEAT_RXCHCNT_MASK)

#define EMAC_MAC_HW_FEAT_TSSEL_MASK              (0x1000U)
#define EMAC_MAC_HW_FEAT_TSSEL_SHIFT             (12U)
/*! TSSEL - IEEE 1588-2008 Timestamp Feature
 *  0b0..Not selected
 *  0b1..Selected
 */
#define EMAC_MAC_HW_FEAT_TSSEL(x)                (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_HW_FEAT_TSSEL_SHIFT)) & EMAC_MAC_HW_FEAT_TSSEL_MASK)

#define EMAC_MAC_HW_FEAT_ADVTHWORD_MASK          (0x2000U)
#define EMAC_MAC_HW_FEAT_ADVTHWORD_SHIFT         (13U)
/*! ADVTHWORD - IEEE 1588 High-Word Feature
 *  0b0..Not selected
 *  0b1..Selected
 */
#define EMAC_MAC_HW_FEAT_ADVTHWORD(x)            (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_HW_FEAT_ADVTHWORD_SHIFT)) & EMAC_MAC_HW_FEAT_ADVTHWORD_MASK)

