zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXE/periph6/PERI_EMAC.h
#define EMAC_MAC_HW_FEAT_EEESEL_MASK             (0x2000U)
#define EMAC_MAC_HW_FEAT_EEESEL_SHIFT            (13U)
/*! EEESEL - Energy Efficient Ethernet (EEE) Feature
 *  0b0..Not selected
 *  0b1..Selected
 */
#define EMAC_MAC_HW_FEAT_EEESEL(x)               (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_HW_FEAT_EEESEL_SHIFT)) & EMAC_MAC_HW_FEAT_EEESEL_MASK)

#define EMAC_MAC_HW_FEAT_FRPES_MASK              (0x6000U)
#define EMAC_MAC_HW_FEAT_FRPES_SHIFT             (13U)
/*! FRPES - Flexible Receive Parser Table Entry Size
 *  0b00..64
 *  0b01..128
 *  0b10..256
 *  0b11..Reserved
 */
#define EMAC_MAC_HW_FEAT_FRPES(x)                (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_HW_FEAT_FRPES_SHIFT)) & EMAC_MAC_HW_FEAT_FRPES_MASK)

#define EMAC_MAC_HW_FEAT_ADDR64_MASK             (0xC000U)
#define EMAC_MAC_HW_FEAT_ADDR64_SHIFT            (14U)
/*! ADDR64 - Address Width Feature
 *  0b00..32
 *  0b01..40
 *  0b10..48
 *  0b11..Reserved
 */
#define EMAC_MAC_HW_FEAT_ADDR64(x)               (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_HW_FEAT_ADDR64_SHIFT)) & EMAC_MAC_HW_FEAT_ADDR64_MASK)

#define EMAC_MAC_HW_FEAT_TXCOESEL_MASK           (0x4000U)
#define EMAC_MAC_HW_FEAT_TXCOESEL_SHIFT          (14U)
/*! TXCOESEL - Transmit Checksum Offload Feature
 *  0b0..Not selected
 *  0b1..Selected
 */
#define EMAC_MAC_HW_FEAT_TXCOESEL(x)             (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_HW_FEAT_TXCOESEL_SHIFT)) & EMAC_MAC_HW_FEAT_TXCOESEL_MASK)

#define EMAC_MAC_HW_FEAT_DCBEN_MASK              (0x10000U)
#define EMAC_MAC_HW_FEAT_DCBEN_SHIFT             (16U)
/*! DCBEN - DCB Enable Feature
 *  0b0..Not selected
 *  0b1..Selected
 */
#define EMAC_MAC_HW_FEAT_DCBEN(x)                (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_HW_FEAT_DCBEN_SHIFT)) & EMAC_MAC_HW_FEAT_DCBEN_MASK)

#define EMAC_MAC_HW_FEAT_ESTSEL_MASK             (0x10000U)
#define EMAC_MAC_HW_FEAT_ESTSEL_SHIFT            (16U)
/*! ESTSEL - Enhancements To Scheduling Traffic Feature
 *  0b0..Not selected
 *  0b1..Selected
 */
#define EMAC_MAC_HW_FEAT_ESTSEL(x)               (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_HW_FEAT_ESTSEL_SHIFT)) & EMAC_MAC_HW_FEAT_ESTSEL_MASK)

#define EMAC_MAC_HW_FEAT_RXCOESEL_MASK           (0x10000U)
#define EMAC_MAC_HW_FEAT_RXCOESEL_SHIFT          (16U)
/*! RXCOESEL - Receive Checksum Offload Feature
 *  0b0..Not selected
 *  0b1..Selected
 */
#define EMAC_MAC_HW_FEAT_RXCOESEL(x)             (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_HW_FEAT_RXCOESEL_SHIFT)) & EMAC_MAC_HW_FEAT_RXCOESEL_MASK)

#define EMAC_MAC_HW_FEAT_ESTDEP_MASK             (0xE0000U)
#define EMAC_MAC_HW_FEAT_ESTDEP_SHIFT            (17U)
/*! ESTDEP - Depth Of Gate Control List
 *  0b000..No depth configured
 *  0b001..64 bytes
 *  0b010..128 bytes
 *  0b011..256 bytes
 *  0b100..512 bytes
 *  0b101..1024 bytes
 *  0b110..Reserved
 */
#define EMAC_MAC_HW_FEAT_ESTDEP(x)               (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_HW_FEAT_ESTDEP_SHIFT)) & EMAC_MAC_HW_FEAT_ESTDEP_MASK)

#define EMAC_MAC_HW_FEAT_SPHEN_MASK              (0x20000U)
#define EMAC_MAC_HW_FEAT_SPHEN_SHIFT             (17U)
/*! SPHEN - Split Header Enable Feature
 *  0b0..Not selected
 *  0b1..Selected
 */
#define EMAC_MAC_HW_FEAT_SPHEN(x)                (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_HW_FEAT_SPHEN_SHIFT)) & EMAC_MAC_HW_FEAT_SPHEN_MASK)

#define EMAC_MAC_HW_FEAT_ADDMACADRSEL_MASK       (0x7C0000U)
#define EMAC_MAC_HW_FEAT_ADDMACADRSEL_SHIFT      (18U)
/*! ADDMACADRSEL - MAC Addresses 1-31
 *  0b00000..Not selected
 *  0b00001..Selected
 */
#define EMAC_MAC_HW_FEAT_ADDMACADRSEL(x)         (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_HW_FEAT_ADDMACADRSEL_SHIFT)) & EMAC_MAC_HW_FEAT_ADDMACADRSEL_MASK)

#define EMAC_MAC_HW_FEAT_TSOEN_MASK              (0x40000U)
#define EMAC_MAC_HW_FEAT_TSOEN_SHIFT             (18U)
/*! TSOEN - TCP Segmentation Offload Enable Feature
 *  0b0..Not selected
 *  0b1..Selected
 */
#define EMAC_MAC_HW_FEAT_TSOEN(x)                (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_HW_FEAT_TSOEN_SHIFT)) & EMAC_MAC_HW_FEAT_TSOEN_MASK)

#define EMAC_MAC_HW_FEAT_TXCHCNT_MASK            (0x3C0000U)
#define EMAC_MAC_HW_FEAT_TXCHCNT_SHIFT           (18U)
/*! TXCHCNT - Number Of DMA Transmit Channels
 *  0b0000..1
 *  0b0001..2
 *  0b0010..3
 *  0b0011..4
 *  0b0100..5
 *  0b0101..6
 *  0b0110..7
 *  0b0111..8
 */
#define EMAC_MAC_HW_FEAT_TXCHCNT(x)              (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_HW_FEAT_TXCHCNT_SHIFT)) & EMAC_MAC_HW_FEAT_TXCHCNT_MASK)

#define EMAC_MAC_HW_FEAT_DBGMEMA_MASK            (0x80000U)
#define EMAC_MAC_HW_FEAT_DBGMEMA_SHIFT           (19U)
/*! DBGMEMA - DMA Debug Registers Enable Feature
 *  0b0..Not selected
 *  0b1..Selected
 */
#define EMAC_MAC_HW_FEAT_DBGMEMA(x)              (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_HW_FEAT_DBGMEMA_SHIFT)) & EMAC_MAC_HW_FEAT_DBGMEMA_MASK)

#define EMAC_MAC_HW_FEAT_AVSEL_MASK              (0x100000U)
#define EMAC_MAC_HW_FEAT_AVSEL_SHIFT             (20U)
/*! AVSEL - AV Feature
 *  0b0..Not selected
 *  0b1..Selected
 */
#define EMAC_MAC_HW_FEAT_AVSEL(x)                (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_HW_FEAT_AVSEL_SHIFT)) & EMAC_MAC_HW_FEAT_AVSEL_MASK)

#define EMAC_MAC_HW_FEAT_ESTWID_MASK             (0x300000U)
#define EMAC_MAC_HW_FEAT_ESTWID_SHIFT            (20U)
/*! ESTWID - Estimated Time Interval Width
 *  0b00..Width not configured
 *  0b01..16 bits
 *  0b10..20 bits
 *  0b11..24 bits
 */
#define EMAC_MAC_HW_FEAT_ESTWID(x)               (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_HW_FEAT_ESTWID_SHIFT)) & EMAC_MAC_HW_FEAT_ESTWID_MASK)

#define EMAC_MAC_HW_FEAT_RAVSEL_MASK             (0x200000U)
#define EMAC_MAC_HW_FEAT_RAVSEL_SHIFT            (21U)
/*! RAVSEL - Receive Side-Only AV Feature
 *  0b0..Not selected
 *  0b1..Selected
 */
#define EMAC_MAC_HW_FEAT_RAVSEL(x)               (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_HW_FEAT_RAVSEL_SHIFT)) & EMAC_MAC_HW_FEAT_RAVSEL_MASK)

#define EMAC_MAC_HW_FEAT_MACADR32SEL_MASK        (0x800000U)
#define EMAC_MAC_HW_FEAT_MACADR32SEL_SHIFT       (23U)
/*! MACADR32SEL - MAC Addresses 32-63
 *  0b0..Not selected
 *  0b1..Selected
 */
#define EMAC_MAC_HW_FEAT_MACADR32SEL(x)          (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_HW_FEAT_MACADR32SEL_SHIFT)) & EMAC_MAC_HW_FEAT_MACADR32SEL_MASK)

#define EMAC_MAC_HW_FEAT_POUOST_MASK             (0x800000U)
#define EMAC_MAC_HW_FEAT_POUOST_SHIFT            (23U)
/*! POUOST - One Step For PTP Over UDP/IP Feature
 *  0b0..Not selected
 *  0b1..Selected
 */
#define EMAC_MAC_HW_FEAT_POUOST(x)               (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_HW_FEAT_POUOST_SHIFT)) & EMAC_MAC_HW_FEAT_POUOST_MASK)

#define EMAC_MAC_HW_FEAT_HASHTBLSZ_MASK          (0x3000000U)
#define EMAC_MAC_HW_FEAT_HASHTBLSZ_SHIFT         (24U)
/*! HASHTBLSZ - Hash Table Size
 *  0b00..No hash table
 *  0b01..64
 *  0b10..128
 *  0b11..256
 */
#define EMAC_MAC_HW_FEAT_HASHTBLSZ(x)            (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_HW_FEAT_HASHTBLSZ_SHIFT)) & EMAC_MAC_HW_FEAT_HASHTBLSZ_MASK)

