zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXE/periph6/PERI_EMAC.h
#define EMAC_MAC_HW_FEAT_MACADR64SEL_MASK        (0x1000000U)
#define EMAC_MAC_HW_FEAT_MACADR64SEL_SHIFT       (24U)
/*! MACADR64SEL - MAC Addresses 64-127
 *  0b0..Not selected
 *  0b1..Selected
 */
#define EMAC_MAC_HW_FEAT_MACADR64SEL(x)          (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_HW_FEAT_MACADR64SEL_SHIFT)) & EMAC_MAC_HW_FEAT_MACADR64SEL_MASK)

#define EMAC_MAC_HW_FEAT_PPSOUTNUM_MASK          (0x7000000U)
#define EMAC_MAC_HW_FEAT_PPSOUTNUM_SHIFT         (24U)
/*! PPSOUTNUM - Number Of PPS Outputs
 *  0b000..No PPS output (0)
 *  0b001..1
 *  0b010..2
 *  0b011..3
 *  0b100..4
 *  0b101..Reserved
 */
#define EMAC_MAC_HW_FEAT_PPSOUTNUM(x)            (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_HW_FEAT_PPSOUTNUM_SHIFT)) & EMAC_MAC_HW_FEAT_PPSOUTNUM_MASK)

#define EMAC_MAC_HW_FEAT_TSSTSSEL_MASK           (0x6000000U)
#define EMAC_MAC_HW_FEAT_TSSTSSEL_SHIFT          (25U)
/*! TSSTSSEL - Timestamp System Time Source Feature
 *  0b00..Internal
 *  0b01..External
 *  0b10..Both internal and external
 *  0b11..Reserved
 */
#define EMAC_MAC_HW_FEAT_TSSTSSEL(x)             (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_HW_FEAT_TSSTSSEL_SHIFT)) & EMAC_MAC_HW_FEAT_TSSTSSEL_MASK)

#define EMAC_MAC_HW_FEAT_FPESEL_MASK             (0x4000000U)
#define EMAC_MAC_HW_FEAT_FPESEL_SHIFT            (26U)
/*! FPESEL - Frame Preemption Feature
 *  0b0..Not selected
 *  0b1..Selected
 */
#define EMAC_MAC_HW_FEAT_FPESEL(x)               (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_HW_FEAT_FPESEL_SHIFT)) & EMAC_MAC_HW_FEAT_FPESEL_MASK)

#define EMAC_MAC_HW_FEAT_L3L4FNUM_MASK           (0x78000000U)
#define EMAC_MAC_HW_FEAT_L3L4FNUM_SHIFT          (27U)
/*! L3L4FNUM - L3 Or L4 Filter Number
 *  0b0000..No filters (0)
 *  0b0001..1
 *  0b0010..2
 *  0b0011..3
 *  0b0100..4
 *  0b0101..5
 *  0b0110..6
 *  0b0111..7
 *  0b1000..8
 */
#define EMAC_MAC_HW_FEAT_L3L4FNUM(x)             (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_HW_FEAT_L3L4FNUM_SHIFT)) & EMAC_MAC_HW_FEAT_L3L4FNUM_MASK)

#define EMAC_MAC_HW_FEAT_SAVLANINS_MASK          (0x8000000U)
#define EMAC_MAC_HW_FEAT_SAVLANINS_SHIFT         (27U)
/*! SAVLANINS - SA or VLAN Insertion Feature
 *  0b0..Not selected
 *  0b1..Selected
 */
#define EMAC_MAC_HW_FEAT_SAVLANINS(x)            (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_HW_FEAT_SAVLANINS_SHIFT)) & EMAC_MAC_HW_FEAT_SAVLANINS_MASK)

#define EMAC_MAC_HW_FEAT_TBSSEL_MASK             (0x8000000U)
#define EMAC_MAC_HW_FEAT_TBSSEL_SHIFT            (27U)
/*! TBSSEL - Time-Based Scheduling Feature
 *  0b0..Selected
 *  0b1..Selected
 */
#define EMAC_MAC_HW_FEAT_TBSSEL(x)               (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_HW_FEAT_TBSSEL_SHIFT)) & EMAC_MAC_HW_FEAT_TBSSEL_MASK)

#define EMAC_MAC_HW_FEAT_ACTPHYSEL_MASK          (0x70000000U)
#define EMAC_MAC_HW_FEAT_ACTPHYSEL_SHIFT         (28U)
/*! ACTPHYSEL - Active PHY Feature
 *  0b000..GMII or MII
 *  0b001..RGMII
 *  0b010..SGMII
 *  0b011..TBI
 *  0b100..RMII
 *  0b101..RTBI
 *  0b110..SMII
 *  0b111..RevMII
 */
#define EMAC_MAC_HW_FEAT_ACTPHYSEL(x)            (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_HW_FEAT_ACTPHYSEL_SHIFT)) & EMAC_MAC_HW_FEAT_ACTPHYSEL_MASK)

#define EMAC_MAC_HW_FEAT_ASP_MASK                (0x30000000U)
#define EMAC_MAC_HW_FEAT_ASP_SHIFT               (28U)
/*! ASP - Automotive Safety Package
 *  0b00..No safety features selected
 *  0b01..Only "ECC protection for external memory" feature is selected
 *  0b10..All the safety features are selected without the "parity port enable for external interface" feature
 *  0b11..All the safety features are selected with the "parity port enable for external interface" feature
 */
#define EMAC_MAC_HW_FEAT_ASP(x)                  (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_HW_FEAT_ASP_SHIFT)) & EMAC_MAC_HW_FEAT_ASP_MASK)

#define EMAC_MAC_HW_FEAT_AUXSNAPNUM_MASK         (0x70000000U)
#define EMAC_MAC_HW_FEAT_AUXSNAPNUM_SHIFT        (28U)
/*! AUXSNAPNUM - Number Of Auxiliary Snapshot Inputs
 *  0b000..No auxiliary input (0)
 *  0b001..1
 *  0b010..2
 *  0b011..3
 *  0b100..4
 *  0b101..Reserved
 */
#define EMAC_MAC_HW_FEAT_AUXSNAPNUM(x)           (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_HW_FEAT_AUXSNAPNUM_SHIFT)) & EMAC_MAC_HW_FEAT_AUXSNAPNUM_MASK)
/*! @} */

/*! @name MAC_DPP_FSM_INTERRUPT_STATUS - MAC DPP FSM Interrupt Status */
/*! @{ */

#define EMAC_MAC_DPP_FSM_INTERRUPT_STATUS_RDPES_MASK (0x4U)
#define EMAC_MAC_DPP_FSM_INTERRUPT_STATUS_RDPES_SHIFT (2U)
/*! RDPES - Read Descriptor Parity Checker Error Status
 *  0b0..Not detected
 *  0b1..Detected
 */
#define EMAC_MAC_DPP_FSM_INTERRUPT_STATUS_RDPES(x) (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_DPP_FSM_INTERRUPT_STATUS_RDPES_SHIFT)) & EMAC_MAC_DPP_FSM_INTERRUPT_STATUS_RDPES_MASK)

#define EMAC_MAC_DPP_FSM_INTERRUPT_STATUS_MPES_MASK (0x8U)
#define EMAC_MAC_DPP_FSM_INTERRUPT_STATUS_MPES_SHIFT (3U)
/*! MPES - MTL Data Path Parity Checker Error Status
 *  0b0..Not detected
 *  0b1..Detected
 */
#define EMAC_MAC_DPP_FSM_INTERRUPT_STATUS_MPES(x) (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_DPP_FSM_INTERRUPT_STATUS_MPES_SHIFT)) & EMAC_MAC_DPP_FSM_INTERRUPT_STATUS_MPES_MASK)

#define EMAC_MAC_DPP_FSM_INTERRUPT_STATUS_MTSPES_MASK (0x10U)
#define EMAC_MAC_DPP_FSM_INTERRUPT_STATUS_MTSPES_SHIFT (4U)
/*! MTSPES - MTL Transmit Status Data Path Parity Checker Error Status
 *  0b0..Not detected
 *  0b1..Detected
 */
#define EMAC_MAC_DPP_FSM_INTERRUPT_STATUS_MTSPES(x) (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_DPP_FSM_INTERRUPT_STATUS_MTSPES_SHIFT)) & EMAC_MAC_DPP_FSM_INTERRUPT_STATUS_MTSPES_MASK)

#define EMAC_MAC_DPP_FSM_INTERRUPT_STATUS_ARPES_MASK (0x20U)
#define EMAC_MAC_DPP_FSM_INTERRUPT_STATUS_ARPES_SHIFT (5U)
/*! ARPES - Application Receive Interface Data Path Parity Error Status
 *  0b0..Not detected
 *  0b1..Detected
 */
#define EMAC_MAC_DPP_FSM_INTERRUPT_STATUS_ARPES(x) (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_DPP_FSM_INTERRUPT_STATUS_ARPES_SHIFT)) & EMAC_MAC_DPP_FSM_INTERRUPT_STATUS_ARPES_MASK)

#define EMAC_MAC_DPP_FSM_INTERRUPT_STATUS_TTES_MASK (0x100U)
#define EMAC_MAC_DPP_FSM_INTERRUPT_STATUS_TTES_SHIFT (8U)
/*! TTES - Transmit FSM Timeout Error Status
 *  0b0..Not detected
 *  0b1..Detected
 */
#define EMAC_MAC_DPP_FSM_INTERRUPT_STATUS_TTES(x) (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_DPP_FSM_INTERRUPT_STATUS_TTES_SHIFT)) & EMAC_MAC_DPP_FSM_INTERRUPT_STATUS_TTES_MASK)

#define EMAC_MAC_DPP_FSM_INTERRUPT_STATUS_RTES_MASK (0x200U)
#define EMAC_MAC_DPP_FSM_INTERRUPT_STATUS_RTES_SHIFT (9U)
/*! RTES - Receive FSM Timeout Error Status
 *  0b0..Not detected
 *  0b1..Detected
 */
#define EMAC_MAC_DPP_FSM_INTERRUPT_STATUS_RTES(x) (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_DPP_FSM_INTERRUPT_STATUS_RTES_SHIFT)) & EMAC_MAC_DPP_FSM_INTERRUPT_STATUS_RTES_MASK)

#define EMAC_MAC_DPP_FSM_INTERRUPT_STATUS_ATES_MASK (0x800U)
#define EMAC_MAC_DPP_FSM_INTERRUPT_STATUS_ATES_SHIFT (11U)
/*! ATES - APP FSM Timeout Error Status
 *  0b0..Not detected
 *  0b1..Detected
 */
#define EMAC_MAC_DPP_FSM_INTERRUPT_STATUS_ATES(x) (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_DPP_FSM_INTERRUPT_STATUS_ATES_SHIFT)) & EMAC_MAC_DPP_FSM_INTERRUPT_STATUS_ATES_MASK)

