zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXE/periph6/PERI_EMAC.h
#define EMAC_MAC_DPP_FSM_INTERRUPT_STATUS_PTES_MASK (0x1000U)
#define EMAC_MAC_DPP_FSM_INTERRUPT_STATUS_PTES_SHIFT (12U)
/*! PTES - PTP FSM Timeout Error Status
 *  0b0..Not detected
 *  0b1..Detected
 */
#define EMAC_MAC_DPP_FSM_INTERRUPT_STATUS_PTES(x) (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_DPP_FSM_INTERRUPT_STATUS_PTES_SHIFT)) & EMAC_MAC_DPP_FSM_INTERRUPT_STATUS_PTES_MASK)

#define EMAC_MAC_DPP_FSM_INTERRUPT_STATUS_MSTTES_MASK (0x10000U)
#define EMAC_MAC_DPP_FSM_INTERRUPT_STATUS_MSTTES_SHIFT (16U)
/*! MSTTES - Master Read Or Write Timeout Error Status
 *  0b0..Not detected
 *  0b1..Detected
 */
#define EMAC_MAC_DPP_FSM_INTERRUPT_STATUS_MSTTES(x) (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_DPP_FSM_INTERRUPT_STATUS_MSTTES_SHIFT)) & EMAC_MAC_DPP_FSM_INTERRUPT_STATUS_MSTTES_MASK)

#define EMAC_MAC_DPP_FSM_INTERRUPT_STATUS_FSMPES_MASK (0x1000000U)
#define EMAC_MAC_DPP_FSM_INTERRUPT_STATUS_FSMPES_SHIFT (24U)
/*! FSMPES - FSM State Parity Error Status
 *  0b0..Not detected
 *  0b1..Detected
 */
#define EMAC_MAC_DPP_FSM_INTERRUPT_STATUS_FSMPES(x) (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_DPP_FSM_INTERRUPT_STATUS_FSMPES_SHIFT)) & EMAC_MAC_DPP_FSM_INTERRUPT_STATUS_FSMPES_MASK)
/*! @} */

/*! @name MAC_FSM_CONTROL - MAC FSM Control */
/*! @{ */

#define EMAC_MAC_FSM_CONTROL_TMOUTEN_MASK        (0x1U)
#define EMAC_MAC_FSM_CONTROL_TMOUTEN_SHIFT       (0U)
/*! TMOUTEN - Time Out Enable
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define EMAC_MAC_FSM_CONTROL_TMOUTEN(x)          (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_FSM_CONTROL_TMOUTEN_SHIFT)) & EMAC_MAC_FSM_CONTROL_TMOUTEN_MASK)

#define EMAC_MAC_FSM_CONTROL_PRTYEN_MASK         (0x2U)
#define EMAC_MAC_FSM_CONTROL_PRTYEN_SHIFT        (1U)
/*! PRTYEN - Parity Enable
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define EMAC_MAC_FSM_CONTROL_PRTYEN(x)           (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_FSM_CONTROL_PRTYEN_SHIFT)) & EMAC_MAC_FSM_CONTROL_PRTYEN_MASK)

#define EMAC_MAC_FSM_CONTROL_TTEIN_MASK          (0x100U)
#define EMAC_MAC_FSM_CONTROL_TTEIN_SHIFT         (8U)
/*! TTEIN - Transmit FSM Timeout Error Injection
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define EMAC_MAC_FSM_CONTROL_TTEIN(x)            (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_FSM_CONTROL_TTEIN_SHIFT)) & EMAC_MAC_FSM_CONTROL_TTEIN_MASK)

#define EMAC_MAC_FSM_CONTROL_RTEIN_MASK          (0x200U)
#define EMAC_MAC_FSM_CONTROL_RTEIN_SHIFT         (9U)
/*! RTEIN - Receive FSM Timeout Error Injection
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define EMAC_MAC_FSM_CONTROL_RTEIN(x)            (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_FSM_CONTROL_RTEIN_SHIFT)) & EMAC_MAC_FSM_CONTROL_RTEIN_MASK)

#define EMAC_MAC_FSM_CONTROL_ATEIN_MASK          (0x800U)
#define EMAC_MAC_FSM_CONTROL_ATEIN_SHIFT         (11U)
/*! ATEIN - APP FSM Timeout Error Injection
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define EMAC_MAC_FSM_CONTROL_ATEIN(x)            (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_FSM_CONTROL_ATEIN_SHIFT)) & EMAC_MAC_FSM_CONTROL_ATEIN_MASK)

#define EMAC_MAC_FSM_CONTROL_PTEIN_MASK          (0x1000U)
#define EMAC_MAC_FSM_CONTROL_PTEIN_SHIFT         (12U)
/*! PTEIN - PTP FSM Timeout Error Injection
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define EMAC_MAC_FSM_CONTROL_PTEIN(x)            (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_FSM_CONTROL_PTEIN_SHIFT)) & EMAC_MAC_FSM_CONTROL_PTEIN_MASK)

#define EMAC_MAC_FSM_CONTROL_TPEIN_MASK          (0x10000U)
#define EMAC_MAC_FSM_CONTROL_TPEIN_SHIFT         (16U)
/*! TPEIN - Transmit FSM Parity Error Injection
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define EMAC_MAC_FSM_CONTROL_TPEIN(x)            (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_FSM_CONTROL_TPEIN_SHIFT)) & EMAC_MAC_FSM_CONTROL_TPEIN_MASK)

#define EMAC_MAC_FSM_CONTROL_RPEIN_MASK          (0x20000U)
#define EMAC_MAC_FSM_CONTROL_RPEIN_SHIFT         (17U)
/*! RPEIN - Receive FSM Parity Error Injection
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define EMAC_MAC_FSM_CONTROL_RPEIN(x)            (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_FSM_CONTROL_RPEIN_SHIFT)) & EMAC_MAC_FSM_CONTROL_RPEIN_MASK)

#define EMAC_MAC_FSM_CONTROL_APEIN_MASK          (0x80000U)
#define EMAC_MAC_FSM_CONTROL_APEIN_SHIFT         (19U)
/*! APEIN - APP FSM Parity Error Injection
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define EMAC_MAC_FSM_CONTROL_APEIN(x)            (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_FSM_CONTROL_APEIN_SHIFT)) & EMAC_MAC_FSM_CONTROL_APEIN_MASK)

#define EMAC_MAC_FSM_CONTROL_PPEIN_MASK          (0x100000U)
#define EMAC_MAC_FSM_CONTROL_PPEIN_SHIFT         (20U)
/*! PPEIN - PTP FSM Parity Error Injection
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define EMAC_MAC_FSM_CONTROL_PPEIN(x)            (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_FSM_CONTROL_PPEIN_SHIFT)) & EMAC_MAC_FSM_CONTROL_PPEIN_MASK)

#define EMAC_MAC_FSM_CONTROL_TLGRNML_MASK        (0x1000000U)
#define EMAC_MAC_FSM_CONTROL_TLGRNML_SHIFT       (24U)
/*! TLGRNML - Transmit Large Or Normal Mode Select
 *  0b0..Normal mode
 *  0b1..Large mode
 */
#define EMAC_MAC_FSM_CONTROL_TLGRNML(x)          (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_FSM_CONTROL_TLGRNML_SHIFT)) & EMAC_MAC_FSM_CONTROL_TLGRNML_MASK)

#define EMAC_MAC_FSM_CONTROL_RLGRNML_MASK        (0x2000000U)
#define EMAC_MAC_FSM_CONTROL_RLGRNML_SHIFT       (25U)
/*! RLGRNML - Receive Large Or Normal Mode Select
 *  0b0..Normal mode
 *  0b1..Large mode
 */
#define EMAC_MAC_FSM_CONTROL_RLGRNML(x)          (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_FSM_CONTROL_RLGRNML_SHIFT)) & EMAC_MAC_FSM_CONTROL_RLGRNML_MASK)

#define EMAC_MAC_FSM_CONTROL_ALGRNML_MASK        (0x8000000U)
#define EMAC_MAC_FSM_CONTROL_ALGRNML_SHIFT       (27U)
/*! ALGRNML - APP Large Or Normal Mode Select
 *  0b0..Normal mode
 *  0b1..Large mode
 */
#define EMAC_MAC_FSM_CONTROL_ALGRNML(x)          (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_FSM_CONTROL_ALGRNML_SHIFT)) & EMAC_MAC_FSM_CONTROL_ALGRNML_MASK)

#define EMAC_MAC_FSM_CONTROL_PLGRNML_MASK        (0x10000000U)
#define EMAC_MAC_FSM_CONTROL_PLGRNML_SHIFT       (28U)
/*! PLGRNML - PTP Large Or Normal Mode Select
 *  0b0..Normal mode
 *  0b1..Large mode
 */
#define EMAC_MAC_FSM_CONTROL_PLGRNML(x)          (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_FSM_CONTROL_PLGRNML_SHIFT)) & EMAC_MAC_FSM_CONTROL_PLGRNML_MASK)
/*! @} */

/*! @name MAC_FSM_ACT_TIMER - MAC FSM ACT Timer */
/*! @{ */

#define EMAC_MAC_FSM_ACT_TIMER_TMR_MASK          (0x3FFU)
#define EMAC_MAC_FSM_ACT_TIMER_TMR_SHIFT         (0U)
/*! TMR - CSR Clocks For 1 us Tic */
#define EMAC_MAC_FSM_ACT_TIMER_TMR(x)            (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_FSM_ACT_TIMER_TMR_SHIFT)) & EMAC_MAC_FSM_ACT_TIMER_TMR_MASK)

#define EMAC_MAC_FSM_ACT_TIMER_NTMRMD_MASK       (0xF0000U)
#define EMAC_MAC_FSM_ACT_TIMER_NTMRMD_SHIFT      (16U)
/*! NTMRMD - Normal Mode Timeout Value
 *  0b0000..Timer disabled
 *  0b0001..1 us
 *  0b0010..1.024 ms (~4 ms)
 *  0b0011..16.384 ms (~16 ms)
 *  0b0100..65.536 ms (~64 ms)
 *  0b0101..262.144 ms (~256 ms)
 *  0b0110..1.048 sec (~1 sec)
 *  0b0111..4.194 sec (~4 sec)
 *  0b1000..16.777 sec (~16 sec)
 *  0b1001..33.554 sec (~32 sec)
 *  0b1010..67.108 sec (~64 sec)
 *  0b1011..Reserved
 */
#define EMAC_MAC_FSM_ACT_TIMER_NTMRMD(x)         (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_FSM_ACT_TIMER_NTMRMD_SHIFT)) & EMAC_MAC_FSM_ACT_TIMER_NTMRMD_MASK)

#define EMAC_MAC_FSM_ACT_TIMER_LTMRMD_MASK       (0xF00000U)
#define EMAC_MAC_FSM_ACT_TIMER_LTMRMD_SHIFT      (20U)
/*! LTMRMD - Large Mode Timeout Value
 *  0b0000..Timer disabled
 *  0b0001..1 us
 *  0b0010..1.024 ms (~4 ms)
 *  0b0011..16.384 ms (~16 ms)
 *  0b0100..65.536 ms (~64 ms)
 *  0b0101..262.144 ms (~256 ms)
 *  0b0110..1.048 sec (~1 sec)
 *  0b0111..4.194 sec (~4sec)
 *  0b1000..16.777 sec (~16 sec)
 *  0b1001..33.554 sec (~32 sec)
 *  0b1010..67.108 sec (~64 sec)
 *  0b1011..Reserved
 */
#define EMAC_MAC_FSM_ACT_TIMER_LTMRMD(x)         (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_FSM_ACT_TIMER_LTMRMD_SHIFT)) & EMAC_MAC_FSM_ACT_TIMER_LTMRMD_MASK)
/*! @} */

