zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXE/periph6/PERI_EMAC.h
/*! @name SCS_REG1 - SCS_REG 1 */
/*! @{ */

#define EMAC_SCS_REG1_MAC_SCS1_MASK              (0xFFFFFFFFU)
#define EMAC_SCS_REG1_MAC_SCS1_SHIFT             (0U)
/*! MAC_SCS1 - MAC SCS 1 */
#define EMAC_SCS_REG1_MAC_SCS1(x)                (((uint32_t)(((uint32_t)(x)) << EMAC_SCS_REG1_MAC_SCS1_SHIFT)) & EMAC_SCS_REG1_MAC_SCS1_MASK)
/*! @} */

/*! @name MAC_MDIO_ADDRESS - MAC MDIO Address */
/*! @{ */

#define EMAC_MAC_MDIO_ADDRESS_GB_MASK            (0x1U)
#define EMAC_MAC_MDIO_ADDRESS_GB_SHIFT           (0U)
/*! GB - GMII Busy
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define EMAC_MAC_MDIO_ADDRESS_GB(x)              (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_MDIO_ADDRESS_GB_SHIFT)) & EMAC_MAC_MDIO_ADDRESS_GB_MASK)

#define EMAC_MAC_MDIO_ADDRESS_C45E_MASK          (0x2U)
#define EMAC_MAC_MDIO_ADDRESS_C45E_SHIFT         (1U)
/*! C45E - Clause 45 PHY Enable
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define EMAC_MAC_MDIO_ADDRESS_C45E(x)            (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_MDIO_ADDRESS_C45E_SHIFT)) & EMAC_MAC_MDIO_ADDRESS_C45E_MASK)

#define EMAC_MAC_MDIO_ADDRESS_GOC_0_MASK         (0x4U)
#define EMAC_MAC_MDIO_ADDRESS_GOC_0_SHIFT        (2U)
/*! GOC_0 - GMII Operation Command 0
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define EMAC_MAC_MDIO_ADDRESS_GOC_0(x)           (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_MDIO_ADDRESS_GOC_0_SHIFT)) & EMAC_MAC_MDIO_ADDRESS_GOC_0_MASK)

#define EMAC_MAC_MDIO_ADDRESS_GOC_1_MASK         (0x8U)
#define EMAC_MAC_MDIO_ADDRESS_GOC_1_SHIFT        (3U)
/*! GOC_1 - GMII Operation Command 1
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define EMAC_MAC_MDIO_ADDRESS_GOC_1(x)           (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_MDIO_ADDRESS_GOC_1_SHIFT)) & EMAC_MAC_MDIO_ADDRESS_GOC_1_MASK)

#define EMAC_MAC_MDIO_ADDRESS_SKAP_MASK          (0x10U)
#define EMAC_MAC_MDIO_ADDRESS_SKAP_SHIFT         (4U)
/*! SKAP - Skip Address Packet
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define EMAC_MAC_MDIO_ADDRESS_SKAP(x)            (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_MDIO_ADDRESS_SKAP_SHIFT)) & EMAC_MAC_MDIO_ADDRESS_SKAP_MASK)

#define EMAC_MAC_MDIO_ADDRESS_CR_MASK            (0xF00U)
#define EMAC_MAC_MDIO_ADDRESS_CR_SHIFT           (8U)
/*! CR - CSR Clock Range */
#define EMAC_MAC_MDIO_ADDRESS_CR(x)              (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_MDIO_ADDRESS_CR_SHIFT)) & EMAC_MAC_MDIO_ADDRESS_CR_MASK)

#define EMAC_MAC_MDIO_ADDRESS_NTC_MASK           (0x7000U)
#define EMAC_MAC_MDIO_ADDRESS_NTC_SHIFT          (12U)
/*! NTC - Number Of Trailing Clocks */
#define EMAC_MAC_MDIO_ADDRESS_NTC(x)             (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_MDIO_ADDRESS_NTC_SHIFT)) & EMAC_MAC_MDIO_ADDRESS_NTC_MASK)

#define EMAC_MAC_MDIO_ADDRESS_RDA_MASK           (0x1F0000U)
#define EMAC_MAC_MDIO_ADDRESS_RDA_SHIFT          (16U)
/*! RDA - Register Or Device Address */
#define EMAC_MAC_MDIO_ADDRESS_RDA(x)             (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_MDIO_ADDRESS_RDA_SHIFT)) & EMAC_MAC_MDIO_ADDRESS_RDA_MASK)

#define EMAC_MAC_MDIO_ADDRESS_PA_MASK            (0x3E00000U)
#define EMAC_MAC_MDIO_ADDRESS_PA_SHIFT           (21U)
/*! PA - Physical Layer Address */
#define EMAC_MAC_MDIO_ADDRESS_PA(x)              (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_MDIO_ADDRESS_PA_SHIFT)) & EMAC_MAC_MDIO_ADDRESS_PA_MASK)

#define EMAC_MAC_MDIO_ADDRESS_BTB_MASK           (0x4000000U)
#define EMAC_MAC_MDIO_ADDRESS_BTB_SHIFT          (26U)
/*! BTB - Back-To-Back Transactions
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define EMAC_MAC_MDIO_ADDRESS_BTB(x)             (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_MDIO_ADDRESS_BTB_SHIFT)) & EMAC_MAC_MDIO_ADDRESS_BTB_MASK)

#define EMAC_MAC_MDIO_ADDRESS_PSE_MASK           (0x8000000U)
#define EMAC_MAC_MDIO_ADDRESS_PSE_SHIFT          (27U)
/*! PSE - Preamble Suppression Enable
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define EMAC_MAC_MDIO_ADDRESS_PSE(x)             (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_MDIO_ADDRESS_PSE_SHIFT)) & EMAC_MAC_MDIO_ADDRESS_PSE_MASK)
/*! @} */

/*! @name MAC_MDIO_DATA - MAC MDIO Data */
/*! @{ */

#define EMAC_MAC_MDIO_DATA_GD_MASK               (0xFFFFU)
#define EMAC_MAC_MDIO_DATA_GD_SHIFT              (0U)
/*! GD - GMII Data */
#define EMAC_MAC_MDIO_DATA_GD(x)                 (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_MDIO_DATA_GD_SHIFT)) & EMAC_MAC_MDIO_DATA_GD_MASK)

#define EMAC_MAC_MDIO_DATA_RA_MASK               (0xFFFF0000U)
#define EMAC_MAC_MDIO_DATA_RA_SHIFT              (16U)
/*! RA - Register Address */
#define EMAC_MAC_MDIO_DATA_RA(x)                 (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_MDIO_DATA_RA_SHIFT)) & EMAC_MAC_MDIO_DATA_RA_MASK)
/*! @} */

/*! @name MAC_CSR_SW_CTRL - MAC CSR Software Control */
/*! @{ */

#define EMAC_MAC_CSR_SW_CTRL_RCWE_MASK           (0x1U)
#define EMAC_MAC_CSR_SW_CTRL_RCWE_SHIFT          (0U)
/*! RCWE - Enable Register Write 1 To Clear (W1C)
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define EMAC_MAC_CSR_SW_CTRL_RCWE(x)             (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_CSR_SW_CTRL_RCWE_SHIFT)) & EMAC_MAC_CSR_SW_CTRL_RCWE_MASK)

#define EMAC_MAC_CSR_SW_CTRL_SEEN_MASK           (0x100U)
#define EMAC_MAC_CSR_SW_CTRL_SEEN_SHIFT          (8U)
/*! SEEN - Slave Error Response Enable
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define EMAC_MAC_CSR_SW_CTRL_SEEN(x)             (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_CSR_SW_CTRL_SEEN_SHIFT)) & EMAC_MAC_CSR_SW_CTRL_SEEN_MASK)
/*! @} */

/*! @name MAC_FPE_CTRL_STS - MAC FPE Control STS */
/*! @{ */

#define EMAC_MAC_FPE_CTRL_STS_EFPE_MASK          (0x1U)
#define EMAC_MAC_FPE_CTRL_STS_EFPE_SHIFT         (0U)
/*! EFPE - Enable Transmit Frame Preemption
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define EMAC_MAC_FPE_CTRL_STS_EFPE(x)            (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_FPE_CTRL_STS_EFPE_SHIFT)) & EMAC_MAC_FPE_CTRL_STS_EFPE_MASK)

#define EMAC_MAC_FPE_CTRL_STS_SVER_MASK          (0x2U)
#define EMAC_MAC_FPE_CTRL_STS_SVER_SHIFT         (1U)
/*! SVER - Send Verify mPacket
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define EMAC_MAC_FPE_CTRL_STS_SVER(x)            (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_FPE_CTRL_STS_SVER_SHIFT)) & EMAC_MAC_FPE_CTRL_STS_SVER_MASK)

#define EMAC_MAC_FPE_CTRL_STS_SRSP_MASK          (0x4U)
#define EMAC_MAC_FPE_CTRL_STS_SRSP_SHIFT         (2U)
/*! SRSP - Send Respond mPacket
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define EMAC_MAC_FPE_CTRL_STS_SRSP(x)            (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_FPE_CTRL_STS_SRSP_SHIFT)) & EMAC_MAC_FPE_CTRL_STS_SRSP_MASK)

