zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXE/periph6/PERI_EMAC.h
#define EMAC_MAC_FPE_CTRL_STS_S1_SET_0_MASK      (0x8U)
#define EMAC_MAC_FPE_CTRL_STS_S1_SET_0_SHIFT     (3U)
/*! S1_SET_0 - S1 SET 0 */
#define EMAC_MAC_FPE_CTRL_STS_S1_SET_0(x)        (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_FPE_CTRL_STS_S1_SET_0_SHIFT)) & EMAC_MAC_FPE_CTRL_STS_S1_SET_0_MASK)

#define EMAC_MAC_FPE_CTRL_STS_RVER_MASK          (0x10000U)
#define EMAC_MAC_FPE_CTRL_STS_RVER_SHIFT         (16U)
/*! RVER - Received Verify Frame
 *  0b0..Not received
 *  0b1..Received
 */
#define EMAC_MAC_FPE_CTRL_STS_RVER(x)            (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_FPE_CTRL_STS_RVER_SHIFT)) & EMAC_MAC_FPE_CTRL_STS_RVER_MASK)

#define EMAC_MAC_FPE_CTRL_STS_RRSP_MASK          (0x20000U)
#define EMAC_MAC_FPE_CTRL_STS_RRSP_SHIFT         (17U)
/*! RRSP - Received Respond Frame
 *  0b0..Not received
 *  0b1..Received
 */
#define EMAC_MAC_FPE_CTRL_STS_RRSP(x)            (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_FPE_CTRL_STS_RRSP_SHIFT)) & EMAC_MAC_FPE_CTRL_STS_RRSP_MASK)

#define EMAC_MAC_FPE_CTRL_STS_TVER_MASK          (0x40000U)
#define EMAC_MAC_FPE_CTRL_STS_TVER_SHIFT         (18U)
/*! TVER - Transmitted Verify Frame
 *  0b0..Not transmitted
 *  0b1..Transmitted
 */
#define EMAC_MAC_FPE_CTRL_STS_TVER(x)            (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_FPE_CTRL_STS_TVER_SHIFT)) & EMAC_MAC_FPE_CTRL_STS_TVER_MASK)

#define EMAC_MAC_FPE_CTRL_STS_TRSP_MASK          (0x80000U)
#define EMAC_MAC_FPE_CTRL_STS_TRSP_SHIFT         (19U)
/*! TRSP - Transmitted Respond Frame
 *  0b0..Not transmitted
 *  0b1..Transmitted
 */
#define EMAC_MAC_FPE_CTRL_STS_TRSP(x)            (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_FPE_CTRL_STS_TRSP_SHIFT)) & EMAC_MAC_FPE_CTRL_STS_TRSP_MASK)
/*! @} */

/*! @name MAC_PRESN_TIME_NS - MAC Presentation Time */
/*! @{ */

#define EMAC_MAC_PRESN_TIME_NS_MPTN_MASK         (0xFFFFFFFFU)
#define EMAC_MAC_PRESN_TIME_NS_MPTN_SHIFT        (0U)
/*! MPTN - MAC 1722 Presentation Time (In Nanoseconds) */
#define EMAC_MAC_PRESN_TIME_NS_MPTN(x)           (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_PRESN_TIME_NS_MPTN_SHIFT)) & EMAC_MAC_PRESN_TIME_NS_MPTN_MASK)
/*! @} */

/*! @name MAC_PRESN_TIME_UPDT - MAC Presentation Time Update */
/*! @{ */

#define EMAC_MAC_PRESN_TIME_UPDT_MPTU_MASK       (0xFFFFFFFFU)
#define EMAC_MAC_PRESN_TIME_UPDT_MPTU_SHIFT      (0U)
/*! MPTU - MAC 1722 Presentation Time Update */
#define EMAC_MAC_PRESN_TIME_UPDT_MPTU(x)         (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_PRESN_TIME_UPDT_MPTU_SHIFT)) & EMAC_MAC_PRESN_TIME_UPDT_MPTU_MASK)
/*! @} */

/*! @name HIGH - MAC Address 0 High..MAC Address 2 High */
/*! @{ */

#define EMAC_HIGH_ADDRHI_MASK                    (0xFFFFU)
#define EMAC_HIGH_ADDRHI_SHIFT                   (0U)
/*! ADDRHI - MAC Address 1 [47:32] */
#define EMAC_HIGH_ADDRHI(x)                      (((uint32_t)(((uint32_t)(x)) << EMAC_HIGH_ADDRHI_SHIFT)) & EMAC_HIGH_ADDRHI_MASK)

#define EMAC_HIGH_DCS_MASK                       (0x30000U)
#define EMAC_HIGH_DCS_SHIFT                      (16U)
/*! DCS - DMA Channel Select */
#define EMAC_HIGH_DCS(x)                         (((uint32_t)(((uint32_t)(x)) << EMAC_HIGH_DCS_SHIFT)) & EMAC_HIGH_DCS_MASK)

#define EMAC_HIGH_MBC_MASK                       (0x3F000000U)
#define EMAC_HIGH_MBC_SHIFT                      (24U)
/*! MBC - Mask Byte Control */
#define EMAC_HIGH_MBC(x)                         (((uint32_t)(((uint32_t)(x)) << EMAC_HIGH_MBC_SHIFT)) & EMAC_HIGH_MBC_MASK)

#define EMAC_HIGH_SA_MASK                        (0x40000000U)
#define EMAC_HIGH_SA_SHIFT                       (30U)
/*! SA - Source Address
 *  0b0..Destination address
 *  0b1..Source address
 */
#define EMAC_HIGH_SA(x)                          (((uint32_t)(((uint32_t)(x)) << EMAC_HIGH_SA_SHIFT)) & EMAC_HIGH_SA_MASK)

#define EMAC_HIGH_AE_MASK                        (0x80000000U)
#define EMAC_HIGH_AE_SHIFT                       (31U)
/*! AE - Address Enable
 *  0b0..Disabled and invalid (the field's value must always be 1)
 *  0b1..Enabled
 */
#define EMAC_HIGH_AE(x)                          (((uint32_t)(((uint32_t)(x)) << EMAC_HIGH_AE_SHIFT)) & EMAC_HIGH_AE_MASK)
/*! @} */

/* The count of EMAC_HIGH */
#define EMAC_HIGH_COUNT                          (3U)

/*! @name LOW - MAC Address 0 Low..MAC Address 2 Low */
/*! @{ */

#define EMAC_LOW_ADDRLO_MASK                     (0xFFFFFFFFU)
#define EMAC_LOW_ADDRLO_SHIFT                    (0U)
/*! ADDRLO - MAC Address 1 [31:0] */
#define EMAC_LOW_ADDRLO(x)                       (((uint32_t)(((uint32_t)(x)) << EMAC_LOW_ADDRLO_SHIFT)) & EMAC_LOW_ADDRLO_MASK)
/*! @} */

/* The count of EMAC_LOW */
#define EMAC_LOW_COUNT                           (3U)

/*! @name MMC_CONTROL - MMC Control */
/*! @{ */

#define EMAC_MMC_CONTROL_CNTRST_MASK             (0x1U)
#define EMAC_MMC_CONTROL_CNTRST_SHIFT            (0U)
/*! CNTRST - Counters Reset
 *  0b0..Counters are not reset
 *  0b1..All counters are reset
 */
#define EMAC_MMC_CONTROL_CNTRST(x)               (((uint32_t)(((uint32_t)(x)) << EMAC_MMC_CONTROL_CNTRST_SHIFT)) & EMAC_MMC_CONTROL_CNTRST_MASK)

#define EMAC_MMC_CONTROL_CNTSTOPRO_MASK          (0x2U)
#define EMAC_MMC_CONTROL_CNTSTOPRO_SHIFT         (1U)
/*! CNTSTOPRO - Counter Stop Rollover
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define EMAC_MMC_CONTROL_CNTSTOPRO(x)            (((uint32_t)(((uint32_t)(x)) << EMAC_MMC_CONTROL_CNTSTOPRO_SHIFT)) & EMAC_MMC_CONTROL_CNTSTOPRO_MASK)

#define EMAC_MMC_CONTROL_RSTONRD_MASK            (0x4U)
#define EMAC_MMC_CONTROL_RSTONRD_SHIFT           (2U)
/*! RSTONRD - Reset On Read
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define EMAC_MMC_CONTROL_RSTONRD(x)              (((uint32_t)(((uint32_t)(x)) << EMAC_MMC_CONTROL_RSTONRD_SHIFT)) & EMAC_MMC_CONTROL_RSTONRD_MASK)

#define EMAC_MMC_CONTROL_CNTFREEZ_MASK           (0x8U)
#define EMAC_MMC_CONTROL_CNTFREEZ_SHIFT          (3U)
/*! CNTFREEZ - MMC Counter Freeze
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define EMAC_MMC_CONTROL_CNTFREEZ(x)             (((uint32_t)(((uint32_t)(x)) << EMAC_MMC_CONTROL_CNTFREEZ_SHIFT)) & EMAC_MMC_CONTROL_CNTFREEZ_MASK)

#define EMAC_MMC_CONTROL_CNTPRST_MASK            (0x10U)
#define EMAC_MMC_CONTROL_CNTPRST_SHIFT           (4U)
/*! CNTPRST - Counters Preset
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define EMAC_MMC_CONTROL_CNTPRST(x)              (((uint32_t)(((uint32_t)(x)) << EMAC_MMC_CONTROL_CNTPRST_SHIFT)) & EMAC_MMC_CONTROL_CNTPRST_MASK)

#define EMAC_MMC_CONTROL_CNTPRSTLVL_MASK         (0x20U)
#define EMAC_MMC_CONTROL_CNTPRSTLVL_SHIFT        (5U)
/*! CNTPRSTLVL - Full-Half Preset
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define EMAC_MMC_CONTROL_CNTPRSTLVL(x)           (((uint32_t)(((uint32_t)(x)) << EMAC_MMC_CONTROL_CNTPRSTLVL_SHIFT)) & EMAC_MMC_CONTROL_CNTPRSTLVL_MASK)

#define EMAC_MMC_CONTROL_UCDBC_MASK              (0x100U)
#define EMAC_MMC_CONTROL_UCDBC_SHIFT             (8U)
/*! UCDBC - Update MMC Counters For Dropped Broadcast Packets
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define EMAC_MMC_CONTROL_UCDBC(x)                (((uint32_t)(((uint32_t)(x)) << EMAC_MMC_CONTROL_UCDBC_SHIFT)) & EMAC_MMC_CONTROL_UCDBC_MASK)
/*! @} */

/*! @name MMC_RX_INTERRUPT - MMC Receive Interrupt */
/*! @{ */

