zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXE/periph6/PERI_EMAC.h
#define EMAC_MMC_RX_INTERRUPT_RXGBPKTIS_MASK     (0x1U)
#define EMAC_MMC_RX_INTERRUPT_RXGBPKTIS_SHIFT    (0U)
/*! RXGBPKTIS - MMC Receive Good Bad Packet Counter Interrupt Status
 *  0b0..Not detected
 *  0b1..Detected
 */
#define EMAC_MMC_RX_INTERRUPT_RXGBPKTIS(x)       (((uint32_t)(((uint32_t)(x)) << EMAC_MMC_RX_INTERRUPT_RXGBPKTIS_SHIFT)) & EMAC_MMC_RX_INTERRUPT_RXGBPKTIS_MASK)

#define EMAC_MMC_RX_INTERRUPT_RXGBOCTIS_MASK     (0x2U)
#define EMAC_MMC_RX_INTERRUPT_RXGBOCTIS_SHIFT    (1U)
/*! RXGBOCTIS - MMC Receive Good Bad Octet Counter Interrupt Status
 *  0b0..Not detected
 *  0b1..Detected
 */
#define EMAC_MMC_RX_INTERRUPT_RXGBOCTIS(x)       (((uint32_t)(((uint32_t)(x)) << EMAC_MMC_RX_INTERRUPT_RXGBOCTIS_SHIFT)) & EMAC_MMC_RX_INTERRUPT_RXGBOCTIS_MASK)

#define EMAC_MMC_RX_INTERRUPT_RXGOCTIS_MASK      (0x4U)
#define EMAC_MMC_RX_INTERRUPT_RXGOCTIS_SHIFT     (2U)
/*! RXGOCTIS - MMC Receive Good Octet Counter Interrupt Status
 *  0b0..Not detected
 *  0b1..Detected
 */
#define EMAC_MMC_RX_INTERRUPT_RXGOCTIS(x)        (((uint32_t)(((uint32_t)(x)) << EMAC_MMC_RX_INTERRUPT_RXGOCTIS_SHIFT)) & EMAC_MMC_RX_INTERRUPT_RXGOCTIS_MASK)

#define EMAC_MMC_RX_INTERRUPT_RXBCGPIS_MASK      (0x8U)
#define EMAC_MMC_RX_INTERRUPT_RXBCGPIS_SHIFT     (3U)
/*! RXBCGPIS - MMC Receive Broadcast Good Packet Counter Interrupt Status
 *  0b0..Not detected
 *  0b1..Detected
 */
#define EMAC_MMC_RX_INTERRUPT_RXBCGPIS(x)        (((uint32_t)(((uint32_t)(x)) << EMAC_MMC_RX_INTERRUPT_RXBCGPIS_SHIFT)) & EMAC_MMC_RX_INTERRUPT_RXBCGPIS_MASK)

#define EMAC_MMC_RX_INTERRUPT_RXMCGPIS_MASK      (0x10U)
#define EMAC_MMC_RX_INTERRUPT_RXMCGPIS_SHIFT     (4U)
/*! RXMCGPIS - MMC Receive Multicast Good Packet Counter Interrupt Status
 *  0b0..Not detected
 *  0b1..Detected
 */
#define EMAC_MMC_RX_INTERRUPT_RXMCGPIS(x)        (((uint32_t)(((uint32_t)(x)) << EMAC_MMC_RX_INTERRUPT_RXMCGPIS_SHIFT)) & EMAC_MMC_RX_INTERRUPT_RXMCGPIS_MASK)

#define EMAC_MMC_RX_INTERRUPT_RXCRCERPIS_MASK    (0x20U)
#define EMAC_MMC_RX_INTERRUPT_RXCRCERPIS_SHIFT   (5U)
/*! RXCRCERPIS - MMC Receive CRC Error Packet Counter Interrupt Status
 *  0b0..Not detected
 *  0b1..Detected
 */
#define EMAC_MMC_RX_INTERRUPT_RXCRCERPIS(x)      (((uint32_t)(((uint32_t)(x)) << EMAC_MMC_RX_INTERRUPT_RXCRCERPIS_SHIFT)) & EMAC_MMC_RX_INTERRUPT_RXCRCERPIS_MASK)

#define EMAC_MMC_RX_INTERRUPT_RXALGNERPIS_MASK   (0x40U)
#define EMAC_MMC_RX_INTERRUPT_RXALGNERPIS_SHIFT  (6U)
/*! RXALGNERPIS - MMC Receive Alignment Error Packet Counter Interrupt Status
 *  0b0..Not detected
 *  0b1..Detected
 */
#define EMAC_MMC_RX_INTERRUPT_RXALGNERPIS(x)     (((uint32_t)(((uint32_t)(x)) << EMAC_MMC_RX_INTERRUPT_RXALGNERPIS_SHIFT)) & EMAC_MMC_RX_INTERRUPT_RXALGNERPIS_MASK)

#define EMAC_MMC_RX_INTERRUPT_RXRUNTPIS_MASK     (0x80U)
#define EMAC_MMC_RX_INTERRUPT_RXRUNTPIS_SHIFT    (7U)
/*! RXRUNTPIS - MMC Receive Runt Packet Counter Interrupt Status
 *  0b0..Not detected
 *  0b1..Detected
 */
#define EMAC_MMC_RX_INTERRUPT_RXRUNTPIS(x)       (((uint32_t)(((uint32_t)(x)) << EMAC_MMC_RX_INTERRUPT_RXRUNTPIS_SHIFT)) & EMAC_MMC_RX_INTERRUPT_RXRUNTPIS_MASK)

#define EMAC_MMC_RX_INTERRUPT_RXJABERPIS_MASK    (0x100U)
#define EMAC_MMC_RX_INTERRUPT_RXJABERPIS_SHIFT   (8U)
/*! RXJABERPIS - MMC Receive Jabber Error Packet Counter Interrupt Status
 *  0b0..Not detected
 *  0b1..Detected
 */
#define EMAC_MMC_RX_INTERRUPT_RXJABERPIS(x)      (((uint32_t)(((uint32_t)(x)) << EMAC_MMC_RX_INTERRUPT_RXJABERPIS_SHIFT)) & EMAC_MMC_RX_INTERRUPT_RXJABERPIS_MASK)

#define EMAC_MMC_RX_INTERRUPT_RXUSIZEGPIS_MASK   (0x200U)
#define EMAC_MMC_RX_INTERRUPT_RXUSIZEGPIS_SHIFT  (9U)
/*! RXUSIZEGPIS - MMC Receive Undersize Good Packet Counter Interrupt Status
 *  0b0..Not detected
 *  0b1..Detected
 */
#define EMAC_MMC_RX_INTERRUPT_RXUSIZEGPIS(x)     (((uint32_t)(((uint32_t)(x)) << EMAC_MMC_RX_INTERRUPT_RXUSIZEGPIS_SHIFT)) & EMAC_MMC_RX_INTERRUPT_RXUSIZEGPIS_MASK)

#define EMAC_MMC_RX_INTERRUPT_RXOSIZEGPIS_MASK   (0x400U)
#define EMAC_MMC_RX_INTERRUPT_RXOSIZEGPIS_SHIFT  (10U)
/*! RXOSIZEGPIS - MMC Receive Oversize Good Packet Counter Interrupt Status
 *  0b0..Not detected
 *  0b1..Detected
 */
#define EMAC_MMC_RX_INTERRUPT_RXOSIZEGPIS(x)     (((uint32_t)(((uint32_t)(x)) << EMAC_MMC_RX_INTERRUPT_RXOSIZEGPIS_SHIFT)) & EMAC_MMC_RX_INTERRUPT_RXOSIZEGPIS_MASK)

#define EMAC_MMC_RX_INTERRUPT_RX64OCTGBPIS_MASK  (0x800U)
#define EMAC_MMC_RX_INTERRUPT_RX64OCTGBPIS_SHIFT (11U)
/*! RX64OCTGBPIS - MMC Receive 64 Octet Good Bad Packet Counter Interrupt Status
 *  0b0..Not detected
 *  0b1..Detected
 */
#define EMAC_MMC_RX_INTERRUPT_RX64OCTGBPIS(x)    (((uint32_t)(((uint32_t)(x)) << EMAC_MMC_RX_INTERRUPT_RX64OCTGBPIS_SHIFT)) & EMAC_MMC_RX_INTERRUPT_RX64OCTGBPIS_MASK)

#define EMAC_MMC_RX_INTERRUPT_RX65T127OCTGBPIS_MASK (0x1000U)
#define EMAC_MMC_RX_INTERRUPT_RX65T127OCTGBPIS_SHIFT (12U)
/*! RX65T127OCTGBPIS - MMC Receive 65 To 127 Octet Good Bad Packet Counter Interrupt Status
 *  0b0..Not detected
 *  0b1..Detected
 */
#define EMAC_MMC_RX_INTERRUPT_RX65T127OCTGBPIS(x) (((uint32_t)(((uint32_t)(x)) << EMAC_MMC_RX_INTERRUPT_RX65T127OCTGBPIS_SHIFT)) & EMAC_MMC_RX_INTERRUPT_RX65T127OCTGBPIS_MASK)

#define EMAC_MMC_RX_INTERRUPT_RX128T255OCTGBPIS_MASK (0x2000U)
#define EMAC_MMC_RX_INTERRUPT_RX128T255OCTGBPIS_SHIFT (13U)
/*! RX128T255OCTGBPIS - MMC Receive 128 To 255 Octet Good Bad Packet Counter Interrupt Status
 *  0b0..Not detected
 *  0b1..Detected
 */
#define EMAC_MMC_RX_INTERRUPT_RX128T255OCTGBPIS(x) (((uint32_t)(((uint32_t)(x)) << EMAC_MMC_RX_INTERRUPT_RX128T255OCTGBPIS_SHIFT)) & EMAC_MMC_RX_INTERRUPT_RX128T255OCTGBPIS_MASK)

#define EMAC_MMC_RX_INTERRUPT_RX256T511OCTGBPIS_MASK (0x4000U)
#define EMAC_MMC_RX_INTERRUPT_RX256T511OCTGBPIS_SHIFT (14U)
/*! RX256T511OCTGBPIS - MMC Receive 256 To 511 Octet Good Bad Packet Counter Interrupt Status
 *  0b0..Not detected
 *  0b1..Detected
 */
#define EMAC_MMC_RX_INTERRUPT_RX256T511OCTGBPIS(x) (((uint32_t)(((uint32_t)(x)) << EMAC_MMC_RX_INTERRUPT_RX256T511OCTGBPIS_SHIFT)) & EMAC_MMC_RX_INTERRUPT_RX256T511OCTGBPIS_MASK)

#define EMAC_MMC_RX_INTERRUPT_RX512T1023OCTGBPIS_MASK (0x8000U)
#define EMAC_MMC_RX_INTERRUPT_RX512T1023OCTGBPIS_SHIFT (15U)
/*! RX512T1023OCTGBPIS - MMC Receive 512 To 1023 Octet Good Bad Packet Counter Interrupt Status
 *  0b0..Not detected
 *  0b1..Detected
 */
#define EMAC_MMC_RX_INTERRUPT_RX512T1023OCTGBPIS(x) (((uint32_t)(((uint32_t)(x)) << EMAC_MMC_RX_INTERRUPT_RX512T1023OCTGBPIS_SHIFT)) & EMAC_MMC_RX_INTERRUPT_RX512T1023OCTGBPIS_MASK)

#define EMAC_MMC_RX_INTERRUPT_RX1024TMAXOCTGBPIS_MASK (0x10000U)
#define EMAC_MMC_RX_INTERRUPT_RX1024TMAXOCTGBPIS_SHIFT (16U)
/*! RX1024TMAXOCTGBPIS - MMC Receive 1024 To Maximum Octet Good Bad Packet Counter Interrupt Status
 *  0b0..Not detected
 *  0b1..Detected
 */
#define EMAC_MMC_RX_INTERRUPT_RX1024TMAXOCTGBPIS(x) (((uint32_t)(((uint32_t)(x)) << EMAC_MMC_RX_INTERRUPT_RX1024TMAXOCTGBPIS_SHIFT)) & EMAC_MMC_RX_INTERRUPT_RX1024TMAXOCTGBPIS_MASK)

