zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXE/periph6/PERI_EMAC.h
#define EMAC_MMC_RX_INTERRUPT_RXUCGPIS_MASK      (0x20000U)
#define EMAC_MMC_RX_INTERRUPT_RXUCGPIS_SHIFT     (17U)
/*! RXUCGPIS - MMC Receive Unicast Good Packet Counter Interrupt Status
 *  0b0..Not detected
 *  0b1..Detected
 */
#define EMAC_MMC_RX_INTERRUPT_RXUCGPIS(x)        (((uint32_t)(((uint32_t)(x)) << EMAC_MMC_RX_INTERRUPT_RXUCGPIS_SHIFT)) & EMAC_MMC_RX_INTERRUPT_RXUCGPIS_MASK)

#define EMAC_MMC_RX_INTERRUPT_RXLENERPIS_MASK    (0x40000U)
#define EMAC_MMC_RX_INTERRUPT_RXLENERPIS_SHIFT   (18U)
/*! RXLENERPIS - MMC Receive Length Error Packet Counter Interrupt Status
 *  0b0..Not detected
 *  0b1..Detected
 */
#define EMAC_MMC_RX_INTERRUPT_RXLENERPIS(x)      (((uint32_t)(((uint32_t)(x)) << EMAC_MMC_RX_INTERRUPT_RXLENERPIS_SHIFT)) & EMAC_MMC_RX_INTERRUPT_RXLENERPIS_MASK)

#define EMAC_MMC_RX_INTERRUPT_RXORANGEPIS_MASK   (0x80000U)
#define EMAC_MMC_RX_INTERRUPT_RXORANGEPIS_SHIFT  (19U)
/*! RXORANGEPIS - MMC Receive Out-Of-Range Error Packet Counter Interrupt Status
 *  0b0..Not detected
 *  0b1..Detected
 */
#define EMAC_MMC_RX_INTERRUPT_RXORANGEPIS(x)     (((uint32_t)(((uint32_t)(x)) << EMAC_MMC_RX_INTERRUPT_RXORANGEPIS_SHIFT)) & EMAC_MMC_RX_INTERRUPT_RXORANGEPIS_MASK)

#define EMAC_MMC_RX_INTERRUPT_RXPAUSPIS_MASK     (0x100000U)
#define EMAC_MMC_RX_INTERRUPT_RXPAUSPIS_SHIFT    (20U)
/*! RXPAUSPIS - MMC Receive Pause Packet Counter Interrupt Status
 *  0b0..Not detected
 *  0b1..Detected
 */
#define EMAC_MMC_RX_INTERRUPT_RXPAUSPIS(x)       (((uint32_t)(((uint32_t)(x)) << EMAC_MMC_RX_INTERRUPT_RXPAUSPIS_SHIFT)) & EMAC_MMC_RX_INTERRUPT_RXPAUSPIS_MASK)

#define EMAC_MMC_RX_INTERRUPT_RXFOVPIS_MASK      (0x200000U)
#define EMAC_MMC_RX_INTERRUPT_RXFOVPIS_SHIFT     (21U)
/*! RXFOVPIS - MMC Receive FIFO Overflow Packet Counter Interrupt Status
 *  0b0..Not detected
 *  0b1..Detected
 */
#define EMAC_MMC_RX_INTERRUPT_RXFOVPIS(x)        (((uint32_t)(((uint32_t)(x)) << EMAC_MMC_RX_INTERRUPT_RXFOVPIS_SHIFT)) & EMAC_MMC_RX_INTERRUPT_RXFOVPIS_MASK)

#define EMAC_MMC_RX_INTERRUPT_RXVLANGBPIS_MASK   (0x400000U)
#define EMAC_MMC_RX_INTERRUPT_RXVLANGBPIS_SHIFT  (22U)
/*! RXVLANGBPIS - MMC Receive VLAN Good Bad Packet Counter Interrupt Status
 *  0b0..Not detected
 *  0b1..Detected
 */
#define EMAC_MMC_RX_INTERRUPT_RXVLANGBPIS(x)     (((uint32_t)(((uint32_t)(x)) << EMAC_MMC_RX_INTERRUPT_RXVLANGBPIS_SHIFT)) & EMAC_MMC_RX_INTERRUPT_RXVLANGBPIS_MASK)

#define EMAC_MMC_RX_INTERRUPT_RXWDOGPIS_MASK     (0x800000U)
#define EMAC_MMC_RX_INTERRUPT_RXWDOGPIS_SHIFT    (23U)
/*! RXWDOGPIS - MMC Receive Watchdog Error Packet Counter Interrupt Status
 *  0b0..Not detected
 *  0b1..Detected
 */
#define EMAC_MMC_RX_INTERRUPT_RXWDOGPIS(x)       (((uint32_t)(((uint32_t)(x)) << EMAC_MMC_RX_INTERRUPT_RXWDOGPIS_SHIFT)) & EMAC_MMC_RX_INTERRUPT_RXWDOGPIS_MASK)

#define EMAC_MMC_RX_INTERRUPT_RXRCVERRPIS_MASK   (0x1000000U)
#define EMAC_MMC_RX_INTERRUPT_RXRCVERRPIS_SHIFT  (24U)
/*! RXRCVERRPIS - MMC Receive Error Packet Counter Interrupt Status
 *  0b0..Not detected
 *  0b1..Detected
 */
#define EMAC_MMC_RX_INTERRUPT_RXRCVERRPIS(x)     (((uint32_t)(((uint32_t)(x)) << EMAC_MMC_RX_INTERRUPT_RXRCVERRPIS_SHIFT)) & EMAC_MMC_RX_INTERRUPT_RXRCVERRPIS_MASK)

#define EMAC_MMC_RX_INTERRUPT_RXCTRLPIS_MASK     (0x2000000U)
#define EMAC_MMC_RX_INTERRUPT_RXCTRLPIS_SHIFT    (25U)
/*! RXCTRLPIS - MMC Receive Control Packet Counter Interrupt Status
 *  0b0..Not detected
 *  0b1..Detected
 */
#define EMAC_MMC_RX_INTERRUPT_RXCTRLPIS(x)       (((uint32_t)(((uint32_t)(x)) << EMAC_MMC_RX_INTERRUPT_RXCTRLPIS_SHIFT)) & EMAC_MMC_RX_INTERRUPT_RXCTRLPIS_MASK)
/*! @} */

/*! @name MMC_TX_INTERRUPT - MMC Transmit Interrupt */
/*! @{ */

#define EMAC_MMC_TX_INTERRUPT_TXGBOCTIS_MASK     (0x1U)
#define EMAC_MMC_TX_INTERRUPT_TXGBOCTIS_SHIFT    (0U)
/*! TXGBOCTIS - MMC Transmit Good Bad Octet Counter Interrupt Status
 *  0b0..Not detected
 *  0b1..Detected
 */
#define EMAC_MMC_TX_INTERRUPT_TXGBOCTIS(x)       (((uint32_t)(((uint32_t)(x)) << EMAC_MMC_TX_INTERRUPT_TXGBOCTIS_SHIFT)) & EMAC_MMC_TX_INTERRUPT_TXGBOCTIS_MASK)

#define EMAC_MMC_TX_INTERRUPT_TXGBPKTIS_MASK     (0x2U)
#define EMAC_MMC_TX_INTERRUPT_TXGBPKTIS_SHIFT    (1U)
/*! TXGBPKTIS - MMC Transmit Good Bad Packet Counter Interrupt Status
 *  0b0..Not detected
 *  0b1..Detected
 */
#define EMAC_MMC_TX_INTERRUPT_TXGBPKTIS(x)       (((uint32_t)(((uint32_t)(x)) << EMAC_MMC_TX_INTERRUPT_TXGBPKTIS_SHIFT)) & EMAC_MMC_TX_INTERRUPT_TXGBPKTIS_MASK)

#define EMAC_MMC_TX_INTERRUPT_TXBCGPIS_MASK      (0x4U)
#define EMAC_MMC_TX_INTERRUPT_TXBCGPIS_SHIFT     (2U)
/*! TXBCGPIS - MMC Transmit Broadcast Good Packet Counter Interrupt Status
 *  0b0..Not detected
 *  0b1..Detected
 */
#define EMAC_MMC_TX_INTERRUPT_TXBCGPIS(x)        (((uint32_t)(((uint32_t)(x)) << EMAC_MMC_TX_INTERRUPT_TXBCGPIS_SHIFT)) & EMAC_MMC_TX_INTERRUPT_TXBCGPIS_MASK)

#define EMAC_MMC_TX_INTERRUPT_TXMCGPIS_MASK      (0x8U)
#define EMAC_MMC_TX_INTERRUPT_TXMCGPIS_SHIFT     (3U)
/*! TXMCGPIS - MMC Transmit Multicast Good Packet Counter Interrupt Status
 *  0b0..Not detected
 *  0b1..Detected
 */
#define EMAC_MMC_TX_INTERRUPT_TXMCGPIS(x)        (((uint32_t)(((uint32_t)(x)) << EMAC_MMC_TX_INTERRUPT_TXMCGPIS_SHIFT)) & EMAC_MMC_TX_INTERRUPT_TXMCGPIS_MASK)

#define EMAC_MMC_TX_INTERRUPT_TX64OCTGBPIS_MASK  (0x10U)
#define EMAC_MMC_TX_INTERRUPT_TX64OCTGBPIS_SHIFT (4U)
/*! TX64OCTGBPIS - MMC Transmit 64-Octet Good Bad Packet Counter Interrupt Status
 *  0b0..Not detected
 *  0b1..Detected
 */
#define EMAC_MMC_TX_INTERRUPT_TX64OCTGBPIS(x)    (((uint32_t)(((uint32_t)(x)) << EMAC_MMC_TX_INTERRUPT_TX64OCTGBPIS_SHIFT)) & EMAC_MMC_TX_INTERRUPT_TX64OCTGBPIS_MASK)

#define EMAC_MMC_TX_INTERRUPT_TX65T127OCTGBPIS_MASK (0x20U)
#define EMAC_MMC_TX_INTERRUPT_TX65T127OCTGBPIS_SHIFT (5U)
/*! TX65T127OCTGBPIS - MMC Transmit 65 To 127 Octet Good Bad Packet Counter Interrupt Status
 *  0b0..Not detected
 *  0b1..Detected
 */
#define EMAC_MMC_TX_INTERRUPT_TX65T127OCTGBPIS(x) (((uint32_t)(((uint32_t)(x)) << EMAC_MMC_TX_INTERRUPT_TX65T127OCTGBPIS_SHIFT)) & EMAC_MMC_TX_INTERRUPT_TX65T127OCTGBPIS_MASK)

#define EMAC_MMC_TX_INTERRUPT_TX128T255OCTGBPIS_MASK (0x40U)
#define EMAC_MMC_TX_INTERRUPT_TX128T255OCTGBPIS_SHIFT (6U)
/*! TX128T255OCTGBPIS - MMC Transmit 128 To 255 Octet Good Bad Packet Counter Interrupt Status
 *  0b0..Not detected
 *  0b1..Detected
 */
#define EMAC_MMC_TX_INTERRUPT_TX128T255OCTGBPIS(x) (((uint32_t)(((uint32_t)(x)) << EMAC_MMC_TX_INTERRUPT_TX128T255OCTGBPIS_SHIFT)) & EMAC_MMC_TX_INTERRUPT_TX128T255OCTGBPIS_MASK)

#define EMAC_MMC_TX_INTERRUPT_TX256T511OCTGBPIS_MASK (0x80U)
#define EMAC_MMC_TX_INTERRUPT_TX256T511OCTGBPIS_SHIFT (7U)
/*! TX256T511OCTGBPIS - MMC Transmit 256 To 511 Octet Good Bad Packet Counter Interrupt Status
 *  0b0..Not detected
 *  0b1..Detected
 */
#define EMAC_MMC_TX_INTERRUPT_TX256T511OCTGBPIS(x) (((uint32_t)(((uint32_t)(x)) << EMAC_MMC_TX_INTERRUPT_TX256T511OCTGBPIS_SHIFT)) & EMAC_MMC_TX_INTERRUPT_TX256T511OCTGBPIS_MASK)

#define EMAC_MMC_TX_INTERRUPT_TX512T1023OCTGBPIS_MASK (0x100U)
#define EMAC_MMC_TX_INTERRUPT_TX512T1023OCTGBPIS_SHIFT (8U)
/*! TX512T1023OCTGBPIS - MMC Transmit 512 To 1023 Octet Good Bad Packet Counter Interrupt Status
 *  0b0..Not detected
 *  0b1..Detected
 */
#define EMAC_MMC_TX_INTERRUPT_TX512T1023OCTGBPIS(x) (((uint32_t)(((uint32_t)(x)) << EMAC_MMC_TX_INTERRUPT_TX512T1023OCTGBPIS_SHIFT)) & EMAC_MMC_TX_INTERRUPT_TX512T1023OCTGBPIS_MASK)

#define EMAC_MMC_TX_INTERRUPT_TX1024TMAXOCTGBPIS_MASK (0x200U)
#define EMAC_MMC_TX_INTERRUPT_TX1024TMAXOCTGBPIS_SHIFT (9U)
/*! TX1024TMAXOCTGBPIS - MMC Transmit 1024 To Maximum Octet Good Bad Packet Counter Interrupt Status
 *  0b0..Not detected
 *  0b1..Detected
 */
#define EMAC_MMC_TX_INTERRUPT_TX1024TMAXOCTGBPIS(x) (((uint32_t)(((uint32_t)(x)) << EMAC_MMC_TX_INTERRUPT_TX1024TMAXOCTGBPIS_SHIFT)) & EMAC_MMC_TX_INTERRUPT_TX1024TMAXOCTGBPIS_MASK)

