zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXE/periph6/PERI_EMAC.h
#define EMAC_MMC_TX_INTERRUPT_TXUCGBPIS_MASK     (0x400U)
#define EMAC_MMC_TX_INTERRUPT_TXUCGBPIS_SHIFT    (10U)
/*! TXUCGBPIS - MMC Transmit Unicast Good Bad Packet Counter Interrupt Status
 *  0b0..Not detected
 *  0b1..Detected
 */
#define EMAC_MMC_TX_INTERRUPT_TXUCGBPIS(x)       (((uint32_t)(((uint32_t)(x)) << EMAC_MMC_TX_INTERRUPT_TXUCGBPIS_SHIFT)) & EMAC_MMC_TX_INTERRUPT_TXUCGBPIS_MASK)

#define EMAC_MMC_TX_INTERRUPT_TXMCGBPIS_MASK     (0x800U)
#define EMAC_MMC_TX_INTERRUPT_TXMCGBPIS_SHIFT    (11U)
/*! TXMCGBPIS - MMC Transmit Multicast Good Bad Packet Counter Interrupt Status
 *  0b0..Not detected
 *  0b1..Detected
 */
#define EMAC_MMC_TX_INTERRUPT_TXMCGBPIS(x)       (((uint32_t)(((uint32_t)(x)) << EMAC_MMC_TX_INTERRUPT_TXMCGBPIS_SHIFT)) & EMAC_MMC_TX_INTERRUPT_TXMCGBPIS_MASK)

#define EMAC_MMC_TX_INTERRUPT_TXBCGBPIS_MASK     (0x1000U)
#define EMAC_MMC_TX_INTERRUPT_TXBCGBPIS_SHIFT    (12U)
/*! TXBCGBPIS - MMC Transmit Broadcast Good Bad Packet Counter Interrupt Status
 *  0b0..Not detected
 *  0b1..Detected
 */
#define EMAC_MMC_TX_INTERRUPT_TXBCGBPIS(x)       (((uint32_t)(((uint32_t)(x)) << EMAC_MMC_TX_INTERRUPT_TXBCGBPIS_SHIFT)) & EMAC_MMC_TX_INTERRUPT_TXBCGBPIS_MASK)

#define EMAC_MMC_TX_INTERRUPT_TXUFLOWERPIS_MASK  (0x2000U)
#define EMAC_MMC_TX_INTERRUPT_TXUFLOWERPIS_SHIFT (13U)
/*! TXUFLOWERPIS - MMC Transmit Underflow Error Packet Counter Interrupt Status
 *  0b0..Not detected
 *  0b1..Detected
 */
#define EMAC_MMC_TX_INTERRUPT_TXUFLOWERPIS(x)    (((uint32_t)(((uint32_t)(x)) << EMAC_MMC_TX_INTERRUPT_TXUFLOWERPIS_SHIFT)) & EMAC_MMC_TX_INTERRUPT_TXUFLOWERPIS_MASK)

#define EMAC_MMC_TX_INTERRUPT_TXSCOLGPIS_MASK    (0x4000U)
#define EMAC_MMC_TX_INTERRUPT_TXSCOLGPIS_SHIFT   (14U)
/*! TXSCOLGPIS - MMC Transmit Single Collision Good Packet Counter Interrupt Status
 *  0b0..Not detected
 *  0b1..Detected
 */
#define EMAC_MMC_TX_INTERRUPT_TXSCOLGPIS(x)      (((uint32_t)(((uint32_t)(x)) << EMAC_MMC_TX_INTERRUPT_TXSCOLGPIS_SHIFT)) & EMAC_MMC_TX_INTERRUPT_TXSCOLGPIS_MASK)

#define EMAC_MMC_TX_INTERRUPT_TXMCOLGPIS_MASK    (0x8000U)
#define EMAC_MMC_TX_INTERRUPT_TXMCOLGPIS_SHIFT   (15U)
/*! TXMCOLGPIS - MMC Transmit Multiple Collision Good Packet Counter Interrupt Status
 *  0b0..Not detected
 *  0b1..Detected
 */
#define EMAC_MMC_TX_INTERRUPT_TXMCOLGPIS(x)      (((uint32_t)(((uint32_t)(x)) << EMAC_MMC_TX_INTERRUPT_TXMCOLGPIS_SHIFT)) & EMAC_MMC_TX_INTERRUPT_TXMCOLGPIS_MASK)

#define EMAC_MMC_TX_INTERRUPT_TXDEFPIS_MASK      (0x10000U)
#define EMAC_MMC_TX_INTERRUPT_TXDEFPIS_SHIFT     (16U)
/*! TXDEFPIS - MMC Transmit Deferred Packet Counter Interrupt Status
 *  0b0..Not detected
 *  0b1..Detected
 */
#define EMAC_MMC_TX_INTERRUPT_TXDEFPIS(x)        (((uint32_t)(((uint32_t)(x)) << EMAC_MMC_TX_INTERRUPT_TXDEFPIS_SHIFT)) & EMAC_MMC_TX_INTERRUPT_TXDEFPIS_MASK)

#define EMAC_MMC_TX_INTERRUPT_TXLATCOLPIS_MASK   (0x20000U)
#define EMAC_MMC_TX_INTERRUPT_TXLATCOLPIS_SHIFT  (17U)
/*! TXLATCOLPIS - MMC Transmit Late Collision Packet Counter Interrupt Status
 *  0b0..Not detected
 *  0b1..Detected
 */
#define EMAC_MMC_TX_INTERRUPT_TXLATCOLPIS(x)     (((uint32_t)(((uint32_t)(x)) << EMAC_MMC_TX_INTERRUPT_TXLATCOLPIS_SHIFT)) & EMAC_MMC_TX_INTERRUPT_TXLATCOLPIS_MASK)

#define EMAC_MMC_TX_INTERRUPT_TXEXCOLPIS_MASK    (0x40000U)
#define EMAC_MMC_TX_INTERRUPT_TXEXCOLPIS_SHIFT   (18U)
/*! TXEXCOLPIS - MMC Transmit Excessive Collision Packet Counter Interrupt Status
 *  0b0..Not detected
 *  0b1..Detected
 */
#define EMAC_MMC_TX_INTERRUPT_TXEXCOLPIS(x)      (((uint32_t)(((uint32_t)(x)) << EMAC_MMC_TX_INTERRUPT_TXEXCOLPIS_SHIFT)) & EMAC_MMC_TX_INTERRUPT_TXEXCOLPIS_MASK)

#define EMAC_MMC_TX_INTERRUPT_TXCARERPIS_MASK    (0x80000U)
#define EMAC_MMC_TX_INTERRUPT_TXCARERPIS_SHIFT   (19U)
/*! TXCARERPIS - MMC Transmit Carrier Error Packet Counter Interrupt Status
 *  0b0..Not detected
 *  0b1..Detected
 */
#define EMAC_MMC_TX_INTERRUPT_TXCARERPIS(x)      (((uint32_t)(((uint32_t)(x)) << EMAC_MMC_TX_INTERRUPT_TXCARERPIS_SHIFT)) & EMAC_MMC_TX_INTERRUPT_TXCARERPIS_MASK)

#define EMAC_MMC_TX_INTERRUPT_TXGOCTIS_MASK      (0x100000U)
#define EMAC_MMC_TX_INTERRUPT_TXGOCTIS_SHIFT     (20U)
/*! TXGOCTIS - MMC Transmit Good Octet Counter Interrupt Status
 *  0b0..Not detected
 *  0b1..Detected
 */
#define EMAC_MMC_TX_INTERRUPT_TXGOCTIS(x)        (((uint32_t)(((uint32_t)(x)) << EMAC_MMC_TX_INTERRUPT_TXGOCTIS_SHIFT)) & EMAC_MMC_TX_INTERRUPT_TXGOCTIS_MASK)

#define EMAC_MMC_TX_INTERRUPT_TXGPKTIS_MASK      (0x200000U)
#define EMAC_MMC_TX_INTERRUPT_TXGPKTIS_SHIFT     (21U)
/*! TXGPKTIS - MMC Transmit Good Packet Counter Interrupt Status
 *  0b0..Not detected
 *  0b1..Detected
 */
#define EMAC_MMC_TX_INTERRUPT_TXGPKTIS(x)        (((uint32_t)(((uint32_t)(x)) << EMAC_MMC_TX_INTERRUPT_TXGPKTIS_SHIFT)) & EMAC_MMC_TX_INTERRUPT_TXGPKTIS_MASK)

#define EMAC_MMC_TX_INTERRUPT_TXEXDEFPIS_MASK    (0x400000U)
#define EMAC_MMC_TX_INTERRUPT_TXEXDEFPIS_SHIFT   (22U)
/*! TXEXDEFPIS - MMC Transmit Excessive Deferral Packet Counter Interrupt Status
 *  0b0..Not detected
 *  0b1..Detected
 */
#define EMAC_MMC_TX_INTERRUPT_TXEXDEFPIS(x)      (((uint32_t)(((uint32_t)(x)) << EMAC_MMC_TX_INTERRUPT_TXEXDEFPIS_SHIFT)) & EMAC_MMC_TX_INTERRUPT_TXEXDEFPIS_MASK)

#define EMAC_MMC_TX_INTERRUPT_TXPAUSPIS_MASK     (0x800000U)
#define EMAC_MMC_TX_INTERRUPT_TXPAUSPIS_SHIFT    (23U)
/*! TXPAUSPIS - MMC Transmit Pause Packet Counter Interrupt Status
 *  0b0..Not detected
 *  0b1..Detected
 */
#define EMAC_MMC_TX_INTERRUPT_TXPAUSPIS(x)       (((uint32_t)(((uint32_t)(x)) << EMAC_MMC_TX_INTERRUPT_TXPAUSPIS_SHIFT)) & EMAC_MMC_TX_INTERRUPT_TXPAUSPIS_MASK)

#define EMAC_MMC_TX_INTERRUPT_TXVLANGPIS_MASK    (0x1000000U)
#define EMAC_MMC_TX_INTERRUPT_TXVLANGPIS_SHIFT   (24U)
/*! TXVLANGPIS - MMC Transmit VLAN Good Packet Counter Interrupt Status
 *  0b0..Not detected
 *  0b1..Detected
 */
#define EMAC_MMC_TX_INTERRUPT_TXVLANGPIS(x)      (((uint32_t)(((uint32_t)(x)) << EMAC_MMC_TX_INTERRUPT_TXVLANGPIS_SHIFT)) & EMAC_MMC_TX_INTERRUPT_TXVLANGPIS_MASK)

#define EMAC_MMC_TX_INTERRUPT_TXOSIZEGPIS_MASK   (0x2000000U)
#define EMAC_MMC_TX_INTERRUPT_TXOSIZEGPIS_SHIFT  (25U)
/*! TXOSIZEGPIS - MMC Transmit Oversize Good Packet Counter Interrupt Status
 *  0b0..Not detected
 *  0b1..Detected
 */
#define EMAC_MMC_TX_INTERRUPT_TXOSIZEGPIS(x)     (((uint32_t)(((uint32_t)(x)) << EMAC_MMC_TX_INTERRUPT_TXOSIZEGPIS_SHIFT)) & EMAC_MMC_TX_INTERRUPT_TXOSIZEGPIS_MASK)
/*! @} */

/*! @name MMC_RX_INTERRUPT_MASK - MMC Receive Interrupt Mask */
/*! @{ */

