zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXE/periph6/PERI_EMAC.h
#define EMAC_MAC_L3_L4_CONTROL0_L3DAM0_MASK      (0x10U)
#define EMAC_MAC_L3_L4_CONTROL0_L3DAM0_SHIFT     (4U)
/*! L3DAM0 - Layer 3 IP DA Match Enable
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define EMAC_MAC_L3_L4_CONTROL0_L3DAM0(x)        (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_L3_L4_CONTROL0_L3DAM0_SHIFT)) & EMAC_MAC_L3_L4_CONTROL0_L3DAM0_MASK)

#define EMAC_MAC_L3_L4_CONTROL0_L3DAIM0_MASK     (0x20U)
#define EMAC_MAC_L3_L4_CONTROL0_L3DAIM0_SHIFT    (5U)
/*! L3DAIM0 - Layer 3 IP DA Inverse Match Enable
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define EMAC_MAC_L3_L4_CONTROL0_L3DAIM0(x)       (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_L3_L4_CONTROL0_L3DAIM0_SHIFT)) & EMAC_MAC_L3_L4_CONTROL0_L3DAIM0_MASK)

#define EMAC_MAC_L3_L4_CONTROL0_L3HSBM0_MASK     (0x7C0U)
#define EMAC_MAC_L3_L4_CONTROL0_L3HSBM0_SHIFT    (6U)
/*! L3HSBM0 - Layer 3 IP SA Higher Bits Match */
#define EMAC_MAC_L3_L4_CONTROL0_L3HSBM0(x)       (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_L3_L4_CONTROL0_L3HSBM0_SHIFT)) & EMAC_MAC_L3_L4_CONTROL0_L3HSBM0_MASK)

#define EMAC_MAC_L3_L4_CONTROL0_L3HDBM0_MASK     (0xF800U)
#define EMAC_MAC_L3_L4_CONTROL0_L3HDBM0_SHIFT    (11U)
/*! L3HDBM0 - Layer 3 IP DA Higher Bits Match */
#define EMAC_MAC_L3_L4_CONTROL0_L3HDBM0(x)       (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_L3_L4_CONTROL0_L3HDBM0_SHIFT)) & EMAC_MAC_L3_L4_CONTROL0_L3HDBM0_MASK)

#define EMAC_MAC_L3_L4_CONTROL0_L4PEN0_MASK      (0x10000U)
#define EMAC_MAC_L3_L4_CONTROL0_L4PEN0_SHIFT     (16U)
/*! L4PEN0 - Layer 4 Protocol Enable
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define EMAC_MAC_L3_L4_CONTROL0_L4PEN0(x)        (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_L3_L4_CONTROL0_L4PEN0_SHIFT)) & EMAC_MAC_L3_L4_CONTROL0_L4PEN0_MASK)

#define EMAC_MAC_L3_L4_CONTROL0_L4SPM0_MASK      (0x40000U)
#define EMAC_MAC_L3_L4_CONTROL0_L4SPM0_SHIFT     (18U)
/*! L4SPM0 - Layer 4 Source Port Match Enable
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define EMAC_MAC_L3_L4_CONTROL0_L4SPM0(x)        (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_L3_L4_CONTROL0_L4SPM0_SHIFT)) & EMAC_MAC_L3_L4_CONTROL0_L4SPM0_MASK)

#define EMAC_MAC_L3_L4_CONTROL0_L4SPIM0_MASK     (0x80000U)
#define EMAC_MAC_L3_L4_CONTROL0_L4SPIM0_SHIFT    (19U)
/*! L4SPIM0 - Layer 4 Source Port Inverse Match Enable
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define EMAC_MAC_L3_L4_CONTROL0_L4SPIM0(x)       (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_L3_L4_CONTROL0_L4SPIM0_SHIFT)) & EMAC_MAC_L3_L4_CONTROL0_L4SPIM0_MASK)

#define EMAC_MAC_L3_L4_CONTROL0_L4DPM0_MASK      (0x100000U)
#define EMAC_MAC_L3_L4_CONTROL0_L4DPM0_SHIFT     (20U)
/*! L4DPM0 - Layer 4 Destination Port Match Enable
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define EMAC_MAC_L3_L4_CONTROL0_L4DPM0(x)        (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_L3_L4_CONTROL0_L4DPM0_SHIFT)) & EMAC_MAC_L3_L4_CONTROL0_L4DPM0_MASK)

#define EMAC_MAC_L3_L4_CONTROL0_L4DPIM0_MASK     (0x200000U)
#define EMAC_MAC_L3_L4_CONTROL0_L4DPIM0_SHIFT    (21U)
/*! L4DPIM0 - Layer 4 Destination Port Inverse Match Enable
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define EMAC_MAC_L3_L4_CONTROL0_L4DPIM0(x)       (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_L3_L4_CONTROL0_L4DPIM0_SHIFT)) & EMAC_MAC_L3_L4_CONTROL0_L4DPIM0_MASK)

#define EMAC_MAC_L3_L4_CONTROL0_DMCHN0_MASK      (0x1000000U)
#define EMAC_MAC_L3_L4_CONTROL0_DMCHN0_SHIFT     (24U)
/*! DMCHN0 - DMA Channel Number */
#define EMAC_MAC_L3_L4_CONTROL0_DMCHN0(x)        (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_L3_L4_CONTROL0_DMCHN0_SHIFT)) & EMAC_MAC_L3_L4_CONTROL0_DMCHN0_MASK)

#define EMAC_MAC_L3_L4_CONTROL0_DMCHEN0_MASK     (0x10000000U)
#define EMAC_MAC_L3_L4_CONTROL0_DMCHEN0_SHIFT    (28U)
/*! DMCHEN0 - DMA Channel Select Enable
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define EMAC_MAC_L3_L4_CONTROL0_DMCHEN0(x)       (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_L3_L4_CONTROL0_DMCHEN0_SHIFT)) & EMAC_MAC_L3_L4_CONTROL0_DMCHEN0_MASK)
/*! @} */

/*! @name MAC_LAYER4_ADDRESS0 - MAC Layer 4 Address 0 */
/*! @{ */

#define EMAC_MAC_LAYER4_ADDRESS0_L4SP0_MASK      (0xFFFFU)
#define EMAC_MAC_LAYER4_ADDRESS0_L4SP0_SHIFT     (0U)
/*! L4SP0 - Layer 4 Source Port Number */
#define EMAC_MAC_LAYER4_ADDRESS0_L4SP0(x)        (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_LAYER4_ADDRESS0_L4SP0_SHIFT)) & EMAC_MAC_LAYER4_ADDRESS0_L4SP0_MASK)

#define EMAC_MAC_LAYER4_ADDRESS0_L4DP0_MASK      (0xFFFF0000U)
#define EMAC_MAC_LAYER4_ADDRESS0_L4DP0_SHIFT     (16U)
/*! L4DP0 - Layer 4 Destination Port Number */
#define EMAC_MAC_LAYER4_ADDRESS0_L4DP0(x)        (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_LAYER4_ADDRESS0_L4DP0_SHIFT)) & EMAC_MAC_LAYER4_ADDRESS0_L4DP0_MASK)
/*! @} */

/*! @name MAC_LAYER3_ADDR0_REG0 - MAC Layer 3 Address 0 Reg 0 */
/*! @{ */

#define EMAC_MAC_LAYER3_ADDR0_REG0_L3A00_MASK    (0xFFFFFFFFU)
#define EMAC_MAC_LAYER3_ADDR0_REG0_L3A00_SHIFT   (0U)
/*! L3A00 - Layer 3 Address 0 */
#define EMAC_MAC_LAYER3_ADDR0_REG0_L3A00(x)      (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_LAYER3_ADDR0_REG0_L3A00_SHIFT)) & EMAC_MAC_LAYER3_ADDR0_REG0_L3A00_MASK)
/*! @} */

/*! @name MAC_LAYER3_ADDR1_REG0 - MAC Layer 3 Address 1 Reg 0 */
/*! @{ */

#define EMAC_MAC_LAYER3_ADDR1_REG0_L3A10_MASK    (0xFFFFFFFFU)
#define EMAC_MAC_LAYER3_ADDR1_REG0_L3A10_SHIFT   (0U)
/*! L3A10 - Layer 3 Address 1 */
#define EMAC_MAC_LAYER3_ADDR1_REG0_L3A10(x)      (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_LAYER3_ADDR1_REG0_L3A10_SHIFT)) & EMAC_MAC_LAYER3_ADDR1_REG0_L3A10_MASK)
/*! @} */

/*! @name MAC_LAYER3_ADDR2_REG0 - MAC Layer 3 Address 2 Reg 0 */
/*! @{ */

#define EMAC_MAC_LAYER3_ADDR2_REG0_L3A20_MASK    (0xFFFFFFFFU)
#define EMAC_MAC_LAYER3_ADDR2_REG0_L3A20_SHIFT   (0U)
/*! L3A20 - Layer 3 Address 2 */
#define EMAC_MAC_LAYER3_ADDR2_REG0_L3A20(x)      (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_LAYER3_ADDR2_REG0_L3A20_SHIFT)) & EMAC_MAC_LAYER3_ADDR2_REG0_L3A20_MASK)
/*! @} */

/*! @name MAC_LAYER3_ADDR3_REG0 - MAC Layer 3 Address 3 Reg 0 */
/*! @{ */

#define EMAC_MAC_LAYER3_ADDR3_REG0_L3A30_MASK    (0xFFFFFFFFU)
#define EMAC_MAC_LAYER3_ADDR3_REG0_L3A30_SHIFT   (0U)
/*! L3A30 - Layer 3 Address 3 */
#define EMAC_MAC_LAYER3_ADDR3_REG0_L3A30(x)      (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_LAYER3_ADDR3_REG0_L3A30_SHIFT)) & EMAC_MAC_LAYER3_ADDR3_REG0_L3A30_MASK)
/*! @} */

/*! @name MAC_L3_L4_CONTROL1 - MAC L3 L4 Control 1 */
/*! @{ */

#define EMAC_MAC_L3_L4_CONTROL1_L3PEN1_MASK      (0x1U)
#define EMAC_MAC_L3_L4_CONTROL1_L3PEN1_SHIFT     (0U)
/*! L3PEN1 - Layer 3 Protocol Enable 1
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define EMAC_MAC_L3_L4_CONTROL1_L3PEN1(x)        (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_L3_L4_CONTROL1_L3PEN1_SHIFT)) & EMAC_MAC_L3_L4_CONTROL1_L3PEN1_MASK)

#define EMAC_MAC_L3_L4_CONTROL1_L3SAM1_MASK      (0x4U)
#define EMAC_MAC_L3_L4_CONTROL1_L3SAM1_SHIFT     (2U)
/*! L3SAM1 - Layer 3 IP SA Match Enable 1
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define EMAC_MAC_L3_L4_CONTROL1_L3SAM1(x)        (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_L3_L4_CONTROL1_L3SAM1_SHIFT)) & EMAC_MAC_L3_L4_CONTROL1_L3SAM1_MASK)

