zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXE/periph6/PERI_EMAC.h
#define EMAC_MAC_L3_L4_CONTROL1_L3SAIM1_MASK     (0x8U)
#define EMAC_MAC_L3_L4_CONTROL1_L3SAIM1_SHIFT    (3U)
/*! L3SAIM1 - Layer 3 IP SA Inverse Match Enable 1
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define EMAC_MAC_L3_L4_CONTROL1_L3SAIM1(x)       (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_L3_L4_CONTROL1_L3SAIM1_SHIFT)) & EMAC_MAC_L3_L4_CONTROL1_L3SAIM1_MASK)

#define EMAC_MAC_L3_L4_CONTROL1_L3DAM1_MASK      (0x10U)
#define EMAC_MAC_L3_L4_CONTROL1_L3DAM1_SHIFT     (4U)
/*! L3DAM1 - Layer 3 IP DA Match Enable 1
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define EMAC_MAC_L3_L4_CONTROL1_L3DAM1(x)        (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_L3_L4_CONTROL1_L3DAM1_SHIFT)) & EMAC_MAC_L3_L4_CONTROL1_L3DAM1_MASK)

#define EMAC_MAC_L3_L4_CONTROL1_L3DAIM1_MASK     (0x20U)
#define EMAC_MAC_L3_L4_CONTROL1_L3DAIM1_SHIFT    (5U)
/*! L3DAIM1 - Layer 3 IP DA Inverse Match Enable 1
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define EMAC_MAC_L3_L4_CONTROL1_L3DAIM1(x)       (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_L3_L4_CONTROL1_L3DAIM1_SHIFT)) & EMAC_MAC_L3_L4_CONTROL1_L3DAIM1_MASK)

#define EMAC_MAC_L3_L4_CONTROL1_L3HSBM1_MASK     (0x7C0U)
#define EMAC_MAC_L3_L4_CONTROL1_L3HSBM1_SHIFT    (6U)
/*! L3HSBM1 - Layer 3 IP SA Higher Bits Match 1 */
#define EMAC_MAC_L3_L4_CONTROL1_L3HSBM1(x)       (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_L3_L4_CONTROL1_L3HSBM1_SHIFT)) & EMAC_MAC_L3_L4_CONTROL1_L3HSBM1_MASK)

#define EMAC_MAC_L3_L4_CONTROL1_L3HDBM1_MASK     (0xF800U)
#define EMAC_MAC_L3_L4_CONTROL1_L3HDBM1_SHIFT    (11U)
/*! L3HDBM1 - Layer 3 IP DA Higher Bits Match 1 */
#define EMAC_MAC_L3_L4_CONTROL1_L3HDBM1(x)       (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_L3_L4_CONTROL1_L3HDBM1_SHIFT)) & EMAC_MAC_L3_L4_CONTROL1_L3HDBM1_MASK)

#define EMAC_MAC_L3_L4_CONTROL1_L4PEN1_MASK      (0x10000U)
#define EMAC_MAC_L3_L4_CONTROL1_L4PEN1_SHIFT     (16U)
/*! L4PEN1 - Layer 4 Protocol Enable 1
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define EMAC_MAC_L3_L4_CONTROL1_L4PEN1(x)        (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_L3_L4_CONTROL1_L4PEN1_SHIFT)) & EMAC_MAC_L3_L4_CONTROL1_L4PEN1_MASK)

#define EMAC_MAC_L3_L4_CONTROL1_L4SPM1_MASK      (0x40000U)
#define EMAC_MAC_L3_L4_CONTROL1_L4SPM1_SHIFT     (18U)
/*! L4SPM1 - Layer 4 Source Port Match Enable 1
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define EMAC_MAC_L3_L4_CONTROL1_L4SPM1(x)        (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_L3_L4_CONTROL1_L4SPM1_SHIFT)) & EMAC_MAC_L3_L4_CONTROL1_L4SPM1_MASK)

#define EMAC_MAC_L3_L4_CONTROL1_L4SPIM1_MASK     (0x80000U)
#define EMAC_MAC_L3_L4_CONTROL1_L4SPIM1_SHIFT    (19U)
/*! L4SPIM1 - Layer 4 Source Port Inverse Match Enable 1
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define EMAC_MAC_L3_L4_CONTROL1_L4SPIM1(x)       (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_L3_L4_CONTROL1_L4SPIM1_SHIFT)) & EMAC_MAC_L3_L4_CONTROL1_L4SPIM1_MASK)

#define EMAC_MAC_L3_L4_CONTROL1_L4DPM1_MASK      (0x100000U)
#define EMAC_MAC_L3_L4_CONTROL1_L4DPM1_SHIFT     (20U)
/*! L4DPM1 - Layer 4 Destination Port Match Enable 1
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define EMAC_MAC_L3_L4_CONTROL1_L4DPM1(x)        (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_L3_L4_CONTROL1_L4DPM1_SHIFT)) & EMAC_MAC_L3_L4_CONTROL1_L4DPM1_MASK)

#define EMAC_MAC_L3_L4_CONTROL1_L4DPIM1_MASK     (0x200000U)
#define EMAC_MAC_L3_L4_CONTROL1_L4DPIM1_SHIFT    (21U)
/*! L4DPIM1 - Layer 4 Destination Port Inverse Match Enable 1
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define EMAC_MAC_L3_L4_CONTROL1_L4DPIM1(x)       (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_L3_L4_CONTROL1_L4DPIM1_SHIFT)) & EMAC_MAC_L3_L4_CONTROL1_L4DPIM1_MASK)

#define EMAC_MAC_L3_L4_CONTROL1_DMCHN1_MASK      (0x1000000U)
#define EMAC_MAC_L3_L4_CONTROL1_DMCHN1_SHIFT     (24U)
/*! DMCHN1 - DMA Channel Number 1 */
#define EMAC_MAC_L3_L4_CONTROL1_DMCHN1(x)        (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_L3_L4_CONTROL1_DMCHN1_SHIFT)) & EMAC_MAC_L3_L4_CONTROL1_DMCHN1_MASK)

#define EMAC_MAC_L3_L4_CONTROL1_DMCHEN1_MASK     (0x10000000U)
#define EMAC_MAC_L3_L4_CONTROL1_DMCHEN1_SHIFT    (28U)
/*! DMCHEN1 - DMA Channel Select Enable 1
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define EMAC_MAC_L3_L4_CONTROL1_DMCHEN1(x)       (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_L3_L4_CONTROL1_DMCHEN1_SHIFT)) & EMAC_MAC_L3_L4_CONTROL1_DMCHEN1_MASK)
/*! @} */

/*! @name MAC_LAYER4_ADDRESS1 - MAC Layer 4 Address 1 */
/*! @{ */

#define EMAC_MAC_LAYER4_ADDRESS1_L4SP1_MASK      (0xFFFFU)
#define EMAC_MAC_LAYER4_ADDRESS1_L4SP1_SHIFT     (0U)
/*! L4SP1 - Layer 4 Source Port Number 1 */
#define EMAC_MAC_LAYER4_ADDRESS1_L4SP1(x)        (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_LAYER4_ADDRESS1_L4SP1_SHIFT)) & EMAC_MAC_LAYER4_ADDRESS1_L4SP1_MASK)

#define EMAC_MAC_LAYER4_ADDRESS1_L4DP1_MASK      (0xFFFF0000U)
#define EMAC_MAC_LAYER4_ADDRESS1_L4DP1_SHIFT     (16U)
/*! L4DP1 - Layer 4 Destination Port Number 1 */
#define EMAC_MAC_LAYER4_ADDRESS1_L4DP1(x)        (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_LAYER4_ADDRESS1_L4DP1_SHIFT)) & EMAC_MAC_LAYER4_ADDRESS1_L4DP1_MASK)
/*! @} */

/*! @name MAC_LAYER3_ADDR0_REG1 - MAC Layer 3 Address 0 Reg 1 */
/*! @{ */

#define EMAC_MAC_LAYER3_ADDR0_REG1_L3A01_MASK    (0xFFFFFFFFU)
#define EMAC_MAC_LAYER3_ADDR0_REG1_L3A01_SHIFT   (0U)
/*! L3A01 - Layer 3 Address 0 */
#define EMAC_MAC_LAYER3_ADDR0_REG1_L3A01(x)      (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_LAYER3_ADDR0_REG1_L3A01_SHIFT)) & EMAC_MAC_LAYER3_ADDR0_REG1_L3A01_MASK)
/*! @} */

/*! @name MAC_LAYER3_ADDR1_REG1 - MAC Layer 3 Address 1 Reg 1 */
/*! @{ */

#define EMAC_MAC_LAYER3_ADDR1_REG1_L3A11_MASK    (0xFFFFFFFFU)
#define EMAC_MAC_LAYER3_ADDR1_REG1_L3A11_SHIFT   (0U)
/*! L3A11 - Layer 3 Address 1 */
#define EMAC_MAC_LAYER3_ADDR1_REG1_L3A11(x)      (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_LAYER3_ADDR1_REG1_L3A11_SHIFT)) & EMAC_MAC_LAYER3_ADDR1_REG1_L3A11_MASK)
/*! @} */

/*! @name MAC_LAYER3_ADDR2_REG1 - MAC Layer 3 Address 2 Reg 1 */
/*! @{ */

#define EMAC_MAC_LAYER3_ADDR2_REG1_L3A21_MASK    (0xFFFFFFFFU)
#define EMAC_MAC_LAYER3_ADDR2_REG1_L3A21_SHIFT   (0U)
/*! L3A21 - Layer 3 Address 2 */
#define EMAC_MAC_LAYER3_ADDR2_REG1_L3A21(x)      (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_LAYER3_ADDR2_REG1_L3A21_SHIFT)) & EMAC_MAC_LAYER3_ADDR2_REG1_L3A21_MASK)
/*! @} */

/*! @name MAC_LAYER3_ADDR3_REG1 - MAC Layer 3 Address 3 Reg 1 */
/*! @{ */

#define EMAC_MAC_LAYER3_ADDR3_REG1_L3A31_MASK    (0xFFFFFFFFU)
#define EMAC_MAC_LAYER3_ADDR3_REG1_L3A31_SHIFT   (0U)
/*! L3A31 - Layer 3 Address 3 */
#define EMAC_MAC_LAYER3_ADDR3_REG1_L3A31(x)      (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_LAYER3_ADDR3_REG1_L3A31_SHIFT)) & EMAC_MAC_LAYER3_ADDR3_REG1_L3A31_MASK)
/*! @} */

/*! @name MAC_L3_L4_CONTROL2 - MAC L3 L4 Control 2 */
/*! @{ */

