zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXE/periph6/PERI_EMAC.h
#define EMAC_MAC_LAYER3_ADDR1_REG2_L3A12_MASK    (0xFFFFFFFFU)
#define EMAC_MAC_LAYER3_ADDR1_REG2_L3A12_SHIFT   (0U)
/*! L3A12 - Layer 3 Address 1 */
#define EMAC_MAC_LAYER3_ADDR1_REG2_L3A12(x)      (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_LAYER3_ADDR1_REG2_L3A12_SHIFT)) & EMAC_MAC_LAYER3_ADDR1_REG2_L3A12_MASK)
/*! @} */

/*! @name MAC_LAYER3_ADDR2_REG2 - MAC Layer 3 Address 2 Reg 2 */
/*! @{ */

#define EMAC_MAC_LAYER3_ADDR2_REG2_L3A22_MASK    (0xFFFFFFFFU)
#define EMAC_MAC_LAYER3_ADDR2_REG2_L3A22_SHIFT   (0U)
/*! L3A22 - Layer 3 Address 2 */
#define EMAC_MAC_LAYER3_ADDR2_REG2_L3A22(x)      (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_LAYER3_ADDR2_REG2_L3A22_SHIFT)) & EMAC_MAC_LAYER3_ADDR2_REG2_L3A22_MASK)
/*! @} */

/*! @name MAC_LAYER3_ADDR3_REG2 - MAC Layer 3 Address 3 Reg 2 */
/*! @{ */

#define EMAC_MAC_LAYER3_ADDR3_REG2_L3A32_MASK    (0xFFFFFFFFU)
#define EMAC_MAC_LAYER3_ADDR3_REG2_L3A32_SHIFT   (0U)
/*! L3A32 - Layer 3 Address 3 */
#define EMAC_MAC_LAYER3_ADDR3_REG2_L3A32(x)      (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_LAYER3_ADDR3_REG2_L3A32_SHIFT)) & EMAC_MAC_LAYER3_ADDR3_REG2_L3A32_MASK)
/*! @} */

/*! @name MAC_L3_L4_CONTROL3 - MAC L3 L4 Control 3 */
/*! @{ */

#define EMAC_MAC_L3_L4_CONTROL3_L3PEN3_MASK      (0x1U)
#define EMAC_MAC_L3_L4_CONTROL3_L3PEN3_SHIFT     (0U)
/*! L3PEN3 - Layer 3 Protocol Enable 3
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define EMAC_MAC_L3_L4_CONTROL3_L3PEN3(x)        (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_L3_L4_CONTROL3_L3PEN3_SHIFT)) & EMAC_MAC_L3_L4_CONTROL3_L3PEN3_MASK)

#define EMAC_MAC_L3_L4_CONTROL3_L3SAM3_MASK      (0x4U)
#define EMAC_MAC_L3_L4_CONTROL3_L3SAM3_SHIFT     (2U)
/*! L3SAM3 - Layer 3 IP SA Match Enable 3
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define EMAC_MAC_L3_L4_CONTROL3_L3SAM3(x)        (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_L3_L4_CONTROL3_L3SAM3_SHIFT)) & EMAC_MAC_L3_L4_CONTROL3_L3SAM3_MASK)

#define EMAC_MAC_L3_L4_CONTROL3_L3SAIM3_MASK     (0x8U)
#define EMAC_MAC_L3_L4_CONTROL3_L3SAIM3_SHIFT    (3U)
/*! L3SAIM3 - Layer 3 IP SA Inverse Match Enable 3
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define EMAC_MAC_L3_L4_CONTROL3_L3SAIM3(x)       (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_L3_L4_CONTROL3_L3SAIM3_SHIFT)) & EMAC_MAC_L3_L4_CONTROL3_L3SAIM3_MASK)

#define EMAC_MAC_L3_L4_CONTROL3_L3DAM3_MASK      (0x10U)
#define EMAC_MAC_L3_L4_CONTROL3_L3DAM3_SHIFT     (4U)
/*! L3DAM3 - Layer 3 IP DA Match Enable 3
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define EMAC_MAC_L3_L4_CONTROL3_L3DAM3(x)        (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_L3_L4_CONTROL3_L3DAM3_SHIFT)) & EMAC_MAC_L3_L4_CONTROL3_L3DAM3_MASK)

#define EMAC_MAC_L3_L4_CONTROL3_L3DAIM3_MASK     (0x20U)
#define EMAC_MAC_L3_L4_CONTROL3_L3DAIM3_SHIFT    (5U)
/*! L3DAIM3 - Layer 3 IP DA Inverse Match Enable 3
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define EMAC_MAC_L3_L4_CONTROL3_L3DAIM3(x)       (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_L3_L4_CONTROL3_L3DAIM3_SHIFT)) & EMAC_MAC_L3_L4_CONTROL3_L3DAIM3_MASK)

#define EMAC_MAC_L3_L4_CONTROL3_L3HSBM3_MASK     (0x7C0U)
#define EMAC_MAC_L3_L4_CONTROL3_L3HSBM3_SHIFT    (6U)
/*! L3HSBM3 - Layer 3 IP SA Higher Bits Match 3 */
#define EMAC_MAC_L3_L4_CONTROL3_L3HSBM3(x)       (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_L3_L4_CONTROL3_L3HSBM3_SHIFT)) & EMAC_MAC_L3_L4_CONTROL3_L3HSBM3_MASK)

#define EMAC_MAC_L3_L4_CONTROL3_L3HDBM3_MASK     (0xF800U)
#define EMAC_MAC_L3_L4_CONTROL3_L3HDBM3_SHIFT    (11U)
/*! L3HDBM3 - Layer 3 IP DA Higher Bits Match 3 */
#define EMAC_MAC_L3_L4_CONTROL3_L3HDBM3(x)       (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_L3_L4_CONTROL3_L3HDBM3_SHIFT)) & EMAC_MAC_L3_L4_CONTROL3_L3HDBM3_MASK)

#define EMAC_MAC_L3_L4_CONTROL3_L4PEN3_MASK      (0x10000U)
#define EMAC_MAC_L3_L4_CONTROL3_L4PEN3_SHIFT     (16U)
/*! L4PEN3 - Layer 4 Protocol Enable 3
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define EMAC_MAC_L3_L4_CONTROL3_L4PEN3(x)        (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_L3_L4_CONTROL3_L4PEN3_SHIFT)) & EMAC_MAC_L3_L4_CONTROL3_L4PEN3_MASK)

#define EMAC_MAC_L3_L4_CONTROL3_L4SPM3_MASK      (0x40000U)
#define EMAC_MAC_L3_L4_CONTROL3_L4SPM3_SHIFT     (18U)
/*! L4SPM3 - Layer 4 Source Port Match Enable 3
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define EMAC_MAC_L3_L4_CONTROL3_L4SPM3(x)        (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_L3_L4_CONTROL3_L4SPM3_SHIFT)) & EMAC_MAC_L3_L4_CONTROL3_L4SPM3_MASK)

#define EMAC_MAC_L3_L4_CONTROL3_L4SPIM3_MASK     (0x80000U)
#define EMAC_MAC_L3_L4_CONTROL3_L4SPIM3_SHIFT    (19U)
/*! L4SPIM3 - Layer 4 Source Port Inverse Match Enable 3
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define EMAC_MAC_L3_L4_CONTROL3_L4SPIM3(x)       (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_L3_L4_CONTROL3_L4SPIM3_SHIFT)) & EMAC_MAC_L3_L4_CONTROL3_L4SPIM3_MASK)

#define EMAC_MAC_L3_L4_CONTROL3_L4DPM3_MASK      (0x100000U)
#define EMAC_MAC_L3_L4_CONTROL3_L4DPM3_SHIFT     (20U)
/*! L4DPM3 - Layer 4 Destination Port Match Enable 3
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define EMAC_MAC_L3_L4_CONTROL3_L4DPM3(x)        (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_L3_L4_CONTROL3_L4DPM3_SHIFT)) & EMAC_MAC_L3_L4_CONTROL3_L4DPM3_MASK)

#define EMAC_MAC_L3_L4_CONTROL3_L4DPIM3_MASK     (0x200000U)
#define EMAC_MAC_L3_L4_CONTROL3_L4DPIM3_SHIFT    (21U)
/*! L4DPIM3 - Layer 4 Destination Port Inverse Match Enable 3
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define EMAC_MAC_L3_L4_CONTROL3_L4DPIM3(x)       (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_L3_L4_CONTROL3_L4DPIM3_SHIFT)) & EMAC_MAC_L3_L4_CONTROL3_L4DPIM3_MASK)

#define EMAC_MAC_L3_L4_CONTROL3_DMCHN3_MASK      (0x1000000U)
#define EMAC_MAC_L3_L4_CONTROL3_DMCHN3_SHIFT     (24U)
/*! DMCHN3 - DMA Channel Number 2 */
#define EMAC_MAC_L3_L4_CONTROL3_DMCHN3(x)        (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_L3_L4_CONTROL3_DMCHN3_SHIFT)) & EMAC_MAC_L3_L4_CONTROL3_DMCHN3_MASK)

#define EMAC_MAC_L3_L4_CONTROL3_DMCHEN3_MASK     (0x10000000U)
#define EMAC_MAC_L3_L4_CONTROL3_DMCHEN3_SHIFT    (28U)
/*! DMCHEN3 - DMA Channel Select Enable 3
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define EMAC_MAC_L3_L4_CONTROL3_DMCHEN3(x)       (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_L3_L4_CONTROL3_DMCHEN3_SHIFT)) & EMAC_MAC_L3_L4_CONTROL3_DMCHEN3_MASK)
/*! @} */

/*! @name MAC_LAYER4_ADDRESS3 - MAC Layer 4 Address 3 */
/*! @{ */

#define EMAC_MAC_LAYER4_ADDRESS3_L4SP3_MASK      (0xFFFFU)
#define EMAC_MAC_LAYER4_ADDRESS3_L4SP3_SHIFT     (0U)
/*! L4SP3 - Layer 4 Source Port Number 3 */
#define EMAC_MAC_LAYER4_ADDRESS3_L4SP3(x)        (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_LAYER4_ADDRESS3_L4SP3_SHIFT)) & EMAC_MAC_LAYER4_ADDRESS3_L4SP3_MASK)

#define EMAC_MAC_LAYER4_ADDRESS3_L4DP3_MASK      (0xFFFF0000U)
#define EMAC_MAC_LAYER4_ADDRESS3_L4DP3_SHIFT     (16U)
/*! L4DP3 - Layer 4 Destination Port Number 3 */
#define EMAC_MAC_LAYER4_ADDRESS3_L4DP3(x)        (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_LAYER4_ADDRESS3_L4DP3_SHIFT)) & EMAC_MAC_LAYER4_ADDRESS3_L4DP3_MASK)
/*! @} */

/*! @name MAC_LAYER3_ADDR0_REG3 - MAC Layer 3 Address 0 Reg 3 */
/*! @{ */

#define EMAC_MAC_LAYER3_ADDR0_REG3_L3A03_MASK    (0xFFFFFFFFU)
#define EMAC_MAC_LAYER3_ADDR0_REG3_L3A03_SHIFT   (0U)
/*! L3A03 - Layer 3 Address 0 */
#define EMAC_MAC_LAYER3_ADDR0_REG3_L3A03(x)      (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_LAYER3_ADDR0_REG3_L3A03_SHIFT)) & EMAC_MAC_LAYER3_ADDR0_REG3_L3A03_MASK)
/*! @} */

/*! @name MAC_LAYER3_ADDR1_REG3 - MAC Layer 3 Address 1 Reg 3 */
/*! @{ */

