zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXE/periph6/PERI_EMAC.h
/*! @name MAC_TIMESTAMP_INGRESS_LATENCY - MAC Timestamp Ingress Latency */
/*! @{ */

#define EMAC_MAC_TIMESTAMP_INGRESS_LATENCY_ITLSNS_MASK (0xFF00U)
#define EMAC_MAC_TIMESTAMP_INGRESS_LATENCY_ITLSNS_SHIFT (8U)
/*! ITLSNS - Ingress Timestamp Latency In Nanoseconds */
#define EMAC_MAC_TIMESTAMP_INGRESS_LATENCY_ITLSNS(x) (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_TIMESTAMP_INGRESS_LATENCY_ITLSNS_SHIFT)) & EMAC_MAC_TIMESTAMP_INGRESS_LATENCY_ITLSNS_MASK)

#define EMAC_MAC_TIMESTAMP_INGRESS_LATENCY_ITLNS_MASK (0xFFF0000U)
#define EMAC_MAC_TIMESTAMP_INGRESS_LATENCY_ITLNS_SHIFT (16U)
/*! ITLNS - Ingress Timestamp Latency In Sub-Nanoseconds */
#define EMAC_MAC_TIMESTAMP_INGRESS_LATENCY_ITLNS(x) (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_TIMESTAMP_INGRESS_LATENCY_ITLNS_SHIFT)) & EMAC_MAC_TIMESTAMP_INGRESS_LATENCY_ITLNS_MASK)
/*! @} */

/*! @name MAC_TIMESTAMP_EGRESS_LATENCY - MAC Timestamp Egress Latecy */
/*! @{ */

#define EMAC_MAC_TIMESTAMP_EGRESS_LATENCY_ETLSNS_MASK (0xFF00U)
#define EMAC_MAC_TIMESTAMP_EGRESS_LATENCY_ETLSNS_SHIFT (8U)
/*! ETLSNS - Egress Timestamp Latency In Sub-Nanoseconds */
#define EMAC_MAC_TIMESTAMP_EGRESS_LATENCY_ETLSNS(x) (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_TIMESTAMP_EGRESS_LATENCY_ETLSNS_SHIFT)) & EMAC_MAC_TIMESTAMP_EGRESS_LATENCY_ETLSNS_MASK)

#define EMAC_MAC_TIMESTAMP_EGRESS_LATENCY_ETLNS_MASK (0xFFF0000U)
#define EMAC_MAC_TIMESTAMP_EGRESS_LATENCY_ETLNS_SHIFT (16U)
/*! ETLNS - Egress Timestamp Latency In Nanoseconds */
#define EMAC_MAC_TIMESTAMP_EGRESS_LATENCY_ETLNS(x) (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_TIMESTAMP_EGRESS_LATENCY_ETLNS_SHIFT)) & EMAC_MAC_TIMESTAMP_EGRESS_LATENCY_ETLNS_MASK)
/*! @} */

/*! @name MAC_PPS_CONTROL - MAC PPS Control */
/*! @{ */

#define EMAC_MAC_PPS_CONTROL_PPSCTRL_PPSCMD_MASK (0xFU)
#define EMAC_MAC_PPS_CONTROL_PPSCTRL_PPSCMD_SHIFT (0U)
/*! PPSCTRL_PPSCMD - PPS Output Frequency Control */
#define EMAC_MAC_PPS_CONTROL_PPSCTRL_PPSCMD(x)   (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_PPS_CONTROL_PPSCTRL_PPSCMD_SHIFT)) & EMAC_MAC_PPS_CONTROL_PPSCTRL_PPSCMD_MASK)

#define EMAC_MAC_PPS_CONTROL_PPSEN0_MASK         (0x10U)
#define EMAC_MAC_PPS_CONTROL_PPSEN0_SHIFT        (4U)
/*! PPSEN0 - Flexible PPS Output Mode Enable 0
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define EMAC_MAC_PPS_CONTROL_PPSEN0(x)           (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_PPS_CONTROL_PPSEN0_SHIFT)) & EMAC_MAC_PPS_CONTROL_PPSEN0_MASK)

#define EMAC_MAC_PPS_CONTROL_TRGTMODSEL0_MASK    (0x60U)
#define EMAC_MAC_PPS_CONTROL_TRGTMODSEL0_SHIFT   (5U)
/*! TRGTMODSEL0 - Target Time Register Mode For PPS0 Output
 *  0b00..Target Time registers are programmed only for generating the interrupt event. The flexible PPS function
 *        must not be 1 in this mode, otherwise spurious transitions may be observed on the corresponding ptp_pps_o
 *        output port.
 *  0b01..Reserved
 *  0b10..Target Time registers are programmed for generating the interrupt event and starting or stopping the PPS0 output signal generation.
 *  0b11..Target Time registers are programmed only for starting or stopping the PPS0 output signal generation. No interrupt is asserted.
 */
#define EMAC_MAC_PPS_CONTROL_TRGTMODSEL0(x)      (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_PPS_CONTROL_TRGTMODSEL0_SHIFT)) & EMAC_MAC_PPS_CONTROL_TRGTMODSEL0_MASK)

#define EMAC_MAC_PPS_CONTROL_MCGREN0_MASK        (0x80U)
#define EMAC_MAC_PPS_CONTROL_MCGREN0_SHIFT       (7U)
/*! MCGREN0 - MCGR Mode Enable For PPS0 Output
 *  0b0..PPS mode
 *  0b1..MCGR mode
 */
#define EMAC_MAC_PPS_CONTROL_MCGREN0(x)          (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_PPS_CONTROL_MCGREN0_SHIFT)) & EMAC_MAC_PPS_CONTROL_MCGREN0_MASK)

#define EMAC_MAC_PPS_CONTROL_PPSCMD1_MASK        (0xF00U)
#define EMAC_MAC_PPS_CONTROL_PPSCMD1_SHIFT       (8U)
/*! PPSCMD1 - Flexible PPS1 Output Control */
#define EMAC_MAC_PPS_CONTROL_PPSCMD1(x)          (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_PPS_CONTROL_PPSCMD1_SHIFT)) & EMAC_MAC_PPS_CONTROL_PPSCMD1_MASK)

#define EMAC_MAC_PPS_CONTROL_TRGTMODSEL1_MASK    (0x6000U)
#define EMAC_MAC_PPS_CONTROL_TRGTMODSEL1_SHIFT   (13U)
/*! TRGTMODSEL1 - Target Time Register Mode For PPS1 Output
 *  0b00..Target Time registers are programmed only for generating the interrupt event. The flexible PPS function
 *        must not be 1 in this mode, otherwise spurious transitions may be observed on the corresponding ptp_pps_o
 *        output port.
 *  0b01..Reserved
 *  0b10..Target Time registers are programmed for generating the interrupt event and starting or stopping the PPS0 output signal generation.
 *  0b11..Target Time registers are programmed only for starting or stopping the PPS0 output signal generation. No interrupt is asserted.
 */
#define EMAC_MAC_PPS_CONTROL_TRGTMODSEL1(x)      (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_PPS_CONTROL_TRGTMODSEL1_SHIFT)) & EMAC_MAC_PPS_CONTROL_TRGTMODSEL1_MASK)

#define EMAC_MAC_PPS_CONTROL_MCGREN1_MASK        (0x8000U)
#define EMAC_MAC_PPS_CONTROL_MCGREN1_SHIFT       (15U)
/*! MCGREN1 - MCGR Mode Enable For PPS1 Output
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define EMAC_MAC_PPS_CONTROL_MCGREN1(x)          (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_PPS_CONTROL_MCGREN1_SHIFT)) & EMAC_MAC_PPS_CONTROL_MCGREN1_MASK)

#define EMAC_MAC_PPS_CONTROL_PPSCMD2_MASK        (0xF0000U)
#define EMAC_MAC_PPS_CONTROL_PPSCMD2_SHIFT       (16U)
/*! PPSCMD2 - Flexible PPS2 Output Control */
#define EMAC_MAC_PPS_CONTROL_PPSCMD2(x)          (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_PPS_CONTROL_PPSCMD2_SHIFT)) & EMAC_MAC_PPS_CONTROL_PPSCMD2_MASK)

#define EMAC_MAC_PPS_CONTROL_TRGTMODSEL2_MASK    (0x600000U)
#define EMAC_MAC_PPS_CONTROL_TRGTMODSEL2_SHIFT   (21U)
/*! TRGTMODSEL2 - Target Time Register Mode For PPS2 Output
 *  0b00..Target Time registers are programmed only for generating the interrupt event. The flexible PPS function
 *        must not be enabled in this mode, otherwise spurious transitions may be observed on the corresponding
 *        ptp_pps_o output port.
 *  0b01..Reserved
 *  0b10..Target Time registers are programmed for generating the interrupt event and starting or stopping the PPS0 output signal generation.
 *  0b11..Target Time registers are programmed only for starting or stopping the PPS0 output signal generation. No interrupt is asserted.
 */
#define EMAC_MAC_PPS_CONTROL_TRGTMODSEL2(x)      (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_PPS_CONTROL_TRGTMODSEL2_SHIFT)) & EMAC_MAC_PPS_CONTROL_TRGTMODSEL2_MASK)

