zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXE/periph6/PERI_EMAC.h
/*! @name MAC_PPS3_TARGET_TIME_SECONDS - MAC PPS3 Target Time In Seconds */
/*! @{ */

#define EMAC_MAC_PPS3_TARGET_TIME_SECONDS_TSTRH3_MASK (0xFFFFFFFFU)
#define EMAC_MAC_PPS3_TARGET_TIME_SECONDS_TSTRH3_SHIFT (0U)
/*! TSTRH3 - PPS Target Time In Seconds 3 */
#define EMAC_MAC_PPS3_TARGET_TIME_SECONDS_TSTRH3(x) (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_PPS3_TARGET_TIME_SECONDS_TSTRH3_SHIFT)) & EMAC_MAC_PPS3_TARGET_TIME_SECONDS_TSTRH3_MASK)
/*! @} */

/*! @name MAC_PPS3_TARGET_TIME_NANOSECONDS - MAC PPS3 Target Time In Nanoseconds */
/*! @{ */

#define EMAC_MAC_PPS3_TARGET_TIME_NANOSECONDS_TTSL3_MASK (0x7FFFFFFFU)
#define EMAC_MAC_PPS3_TARGET_TIME_NANOSECONDS_TTSL3_SHIFT (0U)
/*! TTSL3 - Target Time Low For PPS3 */
#define EMAC_MAC_PPS3_TARGET_TIME_NANOSECONDS_TTSL3(x) (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_PPS3_TARGET_TIME_NANOSECONDS_TTSL3_SHIFT)) & EMAC_MAC_PPS3_TARGET_TIME_NANOSECONDS_TTSL3_MASK)

#define EMAC_MAC_PPS3_TARGET_TIME_NANOSECONDS_TRGTBUSY3_MASK (0x80000000U)
#define EMAC_MAC_PPS3_TARGET_TIME_NANOSECONDS_TRGTBUSY3_SHIFT (31U)
/*! TRGTBUSY3 - PPS Target Time Register Busy 3
 *  0b0..Not detected
 *  0b1..Detected
 */
#define EMAC_MAC_PPS3_TARGET_TIME_NANOSECONDS_TRGTBUSY3(x) (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_PPS3_TARGET_TIME_NANOSECONDS_TRGTBUSY3_SHIFT)) & EMAC_MAC_PPS3_TARGET_TIME_NANOSECONDS_TRGTBUSY3_MASK)
/*! @} */

/*! @name MAC_PPS3_INTERVAL - MAC PPS3 Interval */
/*! @{ */

#define EMAC_MAC_PPS3_INTERVAL_PPSINT3_MASK      (0xFFFFFFFFU)
#define EMAC_MAC_PPS3_INTERVAL_PPSINT3_SHIFT     (0U)
/*! PPSINT3 - PPS Output Signal Interval */
#define EMAC_MAC_PPS3_INTERVAL_PPSINT3(x)        (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_PPS3_INTERVAL_PPSINT3_SHIFT)) & EMAC_MAC_PPS3_INTERVAL_PPSINT3_MASK)
/*! @} */

/*! @name MAC_PPS3_WIDTH - MAC PPS3 Width */
/*! @{ */

#define EMAC_MAC_PPS3_WIDTH_PPSWIDTH3_MASK       (0xFFFFFFFFU)
#define EMAC_MAC_PPS3_WIDTH_PPSWIDTH3_SHIFT      (0U)
/*! PPSWIDTH3 - PPS Output Signal Width 3 */
#define EMAC_MAC_PPS3_WIDTH_PPSWIDTH3(x)         (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_PPS3_WIDTH_PPSWIDTH3_SHIFT)) & EMAC_MAC_PPS3_WIDTH_PPSWIDTH3_MASK)
/*! @} */

/*! @name MTL_OPERATION_MODE - MTL Operation Mode */
/*! @{ */

#define EMAC_MTL_OPERATION_MODE_DTXSTS_MASK      (0x2U)
#define EMAC_MTL_OPERATION_MODE_DTXSTS_SHIFT     (1U)
/*! DTXSTS - Drop Transmit Status
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define EMAC_MTL_OPERATION_MODE_DTXSTS(x)        (((uint32_t)(((uint32_t)(x)) << EMAC_MTL_OPERATION_MODE_DTXSTS_SHIFT)) & EMAC_MTL_OPERATION_MODE_DTXSTS_MASK)

#define EMAC_MTL_OPERATION_MODE_RAA_MASK         (0x4U)
#define EMAC_MTL_OPERATION_MODE_RAA_SHIFT        (2U)
/*! RAA - Receive Arbitration Algorithm
 *  0b0..Strict priority (SP)
 *  0b1..Weighted strict priority (WSP)
 */
#define EMAC_MTL_OPERATION_MODE_RAA(x)           (((uint32_t)(((uint32_t)(x)) << EMAC_MTL_OPERATION_MODE_RAA_SHIFT)) & EMAC_MTL_OPERATION_MODE_RAA_MASK)

#define EMAC_MTL_OPERATION_MODE_SCHALG_MASK      (0x60U)
#define EMAC_MTL_OPERATION_MODE_SCHALG_SHIFT     (5U)
/*! SCHALG - Transmit Scheduling Algorithm
 *  0b00..WRR algorithm
 *  0b01..WFQ algorithm when DCB feature selected; otherwise, reserved
 *  0b10..DWRR algorithm when DCB feature selected; otherwise, reserved
 *  0b11..Strict priority algorithm
 */
#define EMAC_MTL_OPERATION_MODE_SCHALG(x)        (((uint32_t)(((uint32_t)(x)) << EMAC_MTL_OPERATION_MODE_SCHALG_SHIFT)) & EMAC_MTL_OPERATION_MODE_SCHALG_MASK)

#define EMAC_MTL_OPERATION_MODE_CNTPRST_MASK     (0x100U)
#define EMAC_MTL_OPERATION_MODE_CNTPRST_SHIFT    (8U)
/*! CNTPRST - Counters Preset
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define EMAC_MTL_OPERATION_MODE_CNTPRST(x)       (((uint32_t)(((uint32_t)(x)) << EMAC_MTL_OPERATION_MODE_CNTPRST_SHIFT)) & EMAC_MTL_OPERATION_MODE_CNTPRST_MASK)

#define EMAC_MTL_OPERATION_MODE_CNTCLR_MASK      (0x200U)
#define EMAC_MTL_OPERATION_MODE_CNTCLR_SHIFT     (9U)
/*! CNTCLR - Counters Reset
 *  0b0..Not reset
 *  0b1..Reset
 */
#define EMAC_MTL_OPERATION_MODE_CNTCLR(x)        (((uint32_t)(((uint32_t)(x)) << EMAC_MTL_OPERATION_MODE_CNTCLR_SHIFT)) & EMAC_MTL_OPERATION_MODE_CNTCLR_MASK)

#define EMAC_MTL_OPERATION_MODE_FRPE_MASK        (0x8000U)
#define EMAC_MTL_OPERATION_MODE_FRPE_SHIFT       (15U)
/*! FRPE - Flexible Receive Parser Enable
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define EMAC_MTL_OPERATION_MODE_FRPE(x)          (((uint32_t)(((uint32_t)(x)) << EMAC_MTL_OPERATION_MODE_FRPE_SHIFT)) & EMAC_MTL_OPERATION_MODE_FRPE_MASK)
/*! @} */

/*! @name MTL_DBG_CTL - MTL Debug Control */
/*! @{ */

#define EMAC_MTL_DBG_CTL_FDBGEN_MASK             (0x1U)
#define EMAC_MTL_DBG_CTL_FDBGEN_SHIFT            (0U)
/*! FDBGEN - FIFO Debug Access Enable
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define EMAC_MTL_DBG_CTL_FDBGEN(x)               (((uint32_t)(((uint32_t)(x)) << EMAC_MTL_DBG_CTL_FDBGEN_SHIFT)) & EMAC_MTL_DBG_CTL_FDBGEN_MASK)

#define EMAC_MTL_DBG_CTL_DBGMOD_MASK             (0x2U)
#define EMAC_MTL_DBG_CTL_DBGMOD_SHIFT            (1U)
/*! DBGMOD - Debug Mode Access to FIFO
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define EMAC_MTL_DBG_CTL_DBGMOD(x)               (((uint32_t)(((uint32_t)(x)) << EMAC_MTL_DBG_CTL_DBGMOD_SHIFT)) & EMAC_MTL_DBG_CTL_DBGMOD_MASK)

#define EMAC_MTL_DBG_CTL_BYTEEN_MASK             (0xCU)
#define EMAC_MTL_DBG_CTL_BYTEEN_SHIFT            (2U)
/*! BYTEEN - Byte Enables
 *  0b00..Byte 0 valid
 *  0b01..Byte 0 and byte 1 valid
 *  0b10..Byte 0, byte 1, and byte 2 valid
 *  0b11..All four bytes valid
 */
#define EMAC_MTL_DBG_CTL_BYTEEN(x)               (((uint32_t)(((uint32_t)(x)) << EMAC_MTL_DBG_CTL_BYTEEN_SHIFT)) & EMAC_MTL_DBG_CTL_BYTEEN_MASK)

#define EMAC_MTL_DBG_CTL_PKTSTATE_MASK           (0x60U)
#define EMAC_MTL_DBG_CTL_PKTSTATE_SHIFT          (5U)
/*! PKTSTATE - Encoded Packet State
 *  0b00..Packet data
 *  0b01..Control word/normal status
 *  0b10..SOP data/last status
 *  0b11..EOP data/EOP
 */
#define EMAC_MTL_DBG_CTL_PKTSTATE(x)             (((uint32_t)(((uint32_t)(x)) << EMAC_MTL_DBG_CTL_PKTSTATE_SHIFT)) & EMAC_MTL_DBG_CTL_PKTSTATE_MASK)

#define EMAC_MTL_DBG_CTL_RSTALL_MASK             (0x100U)
#define EMAC_MTL_DBG_CTL_RSTALL_SHIFT            (8U)
/*! RSTALL - Reset All Pointers
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define EMAC_MTL_DBG_CTL_RSTALL(x)               (((uint32_t)(((uint32_t)(x)) << EMAC_MTL_DBG_CTL_RSTALL_SHIFT)) & EMAC_MTL_DBG_CTL_RSTALL_MASK)

#define EMAC_MTL_DBG_CTL_RSTSEL_MASK             (0x200U)
#define EMAC_MTL_DBG_CTL_RSTSEL_SHIFT            (9U)
/*! RSTSEL - Reset Pointers Of Selected FIFO
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define EMAC_MTL_DBG_CTL_RSTSEL(x)               (((uint32_t)(((uint32_t)(x)) << EMAC_MTL_DBG_CTL_RSTSEL_SHIFT)) & EMAC_MTL_DBG_CTL_RSTSEL_MASK)

#define EMAC_MTL_DBG_CTL_FIFORDEN_MASK           (0x400U)
#define EMAC_MTL_DBG_CTL_FIFORDEN_SHIFT          (10U)
/*! FIFORDEN - FIFO Read Enable
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define EMAC_MTL_DBG_CTL_FIFORDEN(x)             (((uint32_t)(((uint32_t)(x)) << EMAC_MTL_DBG_CTL_FIFORDEN_SHIFT)) & EMAC_MTL_DBG_CTL_FIFORDEN_MASK)

