zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXE/periph6/PERI_EMAC.h
#define EMAC_MTL_DBG_CTL_FIFOWREN_MASK           (0x800U)
#define EMAC_MTL_DBG_CTL_FIFOWREN_SHIFT          (11U)
/*! FIFOWREN - FIFO Write Enable
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define EMAC_MTL_DBG_CTL_FIFOWREN(x)             (((uint32_t)(((uint32_t)(x)) << EMAC_MTL_DBG_CTL_FIFOWREN_SHIFT)) & EMAC_MTL_DBG_CTL_FIFOWREN_MASK)

#define EMAC_MTL_DBG_CTL_FIFOSEL_MASK            (0x3000U)
#define EMAC_MTL_DBG_CTL_FIFOSEL_SHIFT           (12U)
/*! FIFOSEL - FIFO Selected for Access
 *  0b00..Transmit FIFO
 *  0b01..Transmit status FIFO (only read access when SLVMOD is set)
 *  0b10..TSO FIFO (cannot be accessed when SLVMOD is set)
 *  0b11..Receive FIFO
 */
#define EMAC_MTL_DBG_CTL_FIFOSEL(x)              (((uint32_t)(((uint32_t)(x)) << EMAC_MTL_DBG_CTL_FIFOSEL_SHIFT)) & EMAC_MTL_DBG_CTL_FIFOSEL_MASK)

#define EMAC_MTL_DBG_CTL_PKTIE_MASK              (0x4000U)
#define EMAC_MTL_DBG_CTL_PKTIE_SHIFT             (14U)
/*! PKTIE - Receive Packet Available Interrupt Status Enable
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define EMAC_MTL_DBG_CTL_PKTIE(x)                (((uint32_t)(((uint32_t)(x)) << EMAC_MTL_DBG_CTL_PKTIE_SHIFT)) & EMAC_MTL_DBG_CTL_PKTIE_MASK)

#define EMAC_MTL_DBG_CTL_STSIE_MASK              (0x8000U)
#define EMAC_MTL_DBG_CTL_STSIE_SHIFT             (15U)
/*! STSIE - Transmit Status Available Interrupt Status Enable
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define EMAC_MTL_DBG_CTL_STSIE(x)                (((uint32_t)(((uint32_t)(x)) << EMAC_MTL_DBG_CTL_STSIE_SHIFT)) & EMAC_MTL_DBG_CTL_STSIE_MASK)

#define EMAC_MTL_DBG_CTL_EIEE_MASK               (0x10000U)
#define EMAC_MTL_DBG_CTL_EIEE_SHIFT              (16U)
/*! EIEE - ECC Inject Error Enable
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define EMAC_MTL_DBG_CTL_EIEE(x)                 (((uint32_t)(((uint32_t)(x)) << EMAC_MTL_DBG_CTL_EIEE_SHIFT)) & EMAC_MTL_DBG_CTL_EIEE_MASK)

#define EMAC_MTL_DBG_CTL_EIEC_MASK               (0x60000U)
#define EMAC_MTL_DBG_CTL_EIEC_SHIFT              (17U)
/*! EIEC - ECC Inject Error Control
 *  0b00..1-bit error
 *  0b01..2-bit errors
 *  0b10..3-bit errors
 *  0b11..1-bit error in the address field
 */
#define EMAC_MTL_DBG_CTL_EIEC(x)                 (((uint32_t)(((uint32_t)(x)) << EMAC_MTL_DBG_CTL_EIEC_SHIFT)) & EMAC_MTL_DBG_CTL_EIEC_MASK)
/*! @} */

/*! @name MTL_DBG_STS - MTL Debug Status */
/*! @{ */

#define EMAC_MTL_DBG_STS_FIFOBUSY_MASK           (0x1U)
#define EMAC_MTL_DBG_STS_FIFOBUSY_SHIFT          (0U)
/*! FIFOBUSY - FIFO Busy
 *  0b0..Not detected
 *  0b1..Detected
 */
#define EMAC_MTL_DBG_STS_FIFOBUSY(x)             (((uint32_t)(((uint32_t)(x)) << EMAC_MTL_DBG_STS_FIFOBUSY_SHIFT)) & EMAC_MTL_DBG_STS_FIFOBUSY_MASK)

#define EMAC_MTL_DBG_STS_PKTSTATE_MASK           (0x6U)
#define EMAC_MTL_DBG_STS_PKTSTATE_SHIFT          (1U)
/*! PKTSTATE - Encoded Packet State
 *  0b00..Packet data
 *  0b01..Control word/normal status
 *  0b10..SOP data/last status
 *  0b11..EOP data/EOP
 */
#define EMAC_MTL_DBG_STS_PKTSTATE(x)             (((uint32_t)(((uint32_t)(x)) << EMAC_MTL_DBG_STS_PKTSTATE_SHIFT)) & EMAC_MTL_DBG_STS_PKTSTATE_MASK)

#define EMAC_MTL_DBG_STS_BYTEEN_MASK             (0x18U)
#define EMAC_MTL_DBG_STS_BYTEEN_SHIFT            (3U)
/*! BYTEEN - Byte Enables
 *  0b00..Byte 0 valid
 *  0b01..Byte 0 and byte 1 valid
 *  0b10..Byte 0, byte 1, and byte 2 valid
 *  0b11..All four bytes valid
 */
#define EMAC_MTL_DBG_STS_BYTEEN(x)               (((uint32_t)(((uint32_t)(x)) << EMAC_MTL_DBG_STS_BYTEEN_SHIFT)) & EMAC_MTL_DBG_STS_BYTEEN_MASK)

#define EMAC_MTL_DBG_STS_PKTI_MASK               (0x100U)
#define EMAC_MTL_DBG_STS_PKTI_SHIFT              (8U)
/*! PKTI - Receive Packet Available Interrupt Status
 *  0b0..Not detected
 *  0b1..Detected
 */
#define EMAC_MTL_DBG_STS_PKTI(x)                 (((uint32_t)(((uint32_t)(x)) << EMAC_MTL_DBG_STS_PKTI_SHIFT)) & EMAC_MTL_DBG_STS_PKTI_MASK)

#define EMAC_MTL_DBG_STS_STSI_MASK               (0x200U)
#define EMAC_MTL_DBG_STS_STSI_SHIFT              (9U)
/*! STSI - Transmit Status Available Interrupt Status
 *  0b0..Not detected
 *  0b1..Detected
 */
#define EMAC_MTL_DBG_STS_STSI(x)                 (((uint32_t)(((uint32_t)(x)) << EMAC_MTL_DBG_STS_STSI_SHIFT)) & EMAC_MTL_DBG_STS_STSI_MASK)

#define EMAC_MTL_DBG_STS_LOCR_MASK               (0xFFFF8000U)
#define EMAC_MTL_DBG_STS_LOCR_SHIFT              (15U)
/*! LOCR - Remaining Locations In FIFO */
#define EMAC_MTL_DBG_STS_LOCR(x)                 (((uint32_t)(((uint32_t)(x)) << EMAC_MTL_DBG_STS_LOCR_SHIFT)) & EMAC_MTL_DBG_STS_LOCR_MASK)
/*! @} */

/*! @name MTL_FIFO_DEBUG_DATA - MTL FIFO Debug Data */
/*! @{ */

#define EMAC_MTL_FIFO_DEBUG_DATA_FDBGDATA_MASK   (0xFFFFFFFFU)
#define EMAC_MTL_FIFO_DEBUG_DATA_FDBGDATA_SHIFT  (0U)
/*! FDBGDATA - FIFO Debug Data */
#define EMAC_MTL_FIFO_DEBUG_DATA_FDBGDATA(x)     (((uint32_t)(((uint32_t)(x)) << EMAC_MTL_FIFO_DEBUG_DATA_FDBGDATA_SHIFT)) & EMAC_MTL_FIFO_DEBUG_DATA_FDBGDATA_MASK)
/*! @} */

/*! @name MTL_INTERRUPT_STATUS - MTL Interrupt Status */
/*! @{ */

#define EMAC_MTL_INTERRUPT_STATUS_Q0IS_MASK      (0x1U)
#define EMAC_MTL_INTERRUPT_STATUS_Q0IS_SHIFT     (0U)
/*! Q0IS - Queue 0 Interrupt Status
 *  0b0..Not detected
 *  0b1..Detected
 */
#define EMAC_MTL_INTERRUPT_STATUS_Q0IS(x)        (((uint32_t)(((uint32_t)(x)) << EMAC_MTL_INTERRUPT_STATUS_Q0IS_SHIFT)) & EMAC_MTL_INTERRUPT_STATUS_Q0IS_MASK)

#define EMAC_MTL_INTERRUPT_STATUS_Q1IS_MASK      (0x2U)
#define EMAC_MTL_INTERRUPT_STATUS_Q1IS_SHIFT     (1U)
/*! Q1IS - Queue 1 Interrupt Status
 *  0b0..Not detected
 *  0b1..Detected
 */
#define EMAC_MTL_INTERRUPT_STATUS_Q1IS(x)        (((uint32_t)(((uint32_t)(x)) << EMAC_MTL_INTERRUPT_STATUS_Q1IS_SHIFT)) & EMAC_MTL_INTERRUPT_STATUS_Q1IS_MASK)

#define EMAC_MTL_INTERRUPT_STATUS_DBGIS_MASK     (0x20000U)
#define EMAC_MTL_INTERRUPT_STATUS_DBGIS_SHIFT    (17U)
/*! DBGIS - Debug Interrupt Status
 *  0b0..Not detected
 *  0b1..Detected
 */
#define EMAC_MTL_INTERRUPT_STATUS_DBGIS(x)       (((uint32_t)(((uint32_t)(x)) << EMAC_MTL_INTERRUPT_STATUS_DBGIS_SHIFT)) & EMAC_MTL_INTERRUPT_STATUS_DBGIS_MASK)

#define EMAC_MTL_INTERRUPT_STATUS_ESTIS_MASK     (0x40000U)
#define EMAC_MTL_INTERRUPT_STATUS_ESTIS_SHIFT    (18U)
/*! ESTIS - EST (TAS- 802.1Qbv) Interrupt Status
 *  0b0..Not detected
 *  0b1..Detected
 */
#define EMAC_MTL_INTERRUPT_STATUS_ESTIS(x)       (((uint32_t)(((uint32_t)(x)) << EMAC_MTL_INTERRUPT_STATUS_ESTIS_SHIFT)) & EMAC_MTL_INTERRUPT_STATUS_ESTIS_MASK)

#define EMAC_MTL_INTERRUPT_STATUS_MTLPIS_MASK    (0x800000U)
#define EMAC_MTL_INTERRUPT_STATUS_MTLPIS_SHIFT   (23U)
/*! MTLPIS - MTL Receive Parser Interrupt Status
 *  0b0..Not detected
 *  0b1..Detected
 */
#define EMAC_MTL_INTERRUPT_STATUS_MTLPIS(x)      (((uint32_t)(((uint32_t)(x)) << EMAC_MTL_INTERRUPT_STATUS_MTLPIS_SHIFT)) & EMAC_MTL_INTERRUPT_STATUS_MTLPIS_MASK)
/*! @} */

/*! @name MTL_RXQ_DMA_MAP0 - MTL Receive Queue DMA Map 0 */
/*! @{ */

