zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXE/periph6/PERI_EMAC.h
#define EMAC_MTL_RXQ_DMA_MAP0_Q0MDMACH_MASK      (0x1U)
#define EMAC_MTL_RXQ_DMA_MAP0_Q0MDMACH_SHIFT     (0U)
/*! Q0MDMACH - Queue 0 Mapped to DMA Channel */
#define EMAC_MTL_RXQ_DMA_MAP0_Q0MDMACH(x)        (((uint32_t)(((uint32_t)(x)) << EMAC_MTL_RXQ_DMA_MAP0_Q0MDMACH_SHIFT)) & EMAC_MTL_RXQ_DMA_MAP0_Q0MDMACH_MASK)

#define EMAC_MTL_RXQ_DMA_MAP0_Q0DDMACH_MASK      (0x10U)
#define EMAC_MTL_RXQ_DMA_MAP0_Q0DDMACH_SHIFT     (4U)
/*! Q0DDMACH - Queue 0 Enabled for DA-based DMA Channel Selection
 *  0b0..Disable
 *  0b1..Enable
 */
#define EMAC_MTL_RXQ_DMA_MAP0_Q0DDMACH(x)        (((uint32_t)(((uint32_t)(x)) << EMAC_MTL_RXQ_DMA_MAP0_Q0DDMACH_SHIFT)) & EMAC_MTL_RXQ_DMA_MAP0_Q0DDMACH_MASK)

#define EMAC_MTL_RXQ_DMA_MAP0_Q1MDMACH_MASK      (0x100U)
#define EMAC_MTL_RXQ_DMA_MAP0_Q1MDMACH_SHIFT     (8U)
/*! Q1MDMACH - Queue 1 Mapped to DMA Channel */
#define EMAC_MTL_RXQ_DMA_MAP0_Q1MDMACH(x)        (((uint32_t)(((uint32_t)(x)) << EMAC_MTL_RXQ_DMA_MAP0_Q1MDMACH_SHIFT)) & EMAC_MTL_RXQ_DMA_MAP0_Q1MDMACH_MASK)

#define EMAC_MTL_RXQ_DMA_MAP0_Q1DDMACH_MASK      (0x1000U)
#define EMAC_MTL_RXQ_DMA_MAP0_Q1DDMACH_SHIFT     (12U)
/*! Q1DDMACH - Queue 1 Enabled for DA-based DMA Channel Selection
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define EMAC_MTL_RXQ_DMA_MAP0_Q1DDMACH(x)        (((uint32_t)(((uint32_t)(x)) << EMAC_MTL_RXQ_DMA_MAP0_Q1DDMACH_SHIFT)) & EMAC_MTL_RXQ_DMA_MAP0_Q1DDMACH_MASK)
/*! @} */

/*! @name MTL_TBS_CTRL - MTL TBS Control */
/*! @{ */

#define EMAC_MTL_TBS_CTRL_ESTM_MASK              (0x1U)
#define EMAC_MTL_TBS_CTRL_ESTM_SHIFT             (0U)
/*! ESTM - EST offset Mode
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define EMAC_MTL_TBS_CTRL_ESTM(x)                (((uint32_t)(((uint32_t)(x)) << EMAC_MTL_TBS_CTRL_ESTM_SHIFT)) & EMAC_MTL_TBS_CTRL_ESTM_MASK)

#define EMAC_MTL_TBS_CTRL_LEOV_MASK              (0x2U)
#define EMAC_MTL_TBS_CTRL_LEOV_SHIFT             (1U)
/*! LEOV - Launch Expiry Offset Valid
 *  0b0..Invalid
 *  0b1..Valid
 */
#define EMAC_MTL_TBS_CTRL_LEOV(x)                (((uint32_t)(((uint32_t)(x)) << EMAC_MTL_TBS_CTRL_LEOV_SHIFT)) & EMAC_MTL_TBS_CTRL_LEOV_MASK)

#define EMAC_MTL_TBS_CTRL_LEGOS_MASK             (0x70U)
#define EMAC_MTL_TBS_CTRL_LEGOS_SHIFT            (4U)
/*! LEGOS - Launch Expiry GSN Offset */
#define EMAC_MTL_TBS_CTRL_LEGOS(x)               (((uint32_t)(((uint32_t)(x)) << EMAC_MTL_TBS_CTRL_LEGOS_SHIFT)) & EMAC_MTL_TBS_CTRL_LEGOS_MASK)

#define EMAC_MTL_TBS_CTRL_LEOS_MASK              (0xFFFFFF00U)
#define EMAC_MTL_TBS_CTRL_LEOS_SHIFT             (8U)
/*! LEOS - Launch Expiry Offset */
#define EMAC_MTL_TBS_CTRL_LEOS(x)                (((uint32_t)(((uint32_t)(x)) << EMAC_MTL_TBS_CTRL_LEOS_SHIFT)) & EMAC_MTL_TBS_CTRL_LEOS_MASK)
/*! @} */

/*! @name MTL_EST_CONTROL - MTL EST Control */
/*! @{ */

#define EMAC_MTL_EST_CONTROL_EEST_MASK           (0x1U)
#define EMAC_MTL_EST_CONTROL_EEST_SHIFT          (0U)
/*! EEST - Enable EST
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define EMAC_MTL_EST_CONTROL_EEST(x)             (((uint32_t)(((uint32_t)(x)) << EMAC_MTL_EST_CONTROL_EEST_SHIFT)) & EMAC_MTL_EST_CONTROL_EEST_MASK)

#define EMAC_MTL_EST_CONTROL_SSWL_MASK           (0x2U)
#define EMAC_MTL_EST_CONTROL_SSWL_SHIFT          (1U)
/*! SSWL - Switch to Software Owned List
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define EMAC_MTL_EST_CONTROL_SSWL(x)             (((uint32_t)(((uint32_t)(x)) << EMAC_MTL_EST_CONTROL_SSWL_SHIFT)) & EMAC_MTL_EST_CONTROL_SSWL_MASK)

#define EMAC_MTL_EST_CONTROL_DDBF_MASK           (0x10U)
#define EMAC_MTL_EST_CONTROL_DDBF_SHIFT          (4U)
/*! DDBF - Do not Drop Frames during Frame Size Error
 *  0b0..Drop frames during frame size error
 *  0b1..Do not Drop frames during frame size error
 */
#define EMAC_MTL_EST_CONTROL_DDBF(x)             (((uint32_t)(((uint32_t)(x)) << EMAC_MTL_EST_CONTROL_DDBF_SHIFT)) & EMAC_MTL_EST_CONTROL_DDBF_MASK)

#define EMAC_MTL_EST_CONTROL_DFBS_MASK           (0x20U)
#define EMAC_MTL_EST_CONTROL_DFBS_SHIFT          (5U)
/*! DFBS - Drop Frames Causing Scheduling Error
 *  0b0..Do not drop frames
 *  0b1..Drop frames
 */
#define EMAC_MTL_EST_CONTROL_DFBS(x)             (((uint32_t)(((uint32_t)(x)) << EMAC_MTL_EST_CONTROL_DFBS_SHIFT)) & EMAC_MTL_EST_CONTROL_DFBS_MASK)

#define EMAC_MTL_EST_CONTROL_LCSE_MASK           (0xC0U)
#define EMAC_MTL_EST_CONTROL_LCSE_SHIFT          (6U)
/*! LCSE - Loop Count to Report Scheduling Error
 *  0b00..4 iterations
 *  0b01..8 iterations
 *  0b10..16 iterations
 *  0b11..32 iterations
 */
#define EMAC_MTL_EST_CONTROL_LCSE(x)             (((uint32_t)(((uint32_t)(x)) << EMAC_MTL_EST_CONTROL_LCSE_SHIFT)) & EMAC_MTL_EST_CONTROL_LCSE_MASK)

#define EMAC_MTL_EST_CONTROL_TILS_MASK           (0x700U)
#define EMAC_MTL_EST_CONTROL_TILS_SHIFT          (8U)
/*! TILS - Time Interval Left Shift Amount */
#define EMAC_MTL_EST_CONTROL_TILS(x)             (((uint32_t)(((uint32_t)(x)) << EMAC_MTL_EST_CONTROL_TILS_SHIFT)) & EMAC_MTL_EST_CONTROL_TILS_MASK)

#define EMAC_MTL_EST_CONTROL_CTOV_MASK           (0xFFF000U)
#define EMAC_MTL_EST_CONTROL_CTOV_SHIFT          (12U)
/*! CTOV - Current Time Offset Value */
#define EMAC_MTL_EST_CONTROL_CTOV(x)             (((uint32_t)(((uint32_t)(x)) << EMAC_MTL_EST_CONTROL_CTOV_SHIFT)) & EMAC_MTL_EST_CONTROL_CTOV_MASK)

#define EMAC_MTL_EST_CONTROL_PTOV_MASK           (0xFF000000U)
#define EMAC_MTL_EST_CONTROL_PTOV_SHIFT          (24U)
/*! PTOV - PTP Time Offset Value */
#define EMAC_MTL_EST_CONTROL_PTOV(x)             (((uint32_t)(((uint32_t)(x)) << EMAC_MTL_EST_CONTROL_PTOV_SHIFT)) & EMAC_MTL_EST_CONTROL_PTOV_MASK)
/*! @} */

/*! @name MTL_EST_STATUS - MTL EST Status */
/*! @{ */

#define EMAC_MTL_EST_STATUS_SWLC_MASK            (0x1U)
#define EMAC_MTL_EST_STATUS_SWLC_SHIFT           (0U)
/*! SWLC - Switch to Software Owned List Complete
 *  0b0..Not detected
 *  0b1..Detected
 */
#define EMAC_MTL_EST_STATUS_SWLC(x)              (((uint32_t)(((uint32_t)(x)) << EMAC_MTL_EST_STATUS_SWLC_SHIFT)) & EMAC_MTL_EST_STATUS_SWLC_MASK)

#define EMAC_MTL_EST_STATUS_BTRE_MASK            (0x2U)
#define EMAC_MTL_EST_STATUS_BTRE_SHIFT           (1U)
/*! BTRE - BTR Error
 *  0b0..BTR Error not detected
 *  0b1..BTR Error detected
 */
#define EMAC_MTL_EST_STATUS_BTRE(x)              (((uint32_t)(((uint32_t)(x)) << EMAC_MTL_EST_STATUS_BTRE_SHIFT)) & EMAC_MTL_EST_STATUS_BTRE_MASK)

#define EMAC_MTL_EST_STATUS_HLBF_MASK            (0x4U)
#define EMAC_MTL_EST_STATUS_HLBF_SHIFT           (2U)
/*! HLBF
 *  0b0..Head-Of-Line Blocking due to Frame Size not detected
 *  0b1..Head-Of-Line Blocking due to Frame Size detected
 */
#define EMAC_MTL_EST_STATUS_HLBF(x)              (((uint32_t)(((uint32_t)(x)) << EMAC_MTL_EST_STATUS_HLBF_SHIFT)) & EMAC_MTL_EST_STATUS_HLBF_MASK)

#define EMAC_MTL_EST_STATUS_HLBS_MASK            (0x8U)
#define EMAC_MTL_EST_STATUS_HLBS_SHIFT           (3U)
/*! HLBS
 *  0b0..Head-Of-Line Blocking due to Scheduling not detected
 *  0b1..Head-Of-Line Blocking due to Scheduling detected
 */
#define EMAC_MTL_EST_STATUS_HLBS(x)              (((uint32_t)(((uint32_t)(x)) << EMAC_MTL_EST_STATUS_HLBS_SHIFT)) & EMAC_MTL_EST_STATUS_HLBS_MASK)

#define EMAC_MTL_EST_STATUS_CGCE_MASK            (0x10U)
#define EMAC_MTL_EST_STATUS_CGCE_SHIFT           (4U)
/*! CGCE
 *  0b0..Constant Gate Control Error not detected
 *  0b1..Constant Gate Control Error detected
 */
#define EMAC_MTL_EST_STATUS_CGCE(x)              (((uint32_t)(((uint32_t)(x)) << EMAC_MTL_EST_STATUS_CGCE_SHIFT)) & EMAC_MTL_EST_STATUS_CGCE_MASK)

#define EMAC_MTL_EST_STATUS_SWOL_MASK            (0x80U)
#define EMAC_MTL_EST_STATUS_SWOL_SHIFT           (7U)
/*! SWOL
 *  0b0..Gate control list number "0" is owned by software
 *  0b1..Gate control list number "1" is owned by software
 */
#define EMAC_MTL_EST_STATUS_SWOL(x)              (((uint32_t)(((uint32_t)(x)) << EMAC_MTL_EST_STATUS_SWOL_SHIFT)) & EMAC_MTL_EST_STATUS_SWOL_MASK)

#define EMAC_MTL_EST_STATUS_BTRL_MASK            (0xF00U)
#define EMAC_MTL_EST_STATUS_BTRL_SHIFT           (8U)
#define EMAC_MTL_EST_STATUS_BTRL(x)              (((uint32_t)(((uint32_t)(x)) << EMAC_MTL_EST_STATUS_BTRL_SHIFT)) & EMAC_MTL_EST_STATUS_BTRL_MASK)

#define EMAC_MTL_EST_STATUS_CGSN_MASK            (0xF0000U)
#define EMAC_MTL_EST_STATUS_CGSN_SHIFT           (16U)
#define EMAC_MTL_EST_STATUS_CGSN(x)              (((uint32_t)(((uint32_t)(x)) << EMAC_MTL_EST_STATUS_CGSN_SHIFT)) & EMAC_MTL_EST_STATUS_CGSN_MASK)
/*! @} */

