zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXE/periph6/PERI_EMAC.h
/*! @name MTL_EST_SCH_ERROR - MTL EST Scheduling Error */
/*! @{ */

#define EMAC_MTL_EST_SCH_ERROR_SEQN_MASK         (0x3U)
#define EMAC_MTL_EST_SCH_ERROR_SEQN_SHIFT        (0U)
/*! SEQN - Schedule Error Queue Number */
#define EMAC_MTL_EST_SCH_ERROR_SEQN(x)           (((uint32_t)(((uint32_t)(x)) << EMAC_MTL_EST_SCH_ERROR_SEQN_SHIFT)) & EMAC_MTL_EST_SCH_ERROR_SEQN_MASK)
/*! @} */

/*! @name MTL_EST_FRM_SIZE_ERROR - MTL EST Frame Size Error */
/*! @{ */

#define EMAC_MTL_EST_FRM_SIZE_ERROR_FEQN_MASK    (0x3U)
#define EMAC_MTL_EST_FRM_SIZE_ERROR_FEQN_SHIFT   (0U)
/*! FEQN - Frame Size Error Queue Number */
#define EMAC_MTL_EST_FRM_SIZE_ERROR_FEQN(x)      (((uint32_t)(((uint32_t)(x)) << EMAC_MTL_EST_FRM_SIZE_ERROR_FEQN_SHIFT)) & EMAC_MTL_EST_FRM_SIZE_ERROR_FEQN_MASK)
/*! @} */

/*! @name MTL_EST_FRM_SIZE_CAPTURE - MTL EST Frame Size Capture */
/*! @{ */

#define EMAC_MTL_EST_FRM_SIZE_CAPTURE_HBFS_MASK  (0x7FFFU)
#define EMAC_MTL_EST_FRM_SIZE_CAPTURE_HBFS_SHIFT (0U)
/*! HBFS - Frame Size of HLBF */
#define EMAC_MTL_EST_FRM_SIZE_CAPTURE_HBFS(x)    (((uint32_t)(((uint32_t)(x)) << EMAC_MTL_EST_FRM_SIZE_CAPTURE_HBFS_SHIFT)) & EMAC_MTL_EST_FRM_SIZE_CAPTURE_HBFS_MASK)

#define EMAC_MTL_EST_FRM_SIZE_CAPTURE_HBFQ_MASK  (0x10000U)
#define EMAC_MTL_EST_FRM_SIZE_CAPTURE_HBFQ_SHIFT (16U)
/*! HBFQ - Queue Number of HLBF */
#define EMAC_MTL_EST_FRM_SIZE_CAPTURE_HBFQ(x)    (((uint32_t)(((uint32_t)(x)) << EMAC_MTL_EST_FRM_SIZE_CAPTURE_HBFQ_SHIFT)) & EMAC_MTL_EST_FRM_SIZE_CAPTURE_HBFQ_MASK)
/*! @} */

/*! @name MTL_EST_INTR_ENABLE - MTL EST Interrupt Enable */
/*! @{ */

#define EMAC_MTL_EST_INTR_ENABLE_IECC_MASK       (0x1U)
#define EMAC_MTL_EST_INTR_ENABLE_IECC_SHIFT      (0U)
/*! IECC - Interrupt Enable for Switch List
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define EMAC_MTL_EST_INTR_ENABLE_IECC(x)         (((uint32_t)(((uint32_t)(x)) << EMAC_MTL_EST_INTR_ENABLE_IECC_SHIFT)) & EMAC_MTL_EST_INTR_ENABLE_IECC_MASK)

#define EMAC_MTL_EST_INTR_ENABLE_IEBE_MASK       (0x2U)
#define EMAC_MTL_EST_INTR_ENABLE_IEBE_SHIFT      (1U)
/*! IEBE - Interrupt Enable for BTR Error
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define EMAC_MTL_EST_INTR_ENABLE_IEBE(x)         (((uint32_t)(((uint32_t)(x)) << EMAC_MTL_EST_INTR_ENABLE_IEBE_SHIFT)) & EMAC_MTL_EST_INTR_ENABLE_IEBE_MASK)

#define EMAC_MTL_EST_INTR_ENABLE_IEHF_MASK       (0x4U)
#define EMAC_MTL_EST_INTR_ENABLE_IEHF_SHIFT      (2U)
/*! IEHF - Interrupt Enable for HLBF
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define EMAC_MTL_EST_INTR_ENABLE_IEHF(x)         (((uint32_t)(((uint32_t)(x)) << EMAC_MTL_EST_INTR_ENABLE_IEHF_SHIFT)) & EMAC_MTL_EST_INTR_ENABLE_IEHF_MASK)

#define EMAC_MTL_EST_INTR_ENABLE_IEHS_MASK       (0x8U)
#define EMAC_MTL_EST_INTR_ENABLE_IEHS_SHIFT      (3U)
/*! IEHS - Interrupt Enable for HLBS
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define EMAC_MTL_EST_INTR_ENABLE_IEHS(x)         (((uint32_t)(((uint32_t)(x)) << EMAC_MTL_EST_INTR_ENABLE_IEHS_SHIFT)) & EMAC_MTL_EST_INTR_ENABLE_IEHS_MASK)

#define EMAC_MTL_EST_INTR_ENABLE_CGCE_MASK       (0x10U)
#define EMAC_MTL_EST_INTR_ENABLE_CGCE_SHIFT      (4U)
/*! CGCE - Interrupt Enable for CGCE
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define EMAC_MTL_EST_INTR_ENABLE_CGCE(x)         (((uint32_t)(((uint32_t)(x)) << EMAC_MTL_EST_INTR_ENABLE_CGCE_SHIFT)) & EMAC_MTL_EST_INTR_ENABLE_CGCE_MASK)
/*! @} */

/*! @name MTL_EST_GCL_CONTROL - MTL EST GCL Control */
/*! @{ */

#define EMAC_MTL_EST_GCL_CONTROL_SRWO_MASK       (0x1U)
#define EMAC_MTL_EST_GCL_CONTROL_SRWO_SHIFT      (0U)
/*! SRWO - Start Read/Write Operation
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define EMAC_MTL_EST_GCL_CONTROL_SRWO(x)         (((uint32_t)(((uint32_t)(x)) << EMAC_MTL_EST_GCL_CONTROL_SRWO_SHIFT)) & EMAC_MTL_EST_GCL_CONTROL_SRWO_MASK)

#define EMAC_MTL_EST_GCL_CONTROL_R1W0_MASK       (0x2U)
#define EMAC_MTL_EST_GCL_CONTROL_R1W0_SHIFT      (1U)
/*! R1W0 - Read '1', Write '0'
 *  0b0..Write operation
 *  0b1..Read operation
 */
#define EMAC_MTL_EST_GCL_CONTROL_R1W0(x)         (((uint32_t)(((uint32_t)(x)) << EMAC_MTL_EST_GCL_CONTROL_R1W0_SHIFT)) & EMAC_MTL_EST_GCL_CONTROL_R1W0_MASK)

#define EMAC_MTL_EST_GCL_CONTROL_GCRR_MASK       (0x4U)
#define EMAC_MTL_EST_GCL_CONTROL_GCRR_SHIFT      (2U)
/*! GCRR - Gate Control Related Registers
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define EMAC_MTL_EST_GCL_CONTROL_GCRR(x)         (((uint32_t)(((uint32_t)(x)) << EMAC_MTL_EST_GCL_CONTROL_GCRR_SHIFT)) & EMAC_MTL_EST_GCL_CONTROL_GCRR_MASK)

#define EMAC_MTL_EST_GCL_CONTROL_DBGM_MASK       (0x10U)
#define EMAC_MTL_EST_GCL_CONTROL_DBGM_SHIFT      (4U)
/*! DBGM - Debug Mode
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define EMAC_MTL_EST_GCL_CONTROL_DBGM(x)         (((uint32_t)(((uint32_t)(x)) << EMAC_MTL_EST_GCL_CONTROL_DBGM_SHIFT)) & EMAC_MTL_EST_GCL_CONTROL_DBGM_MASK)

#define EMAC_MTL_EST_GCL_CONTROL_DBGB_MASK       (0x20U)
#define EMAC_MTL_EST_GCL_CONTROL_DBGB_SHIFT      (5U)
/*! DBGB - Debug Mode Bank Select
 *  0b0..Directed to bank 0
 *  0b1..Directed to bank 1
 */
#define EMAC_MTL_EST_GCL_CONTROL_DBGB(x)         (((uint32_t)(((uint32_t)(x)) << EMAC_MTL_EST_GCL_CONTROL_DBGB_SHIFT)) & EMAC_MTL_EST_GCL_CONTROL_DBGB_MASK)

#define EMAC_MTL_EST_GCL_CONTROL_ADDR_MASK       (0xFF00U)
#define EMAC_MTL_EST_GCL_CONTROL_ADDR_SHIFT      (8U)
#define EMAC_MTL_EST_GCL_CONTROL_ADDR(x)         (((uint32_t)(((uint32_t)(x)) << EMAC_MTL_EST_GCL_CONTROL_ADDR_SHIFT)) & EMAC_MTL_EST_GCL_CONTROL_ADDR_MASK)

#define EMAC_MTL_EST_GCL_CONTROL_ERR0_MASK       (0x100000U)
#define EMAC_MTL_EST_GCL_CONTROL_ERR0_SHIFT      (20U)
/*! ERR0
 *  0b0..ERR0 is disabled
 *  0b1..ERR1 is enabled
 */
#define EMAC_MTL_EST_GCL_CONTROL_ERR0(x)         (((uint32_t)(((uint32_t)(x)) << EMAC_MTL_EST_GCL_CONTROL_ERR0_SHIFT)) & EMAC_MTL_EST_GCL_CONTROL_ERR0_MASK)

#define EMAC_MTL_EST_GCL_CONTROL_ESTEIEE_MASK    (0x200000U)
#define EMAC_MTL_EST_GCL_CONTROL_ESTEIEE_SHIFT   (21U)
/*! ESTEIEE - EST ECC Inject Error Enable
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define EMAC_MTL_EST_GCL_CONTROL_ESTEIEE(x)      (((uint32_t)(((uint32_t)(x)) << EMAC_MTL_EST_GCL_CONTROL_ESTEIEE_SHIFT)) & EMAC_MTL_EST_GCL_CONTROL_ESTEIEE_MASK)

