zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXE/periph6/PERI_EMAC.h
#define EMAC_MTL_RXP_DROP_CNT_RXPDC_MASK         (0x7FFFFFFFU)
#define EMAC_MTL_RXP_DROP_CNT_RXPDC_SHIFT        (0U)
/*! RXPDC - Rx Parser Drop Count */
#define EMAC_MTL_RXP_DROP_CNT_RXPDC(x)           (((uint32_t)(((uint32_t)(x)) << EMAC_MTL_RXP_DROP_CNT_RXPDC_SHIFT)) & EMAC_MTL_RXP_DROP_CNT_RXPDC_MASK)

#define EMAC_MTL_RXP_DROP_CNT_RXPDCOVF_MASK      (0x80000000U)
#define EMAC_MTL_RXP_DROP_CNT_RXPDCOVF_SHIFT     (31U)
/*! RXPDCOVF - Rx Parser Drop Counter Overflow Bit
 *  0b0..Not occurred
 *  0b1..Occurred
 */
#define EMAC_MTL_RXP_DROP_CNT_RXPDCOVF(x)        (((uint32_t)(((uint32_t)(x)) << EMAC_MTL_RXP_DROP_CNT_RXPDCOVF_SHIFT)) & EMAC_MTL_RXP_DROP_CNT_RXPDCOVF_MASK)
/*! @} */

/*! @name MTL_RXP_ERROR_CNT - MTL Rx Parser Error Count */
/*! @{ */

#define EMAC_MTL_RXP_ERROR_CNT_RXPEC_MASK        (0x7FFFFFFFU)
#define EMAC_MTL_RXP_ERROR_CNT_RXPEC_SHIFT       (0U)
/*! RXPEC - Rx Parser Error Count */
#define EMAC_MTL_RXP_ERROR_CNT_RXPEC(x)          (((uint32_t)(((uint32_t)(x)) << EMAC_MTL_RXP_ERROR_CNT_RXPEC_SHIFT)) & EMAC_MTL_RXP_ERROR_CNT_RXPEC_MASK)

#define EMAC_MTL_RXP_ERROR_CNT_RXPECOVF_MASK     (0x80000000U)
#define EMAC_MTL_RXP_ERROR_CNT_RXPECOVF_SHIFT    (31U)
/*! RXPECOVF - Rx Parser Error Counter Overflow Bit
 *  0b0..Not occurred
 *  0b1..Occurred
 */
#define EMAC_MTL_RXP_ERROR_CNT_RXPECOVF(x)       (((uint32_t)(((uint32_t)(x)) << EMAC_MTL_RXP_ERROR_CNT_RXPECOVF_SHIFT)) & EMAC_MTL_RXP_ERROR_CNT_RXPECOVF_MASK)
/*! @} */

/*! @name MTL_RXP_INDIRECT_ACC_CONTROL_STATUS - MTL Rx Parser Indirect Access Control Status */
/*! @{ */

#define EMAC_MTL_RXP_INDIRECT_ACC_CONTROL_STATUS_ADDR_MASK (0xFFU)
#define EMAC_MTL_RXP_INDIRECT_ACC_CONTROL_STATUS_ADDR_SHIFT (0U)
/*! ADDR - FRP Instruction Table Offset Address */
#define EMAC_MTL_RXP_INDIRECT_ACC_CONTROL_STATUS_ADDR(x) (((uint32_t)(((uint32_t)(x)) << EMAC_MTL_RXP_INDIRECT_ACC_CONTROL_STATUS_ADDR_SHIFT)) & EMAC_MTL_RXP_INDIRECT_ACC_CONTROL_STATUS_ADDR_MASK)

#define EMAC_MTL_RXP_INDIRECT_ACC_CONTROL_STATUS_WRRDN_MASK (0x10000U)
#define EMAC_MTL_RXP_INDIRECT_ACC_CONTROL_STATUS_WRRDN_SHIFT (16U)
/*! WRRDN - Read Write Control
 *  0b0..Read operation to the receive parser memory
 *  0b1..Write operation to the receive parser memory
 */
#define EMAC_MTL_RXP_INDIRECT_ACC_CONTROL_STATUS_WRRDN(x) (((uint32_t)(((uint32_t)(x)) << EMAC_MTL_RXP_INDIRECT_ACC_CONTROL_STATUS_WRRDN_SHIFT)) & EMAC_MTL_RXP_INDIRECT_ACC_CONTROL_STATUS_WRRDN_MASK)

#define EMAC_MTL_RXP_INDIRECT_ACC_CONTROL_STATUS_RXPEIEE_MASK (0x100000U)
#define EMAC_MTL_RXP_INDIRECT_ACC_CONTROL_STATUS_RXPEIEE_SHIFT (20U)
/*! RXPEIEE - ECC Inject Error Enable for Rx Parser Memory
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define EMAC_MTL_RXP_INDIRECT_ACC_CONTROL_STATUS_RXPEIEE(x) (((uint32_t)(((uint32_t)(x)) << EMAC_MTL_RXP_INDIRECT_ACC_CONTROL_STATUS_RXPEIEE_SHIFT)) & EMAC_MTL_RXP_INDIRECT_ACC_CONTROL_STATUS_RXPEIEE_MASK)

#define EMAC_MTL_RXP_INDIRECT_ACC_CONTROL_STATUS_RXPEIEC_MASK (0x600000U)
#define EMAC_MTL_RXP_INDIRECT_ACC_CONTROL_STATUS_RXPEIEC_SHIFT (21U)
/*! RXPEIEC - ECC Inject Error Control for Rx Parser Memory
 *  0b00..Insert 1 bit error
 *  0b01..Insert 2 bit errors
 *  0b10..Insert 3 bit errors
 *  0b11..Insert 1 bit error in address field
 */
#define EMAC_MTL_RXP_INDIRECT_ACC_CONTROL_STATUS_RXPEIEC(x) (((uint32_t)(((uint32_t)(x)) << EMAC_MTL_RXP_INDIRECT_ACC_CONTROL_STATUS_RXPEIEC_SHIFT)) & EMAC_MTL_RXP_INDIRECT_ACC_CONTROL_STATUS_RXPEIEC_MASK)

#define EMAC_MTL_RXP_INDIRECT_ACC_CONTROL_STATUS_STARTBUSY_MASK (0x80000000U)
#define EMAC_MTL_RXP_INDIRECT_ACC_CONTROL_STATUS_STARTBUSY_SHIFT (31U)
/*! STARTBUSY - FRP Instruction Table Access Busy
 *  0b0..hardware not busy
 *  0b1..hardware is busy (Read/Write operation from/to the Rx Parser Memory)
 */
#define EMAC_MTL_RXP_INDIRECT_ACC_CONTROL_STATUS_STARTBUSY(x) (((uint32_t)(((uint32_t)(x)) << EMAC_MTL_RXP_INDIRECT_ACC_CONTROL_STATUS_STARTBUSY_SHIFT)) & EMAC_MTL_RXP_INDIRECT_ACC_CONTROL_STATUS_STARTBUSY_MASK)
/*! @} */

/*! @name MTL_RXP_INDIRECT_ACC_DATA - MTL Rx Parser Indirect Access Data */
/*! @{ */

#define EMAC_MTL_RXP_INDIRECT_ACC_DATA_DATA_MASK (0xFFFFFFFFU)
#define EMAC_MTL_RXP_INDIRECT_ACC_DATA_DATA_SHIFT (0U)
/*! DATA - FRP Instruction Table Write/Read Data */
#define EMAC_MTL_RXP_INDIRECT_ACC_DATA_DATA(x)   (((uint32_t)(((uint32_t)(x)) << EMAC_MTL_RXP_INDIRECT_ACC_DATA_DATA_SHIFT)) & EMAC_MTL_RXP_INDIRECT_ACC_DATA_DATA_MASK)
/*! @} */

/*! @name MTL_ECC_CONTROL - MTL ECC Control */
/*! @{ */

#define EMAC_MTL_ECC_CONTROL_MTXEE_MASK          (0x1U)
#define EMAC_MTL_ECC_CONTROL_MTXEE_SHIFT         (0U)
/*! MTXEE - MTL Tx FIFO ECC Enable
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define EMAC_MTL_ECC_CONTROL_MTXEE(x)            (((uint32_t)(((uint32_t)(x)) << EMAC_MTL_ECC_CONTROL_MTXEE_SHIFT)) & EMAC_MTL_ECC_CONTROL_MTXEE_MASK)

#define EMAC_MTL_ECC_CONTROL_MRXEE_MASK          (0x2U)
#define EMAC_MTL_ECC_CONTROL_MRXEE_SHIFT         (1U)
/*! MRXEE - MTL Rx FIFO ECC Enable
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define EMAC_MTL_ECC_CONTROL_MRXEE(x)            (((uint32_t)(((uint32_t)(x)) << EMAC_MTL_ECC_CONTROL_MRXEE_SHIFT)) & EMAC_MTL_ECC_CONTROL_MRXEE_MASK)

#define EMAC_MTL_ECC_CONTROL_MESTEE_MASK         (0x4U)
#define EMAC_MTL_ECC_CONTROL_MESTEE_SHIFT        (2U)
/*! MESTEE - MTL EST ECC Enable
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define EMAC_MTL_ECC_CONTROL_MESTEE(x)           (((uint32_t)(((uint32_t)(x)) << EMAC_MTL_ECC_CONTROL_MESTEE_SHIFT)) & EMAC_MTL_ECC_CONTROL_MESTEE_MASK)

#define EMAC_MTL_ECC_CONTROL_MRXPEE_MASK         (0x8U)
#define EMAC_MTL_ECC_CONTROL_MRXPEE_SHIFT        (3U)
/*! MRXPEE - MTL Rx Parser ECC Enable
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define EMAC_MTL_ECC_CONTROL_MRXPEE(x)           (((uint32_t)(((uint32_t)(x)) << EMAC_MTL_ECC_CONTROL_MRXPEE_SHIFT)) & EMAC_MTL_ECC_CONTROL_MRXPEE_MASK)

#define EMAC_MTL_ECC_CONTROL_MEEAO_MASK          (0x100U)
#define EMAC_MTL_ECC_CONTROL_MEEAO_SHIFT         (8U)
/*! MEEAO - MTL ECC Error Address Status Over-ride
 *  0b0..Disable
 *  0b1..Enable
 */
#define EMAC_MTL_ECC_CONTROL_MEEAO(x)            (((uint32_t)(((uint32_t)(x)) << EMAC_MTL_ECC_CONTROL_MEEAO_SHIFT)) & EMAC_MTL_ECC_CONTROL_MEEAO_MASK)
/*! @} */

/*! @name MTL_SAFETY_INTERRUPT_STATUS - MTL Safety Interript Status */
/*! @{ */

