zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXE/periph6/PERI_EMAC.h
#define EMAC_MTL_SAFETY_INTERRUPT_STATUS_MECIS_MASK (0x1U)
#define EMAC_MTL_SAFETY_INTERRUPT_STATUS_MECIS_SHIFT (0U)
/*! MECIS - MTL ECC Correctable Error Interrupt Status
 *  0b0..MTL ECC Correctable error Interrupt Status not detected
 *  0b1..MTL ECC Correctable error Interrupt Status detected
 */
#define EMAC_MTL_SAFETY_INTERRUPT_STATUS_MECIS(x) (((uint32_t)(((uint32_t)(x)) << EMAC_MTL_SAFETY_INTERRUPT_STATUS_MECIS_SHIFT)) & EMAC_MTL_SAFETY_INTERRUPT_STATUS_MECIS_MASK)

#define EMAC_MTL_SAFETY_INTERRUPT_STATUS_MEUIS_MASK (0x2U)
#define EMAC_MTL_SAFETY_INTERRUPT_STATUS_MEUIS_SHIFT (1U)
/*! MEUIS - MTL ECC Uncorrectable Error Interrupt Status
 *  0b0..Not detected
 *  0b1..Detected
 */
#define EMAC_MTL_SAFETY_INTERRUPT_STATUS_MEUIS(x) (((uint32_t)(((uint32_t)(x)) << EMAC_MTL_SAFETY_INTERRUPT_STATUS_MEUIS_SHIFT)) & EMAC_MTL_SAFETY_INTERRUPT_STATUS_MEUIS_MASK)
/*! @} */

/*! @name MTL_ECC_INTERRUPT_ENABLE - MTL ECC Interrupt Enable */
/*! @{ */

#define EMAC_MTL_ECC_INTERRUPT_ENABLE_TXCEIE_MASK (0x1U)
#define EMAC_MTL_ECC_INTERRUPT_ENABLE_TXCEIE_SHIFT (0U)
/*! TXCEIE - Tx Memory Correctable Error Interrupt Enable
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define EMAC_MTL_ECC_INTERRUPT_ENABLE_TXCEIE(x)  (((uint32_t)(((uint32_t)(x)) << EMAC_MTL_ECC_INTERRUPT_ENABLE_TXCEIE_SHIFT)) & EMAC_MTL_ECC_INTERRUPT_ENABLE_TXCEIE_MASK)

#define EMAC_MTL_ECC_INTERRUPT_ENABLE_RXCEIE_MASK (0x10U)
#define EMAC_MTL_ECC_INTERRUPT_ENABLE_RXCEIE_SHIFT (4U)
/*! RXCEIE - Rx Memory Correctable Error Interrupt Enable
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define EMAC_MTL_ECC_INTERRUPT_ENABLE_RXCEIE(x)  (((uint32_t)(((uint32_t)(x)) << EMAC_MTL_ECC_INTERRUPT_ENABLE_RXCEIE_SHIFT)) & EMAC_MTL_ECC_INTERRUPT_ENABLE_RXCEIE_MASK)

#define EMAC_MTL_ECC_INTERRUPT_ENABLE_ECEIE_MASK (0x100U)
#define EMAC_MTL_ECC_INTERRUPT_ENABLE_ECEIE_SHIFT (8U)
/*! ECEIE - EST Memory Correctable Error Interrupt Enable
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define EMAC_MTL_ECC_INTERRUPT_ENABLE_ECEIE(x)   (((uint32_t)(((uint32_t)(x)) << EMAC_MTL_ECC_INTERRUPT_ENABLE_ECEIE_SHIFT)) & EMAC_MTL_ECC_INTERRUPT_ENABLE_ECEIE_MASK)

#define EMAC_MTL_ECC_INTERRUPT_ENABLE_RPCEIE_MASK (0x1000U)
#define EMAC_MTL_ECC_INTERRUPT_ENABLE_RPCEIE_SHIFT (12U)
/*! RPCEIE - Rx Parser Memory Correctable Error Interrupt Enable
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define EMAC_MTL_ECC_INTERRUPT_ENABLE_RPCEIE(x)  (((uint32_t)(((uint32_t)(x)) << EMAC_MTL_ECC_INTERRUPT_ENABLE_RPCEIE_SHIFT)) & EMAC_MTL_ECC_INTERRUPT_ENABLE_RPCEIE_MASK)
/*! @} */

/*! @name MTL_ECC_INTERRUPT_STATUS - MTL ECC Interrupt Status */
/*! @{ */

#define EMAC_MTL_ECC_INTERRUPT_STATUS_TXCES_MASK (0x1U)
#define EMAC_MTL_ECC_INTERRUPT_STATUS_TXCES_SHIFT (0U)
/*! TXCES - MTL Tx Memory Correctable Error Status
 *  0b0..Not detected
 *  0b1..Detected
 */
#define EMAC_MTL_ECC_INTERRUPT_STATUS_TXCES(x)   (((uint32_t)(((uint32_t)(x)) << EMAC_MTL_ECC_INTERRUPT_STATUS_TXCES_SHIFT)) & EMAC_MTL_ECC_INTERRUPT_STATUS_TXCES_MASK)

#define EMAC_MTL_ECC_INTERRUPT_STATUS_TXAMS_MASK (0x2U)
#define EMAC_MTL_ECC_INTERRUPT_STATUS_TXAMS_SHIFT (1U)
/*! TXAMS - MTL Tx Memory Address Mismatch Status
 *  0b0..Not detected
 *  0b1..Detected
 */
#define EMAC_MTL_ECC_INTERRUPT_STATUS_TXAMS(x)   (((uint32_t)(((uint32_t)(x)) << EMAC_MTL_ECC_INTERRUPT_STATUS_TXAMS_SHIFT)) & EMAC_MTL_ECC_INTERRUPT_STATUS_TXAMS_MASK)

#define EMAC_MTL_ECC_INTERRUPT_STATUS_TXUES_MASK (0x4U)
#define EMAC_MTL_ECC_INTERRUPT_STATUS_TXUES_SHIFT (2U)
/*! TXUES - MTL Tx Memory Uncorrectable Error Status
 *  0b0..Not detected
 *  0b1..Detected
 */
#define EMAC_MTL_ECC_INTERRUPT_STATUS_TXUES(x)   (((uint32_t)(((uint32_t)(x)) << EMAC_MTL_ECC_INTERRUPT_STATUS_TXUES_SHIFT)) & EMAC_MTL_ECC_INTERRUPT_STATUS_TXUES_MASK)

#define EMAC_MTL_ECC_INTERRUPT_STATUS_RXCES_MASK (0x10U)
#define EMAC_MTL_ECC_INTERRUPT_STATUS_RXCES_SHIFT (4U)
/*! RXCES - MTL Rx memory Correctable Error Status
 *  0b0..Not detected
 *  0b1..Detected
 */
#define EMAC_MTL_ECC_INTERRUPT_STATUS_RXCES(x)   (((uint32_t)(((uint32_t)(x)) << EMAC_MTL_ECC_INTERRUPT_STATUS_RXCES_SHIFT)) & EMAC_MTL_ECC_INTERRUPT_STATUS_RXCES_MASK)

#define EMAC_MTL_ECC_INTERRUPT_STATUS_RXAMS_MASK (0x20U)
#define EMAC_MTL_ECC_INTERRUPT_STATUS_RXAMS_SHIFT (5U)
/*! RXAMS - MTL Rx Memory Address Mismatch Status
 *  0b0..Not detected
 *  0b1..Detected
 */
#define EMAC_MTL_ECC_INTERRUPT_STATUS_RXAMS(x)   (((uint32_t)(((uint32_t)(x)) << EMAC_MTL_ECC_INTERRUPT_STATUS_RXAMS_SHIFT)) & EMAC_MTL_ECC_INTERRUPT_STATUS_RXAMS_MASK)

#define EMAC_MTL_ECC_INTERRUPT_STATUS_RXUES_MASK (0x40U)
#define EMAC_MTL_ECC_INTERRUPT_STATUS_RXUES_SHIFT (6U)
/*! RXUES - MTL Rx Memory Uncorrectable Error Status
 *  0b0..Not detected
 *  0b1..Detected
 */
#define EMAC_MTL_ECC_INTERRUPT_STATUS_RXUES(x)   (((uint32_t)(((uint32_t)(x)) << EMAC_MTL_ECC_INTERRUPT_STATUS_RXUES_SHIFT)) & EMAC_MTL_ECC_INTERRUPT_STATUS_RXUES_MASK)

#define EMAC_MTL_ECC_INTERRUPT_STATUS_ECES_MASK  (0x100U)
#define EMAC_MTL_ECC_INTERRUPT_STATUS_ECES_SHIFT (8U)
/*! ECES - MTL EST Memory Correctable Error Status
 *  0b0..Not detected
 *  0b1..Detected
 */
#define EMAC_MTL_ECC_INTERRUPT_STATUS_ECES(x)    (((uint32_t)(((uint32_t)(x)) << EMAC_MTL_ECC_INTERRUPT_STATUS_ECES_SHIFT)) & EMAC_MTL_ECC_INTERRUPT_STATUS_ECES_MASK)

#define EMAC_MTL_ECC_INTERRUPT_STATUS_EAMS_MASK  (0x200U)
#define EMAC_MTL_ECC_INTERRUPT_STATUS_EAMS_SHIFT (9U)
/*! EAMS - MTL EST Memory Address Mismatch Status
 *  0b0..Not detected
 *  0b1..Detected
 */
#define EMAC_MTL_ECC_INTERRUPT_STATUS_EAMS(x)    (((uint32_t)(((uint32_t)(x)) << EMAC_MTL_ECC_INTERRUPT_STATUS_EAMS_SHIFT)) & EMAC_MTL_ECC_INTERRUPT_STATUS_EAMS_MASK)

#define EMAC_MTL_ECC_INTERRUPT_STATUS_EUES_MASK  (0x400U)
#define EMAC_MTL_ECC_INTERRUPT_STATUS_EUES_SHIFT (10U)
/*! EUES - MTL EST Memory Uncorrectable Error Status
 *  0b0..Not detected
 *  0b1..Detected
 */
#define EMAC_MTL_ECC_INTERRUPT_STATUS_EUES(x)    (((uint32_t)(((uint32_t)(x)) << EMAC_MTL_ECC_INTERRUPT_STATUS_EUES_SHIFT)) & EMAC_MTL_ECC_INTERRUPT_STATUS_EUES_MASK)

#define EMAC_MTL_ECC_INTERRUPT_STATUS_RPCES_MASK (0x1000U)
#define EMAC_MTL_ECC_INTERRUPT_STATUS_RPCES_SHIFT (12U)
/*! RPCES - MTL Rx Parser Memory Correctable Error Status
 *  0b0..Not detected
 *  0b1..Detected
 */
#define EMAC_MTL_ECC_INTERRUPT_STATUS_RPCES(x)   (((uint32_t)(((uint32_t)(x)) << EMAC_MTL_ECC_INTERRUPT_STATUS_RPCES_SHIFT)) & EMAC_MTL_ECC_INTERRUPT_STATUS_RPCES_MASK)

#define EMAC_MTL_ECC_INTERRUPT_STATUS_RPAMS_MASK (0x2000U)
#define EMAC_MTL_ECC_INTERRUPT_STATUS_RPAMS_SHIFT (13U)
/*! RPAMS - MTL Rx Parser Memory Address Mismatch Status
 *  0b0..Not detected
 *  0b1..Detected
 */
#define EMAC_MTL_ECC_INTERRUPT_STATUS_RPAMS(x)   (((uint32_t)(((uint32_t)(x)) << EMAC_MTL_ECC_INTERRUPT_STATUS_RPAMS_SHIFT)) & EMAC_MTL_ECC_INTERRUPT_STATUS_RPAMS_MASK)

