zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXE/periph6/PERI_EMAC.h
#define EMAC_MTL_ECC_INTERRUPT_STATUS_RPUES_MASK (0x4000U)
#define EMAC_MTL_ECC_INTERRUPT_STATUS_RPUES_SHIFT (14U)
/*! RPUES - Rx Parser Memory Uncorrectable Error Status
 *  0b0..Not detected
 *  0b1..Detected
 */
#define EMAC_MTL_ECC_INTERRUPT_STATUS_RPUES(x)   (((uint32_t)(((uint32_t)(x)) << EMAC_MTL_ECC_INTERRUPT_STATUS_RPUES_SHIFT)) & EMAC_MTL_ECC_INTERRUPT_STATUS_RPUES_MASK)
/*! @} */

/*! @name MTL_ECC_ERR_STS_RCTL - MTL ECC Error Status */
/*! @{ */

#define EMAC_MTL_ECC_ERR_STS_RCTL_EESRE_MASK     (0x1U)
#define EMAC_MTL_ECC_ERR_STS_RCTL_EESRE_SHIFT    (0U)
/*! EESRE - MTL ECC Error Status Read Enable
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define EMAC_MTL_ECC_ERR_STS_RCTL_EESRE(x)       (((uint32_t)(((uint32_t)(x)) << EMAC_MTL_ECC_ERR_STS_RCTL_EESRE_SHIFT)) & EMAC_MTL_ECC_ERR_STS_RCTL_EESRE_MASK)

#define EMAC_MTL_ECC_ERR_STS_RCTL_EMS_MASK       (0xEU)
#define EMAC_MTL_ECC_ERR_STS_RCTL_EMS_SHIFT      (1U)
/*! EMS - MTL ECC Memory Selection
 *  0b000..MTL Tx memory
 *  0b001..MTL Rx memory
 *  0b010..MTL EST memory
 *  0b011..MTL Rx Parser memory
 *  0b100..DMA TSO memory
 */
#define EMAC_MTL_ECC_ERR_STS_RCTL_EMS(x)         (((uint32_t)(((uint32_t)(x)) << EMAC_MTL_ECC_ERR_STS_RCTL_EMS_SHIFT)) & EMAC_MTL_ECC_ERR_STS_RCTL_EMS_MASK)

#define EMAC_MTL_ECC_ERR_STS_RCTL_CCES_MASK      (0x10U)
#define EMAC_MTL_ECC_ERR_STS_RCTL_CCES_SHIFT     (4U)
/*! CCES - Clear Correctable Error Status
 *  0b0..Not detected
 *  0b1..Detected
 */
#define EMAC_MTL_ECC_ERR_STS_RCTL_CCES(x)        (((uint32_t)(((uint32_t)(x)) << EMAC_MTL_ECC_ERR_STS_RCTL_CCES_SHIFT)) & EMAC_MTL_ECC_ERR_STS_RCTL_CCES_MASK)

#define EMAC_MTL_ECC_ERR_STS_RCTL_CUES_MASK      (0x20U)
#define EMAC_MTL_ECC_ERR_STS_RCTL_CUES_SHIFT     (5U)
/*! CUES - Clear Uncorrectable Error Status
 *  0b0..Not detected
 *  0b1..Detected
 */
#define EMAC_MTL_ECC_ERR_STS_RCTL_CUES(x)        (((uint32_t)(((uint32_t)(x)) << EMAC_MTL_ECC_ERR_STS_RCTL_CUES_SHIFT)) & EMAC_MTL_ECC_ERR_STS_RCTL_CUES_MASK)
/*! @} */

/*! @name MTL_ECC_ERR_ADDR_STATUS - MTL ECC Error Adress Status */
/*! @{ */

#define EMAC_MTL_ECC_ERR_ADDR_STATUS_ECEAS_MASK  (0xFFFFU)
#define EMAC_MTL_ECC_ERR_ADDR_STATUS_ECEAS_SHIFT (0U)
/*! ECEAS - MTL ECC Correctable Error Address Status */
#define EMAC_MTL_ECC_ERR_ADDR_STATUS_ECEAS(x)    (((uint32_t)(((uint32_t)(x)) << EMAC_MTL_ECC_ERR_ADDR_STATUS_ECEAS_SHIFT)) & EMAC_MTL_ECC_ERR_ADDR_STATUS_ECEAS_MASK)

#define EMAC_MTL_ECC_ERR_ADDR_STATUS_EUEAS_MASK  (0xFFFF0000U)
#define EMAC_MTL_ECC_ERR_ADDR_STATUS_EUEAS_SHIFT (16U)
/*! EUEAS - MTL ECC Uncorrectable Error Address Status */
#define EMAC_MTL_ECC_ERR_ADDR_STATUS_EUEAS(x)    (((uint32_t)(((uint32_t)(x)) << EMAC_MTL_ECC_ERR_ADDR_STATUS_EUEAS_SHIFT)) & EMAC_MTL_ECC_ERR_ADDR_STATUS_EUEAS_MASK)
/*! @} */

/*! @name MTL_ECC_ERR_CNTR_STATUS - MTL ECC Error Control Status */
/*! @{ */

#define EMAC_MTL_ECC_ERR_CNTR_STATUS_ECECS_MASK  (0xFFU)
#define EMAC_MTL_ECC_ERR_CNTR_STATUS_ECECS_SHIFT (0U)
#define EMAC_MTL_ECC_ERR_CNTR_STATUS_ECECS(x)    (((uint32_t)(((uint32_t)(x)) << EMAC_MTL_ECC_ERR_CNTR_STATUS_ECECS_SHIFT)) & EMAC_MTL_ECC_ERR_CNTR_STATUS_ECECS_MASK)

#define EMAC_MTL_ECC_ERR_CNTR_STATUS_EUECS_MASK  (0xF0000U)
#define EMAC_MTL_ECC_ERR_CNTR_STATUS_EUECS_SHIFT (16U)
#define EMAC_MTL_ECC_ERR_CNTR_STATUS_EUECS(x)    (((uint32_t)(((uint32_t)(x)) << EMAC_MTL_ECC_ERR_CNTR_STATUS_EUECS_SHIFT)) & EMAC_MTL_ECC_ERR_CNTR_STATUS_EUECS_MASK)
/*! @} */

/*! @name MTL_DPP_CONTROL - MTL DPP Control */
/*! @{ */

#define EMAC_MTL_DPP_CONTROL_EDPP_MASK           (0x1U)
#define EMAC_MTL_DPP_CONTROL_EDPP_SHIFT          (0U)
/*! EDPP - Enable Data path Parity Protection
 *  0b0..Disable
 *  0b1..Enable
 */
#define EMAC_MTL_DPP_CONTROL_EDPP(x)             (((uint32_t)(((uint32_t)(x)) << EMAC_MTL_DPP_CONTROL_EDPP_SHIFT)) & EMAC_MTL_DPP_CONTROL_EDPP_MASK)

#define EMAC_MTL_DPP_CONTROL_OPE_MASK            (0x2U)
#define EMAC_MTL_DPP_CONTROL_OPE_SHIFT           (1U)
/*! OPE - Odd Parity Enable
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define EMAC_MTL_DPP_CONTROL_OPE(x)              (((uint32_t)(((uint32_t)(x)) << EMAC_MTL_DPP_CONTROL_OPE_SHIFT)) & EMAC_MTL_DPP_CONTROL_OPE_MASK)

#define EMAC_MTL_DPP_CONTROL_IPEID_MASK          (0x10U)
#define EMAC_MTL_DPP_CONTROL_IPEID_SHIFT         (4U)
/*! IPEID - Insert Parity Error in Interface Data Parity Generator
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define EMAC_MTL_DPP_CONTROL_IPEID(x)            (((uint32_t)(((uint32_t)(x)) << EMAC_MTL_DPP_CONTROL_IPEID_SHIFT)) & EMAC_MTL_DPP_CONTROL_IPEID_MASK)

#define EMAC_MTL_DPP_CONTROL_IPEMC_MASK          (0x20U)
#define EMAC_MTL_DPP_CONTROL_IPEMC_SHIFT         (5U)
/*! IPEMC - Insert Parity Error in MTL Checksum Parity Generator
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define EMAC_MTL_DPP_CONTROL_IPEMC(x)            (((uint32_t)(((uint32_t)(x)) << EMAC_MTL_DPP_CONTROL_IPEMC_SHIFT)) & EMAC_MTL_DPP_CONTROL_IPEMC_MASK)

#define EMAC_MTL_DPP_CONTROL_IPEMTS_MASK         (0x40U)
#define EMAC_MTL_DPP_CONTROL_IPEMTS_SHIFT        (6U)
/*! IPEMTS - Insert Parity Error in MTL Tx Status Parity Generator
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define EMAC_MTL_DPP_CONTROL_IPEMTS(x)           (((uint32_t)(((uint32_t)(x)) << EMAC_MTL_DPP_CONTROL_IPEMTS_SHIFT)) & EMAC_MTL_DPP_CONTROL_IPEMTS_MASK)

#define EMAC_MTL_DPP_CONTROL_IPEMRF_MASK         (0x80U)
#define EMAC_MTL_DPP_CONTROL_IPEMRF_SHIFT        (7U)
/*! IPEMRF - Insert Parity Error in MTL Rx FIFO Read Control Parity Generator
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define EMAC_MTL_DPP_CONTROL_IPEMRF(x)           (((uint32_t)(((uint32_t)(x)) << EMAC_MTL_DPP_CONTROL_IPEMRF_SHIFT)) & EMAC_MTL_DPP_CONTROL_IPEMRF_MASK)

#define EMAC_MTL_DPP_CONTROL_IPEDDC_MASK         (0x100U)
#define EMAC_MTL_DPP_CONTROL_IPEDDC_SHIFT        (8U)
/*! IPEDDC - Insert Parity Error in DMA DTX Control Word Parity Generator
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define EMAC_MTL_DPP_CONTROL_IPEDDC(x)           (((uint32_t)(((uint32_t)(x)) << EMAC_MTL_DPP_CONTROL_IPEDDC_SHIFT)) & EMAC_MTL_DPP_CONTROL_IPEDDC_MASK)

#define EMAC_MTL_DPP_CONTROL_IPETD_MASK          (0x400U)
#define EMAC_MTL_DPP_CONTROL_IPETD_SHIFT         (10U)
/*! IPETD - Insert Parity error in Tx write-back Descriptor parity generator
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define EMAC_MTL_DPP_CONTROL_IPETD(x)            (((uint32_t)(((uint32_t)(x)) << EMAC_MTL_DPP_CONTROL_IPETD_SHIFT)) & EMAC_MTL_DPP_CONTROL_IPETD_MASK)

#define EMAC_MTL_DPP_CONTROL_IPERD_MASK          (0x800U)
#define EMAC_MTL_DPP_CONTROL_IPERD_SHIFT         (11U)
/*! IPERD - Insert Parity error in Rx write-back Descriptor parity generator
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define EMAC_MTL_DPP_CONTROL_IPERD(x)            (((uint32_t)(((uint32_t)(x)) << EMAC_MTL_DPP_CONTROL_IPERD_SHIFT)) & EMAC_MTL_DPP_CONTROL_IPERD_MASK)
/*! @} */

/*! @name MTL_TXQX_OP_MODE - MTL Tx Queue 0 Operation Mode..MTL Tx Queue 1 Operation Mode */
/*! @{ */

#define EMAC_MTL_TXQX_OP_MODE_FTQ_MASK           (0x1U)
#define EMAC_MTL_TXQX_OP_MODE_FTQ_SHIFT          (0U)
/*! FTQ - Flush Transmit Queue
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define EMAC_MTL_TXQX_OP_MODE_FTQ(x)             (((uint32_t)(((uint32_t)(x)) << EMAC_MTL_TXQX_OP_MODE_FTQ_SHIFT)) & EMAC_MTL_TXQX_OP_MODE_FTQ_MASK)

