zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXE/periph6/PERI_EMAC.h
#define EMAC_MTL_TXQX_OP_MODE_TSF_MASK           (0x2U)
#define EMAC_MTL_TXQX_OP_MODE_TSF_SHIFT          (1U)
/*! TSF - Transmit Store and Forward
 *  0b0..Transmit Store and Forward is disabled
 *  0b1..Transmit Store and Forward is enabled
 */
#define EMAC_MTL_TXQX_OP_MODE_TSF(x)             (((uint32_t)(((uint32_t)(x)) << EMAC_MTL_TXQX_OP_MODE_TSF_SHIFT)) & EMAC_MTL_TXQX_OP_MODE_TSF_MASK)

#define EMAC_MTL_TXQX_OP_MODE_TXQEN_MASK         (0xCU)
#define EMAC_MTL_TXQX_OP_MODE_TXQEN_SHIFT        (2U)
/*! TXQEN - Transmit Queue Enable
 *  0b00..Not enabled
 *  0b01..Enable in AV mode (Reserved in non-AV)
 *  0b10..Enabled
 *  0b11..Reserved
 */
#define EMAC_MTL_TXQX_OP_MODE_TXQEN(x)           (((uint32_t)(((uint32_t)(x)) << EMAC_MTL_TXQX_OP_MODE_TXQEN_SHIFT)) & EMAC_MTL_TXQX_OP_MODE_TXQEN_MASK)

#define EMAC_MTL_TXQX_OP_MODE_TTC_MASK           (0x70U)
#define EMAC_MTL_TXQX_OP_MODE_TTC_SHIFT          (4U)
/*! TTC - Transmit Threshold Control
 *  0b000..32
 *  0b001..64
 *  0b010..96
 *  0b011..128
 *  0b100..192
 *  0b101..256
 *  0b110..384
 *  0b111..512
 */
#define EMAC_MTL_TXQX_OP_MODE_TTC(x)             (((uint32_t)(((uint32_t)(x)) << EMAC_MTL_TXQX_OP_MODE_TTC_SHIFT)) & EMAC_MTL_TXQX_OP_MODE_TTC_MASK)

#define EMAC_MTL_TXQX_OP_MODE_TQS_MASK           (0x1F0000U)
#define EMAC_MTL_TXQX_OP_MODE_TQS_SHIFT          (16U)
/*! TQS - Transmit Queue Size */
#define EMAC_MTL_TXQX_OP_MODE_TQS(x)             (((uint32_t)(((uint32_t)(x)) << EMAC_MTL_TXQX_OP_MODE_TQS_SHIFT)) & EMAC_MTL_TXQX_OP_MODE_TQS_MASK)
/*! @} */

/* The count of EMAC_MTL_TXQX_OP_MODE */
#define EMAC_MTL_TXQX_OP_MODE_COUNT              (2U)

/*! @name MTL_TXQX_UNDRFLW - MTL Tx Queue 0 Underflow..MTL Tx Queue 1 Underflow */
/*! @{ */

#define EMAC_MTL_TXQX_UNDRFLW_UFFRMCNT_MASK      (0x7FFU)
#define EMAC_MTL_TXQX_UNDRFLW_UFFRMCNT_SHIFT     (0U)
/*! UFFRMCNT - Underflow Packet Counter */
#define EMAC_MTL_TXQX_UNDRFLW_UFFRMCNT(x)        (((uint32_t)(((uint32_t)(x)) << EMAC_MTL_TXQX_UNDRFLW_UFFRMCNT_SHIFT)) & EMAC_MTL_TXQX_UNDRFLW_UFFRMCNT_MASK)

#define EMAC_MTL_TXQX_UNDRFLW_UFCNTOVF_MASK      (0x800U)
#define EMAC_MTL_TXQX_UNDRFLW_UFCNTOVF_SHIFT     (11U)
/*! UFCNTOVF - Overflow Bit for Underflow Packet Counter
 *  0b0..Not detected
 *  0b1..Detected
 */
#define EMAC_MTL_TXQX_UNDRFLW_UFCNTOVF(x)        (((uint32_t)(((uint32_t)(x)) << EMAC_MTL_TXQX_UNDRFLW_UFCNTOVF_SHIFT)) & EMAC_MTL_TXQX_UNDRFLW_UFCNTOVF_MASK)
/*! @} */

/* The count of EMAC_MTL_TXQX_UNDRFLW */
#define EMAC_MTL_TXQX_UNDRFLW_COUNT              (2U)

/*! @name MTL_TXQX_DBG - MTL Tx Queue 0 Debug..MTL Tx Queue 1 Debug */
/*! @{ */

#define EMAC_MTL_TXQX_DBG_TXQPAUSED_MASK         (0x1U)
#define EMAC_MTL_TXQX_DBG_TXQPAUSED_SHIFT        (0U)
/*! TXQPAUSED - Transmit Queue in Pause
 *  0b0..Not detected
 *  0b1..Detected
 */
#define EMAC_MTL_TXQX_DBG_TXQPAUSED(x)           (((uint32_t)(((uint32_t)(x)) << EMAC_MTL_TXQX_DBG_TXQPAUSED_SHIFT)) & EMAC_MTL_TXQX_DBG_TXQPAUSED_MASK)

#define EMAC_MTL_TXQX_DBG_TRCSTS_MASK            (0x6U)
#define EMAC_MTL_TXQX_DBG_TRCSTS_SHIFT           (1U)
/*! TRCSTS - MTL Tx Queue Read Controller Status
 *  0b00..Idle state
 *  0b01..Read state (transferring data to the MAC transmitter)
 *  0b10..Waiting for pending transit status from the MAC transmitter
 *  0b11..Flushing the transit queue because of the packet abort request from the MAC
 */
#define EMAC_MTL_TXQX_DBG_TRCSTS(x)              (((uint32_t)(((uint32_t)(x)) << EMAC_MTL_TXQX_DBG_TRCSTS_SHIFT)) & EMAC_MTL_TXQX_DBG_TRCSTS_MASK)

#define EMAC_MTL_TXQX_DBG_TWCSTS_MASK            (0x8U)
#define EMAC_MTL_TXQX_DBG_TWCSTS_SHIFT           (3U)
/*! TWCSTS - MTL Tx Queue Write Controller Status
 *  0b0..Not detected
 *  0b1..Detected
 */
#define EMAC_MTL_TXQX_DBG_TWCSTS(x)              (((uint32_t)(((uint32_t)(x)) << EMAC_MTL_TXQX_DBG_TWCSTS_SHIFT)) & EMAC_MTL_TXQX_DBG_TWCSTS_MASK)

#define EMAC_MTL_TXQX_DBG_TXQSTS_MASK            (0x10U)
#define EMAC_MTL_TXQX_DBG_TXQSTS_SHIFT           (4U)
/*! TXQSTS - MTL Tx Queue Not Empty Status
 *  0b0..Not detected
 *  0b1..Detected
 */
#define EMAC_MTL_TXQX_DBG_TXQSTS(x)              (((uint32_t)(((uint32_t)(x)) << EMAC_MTL_TXQX_DBG_TXQSTS_SHIFT)) & EMAC_MTL_TXQX_DBG_TXQSTS_MASK)

#define EMAC_MTL_TXQX_DBG_TXSTSFSTS_MASK         (0x20U)
#define EMAC_MTL_TXQX_DBG_TXSTSFSTS_SHIFT        (5U)
/*! TXSTSFSTS - MTL Tx Status FIFO Full Status
 *  0b0..Not detected
 *  0b1..Detected
 */
#define EMAC_MTL_TXQX_DBG_TXSTSFSTS(x)           (((uint32_t)(((uint32_t)(x)) << EMAC_MTL_TXQX_DBG_TXSTSFSTS_SHIFT)) & EMAC_MTL_TXQX_DBG_TXSTSFSTS_MASK)

#define EMAC_MTL_TXQX_DBG_PTXQ_MASK              (0x70000U)
#define EMAC_MTL_TXQX_DBG_PTXQ_SHIFT             (16U)
/*! PTXQ - Number of Packets in the Transmit Queue */
#define EMAC_MTL_TXQX_DBG_PTXQ(x)                (((uint32_t)(((uint32_t)(x)) << EMAC_MTL_TXQX_DBG_PTXQ_SHIFT)) & EMAC_MTL_TXQX_DBG_PTXQ_MASK)

#define EMAC_MTL_TXQX_DBG_STXSTSF_MASK           (0x700000U)
#define EMAC_MTL_TXQX_DBG_STXSTSF_SHIFT          (20U)
/*! STXSTSF - Number of Status Words in Tx Status FIFO of Queue */
#define EMAC_MTL_TXQX_DBG_STXSTSF(x)             (((uint32_t)(((uint32_t)(x)) << EMAC_MTL_TXQX_DBG_STXSTSF_SHIFT)) & EMAC_MTL_TXQX_DBG_STXSTSF_MASK)
/*! @} */

/* The count of EMAC_MTL_TXQX_DBG */
#define EMAC_MTL_TXQX_DBG_COUNT                  (2U)

/*! @name MTL_TXQX_ETS_CTRL - MTL Tx Queue 1 ETS Control */
/*! @{ */

#define EMAC_MTL_TXQX_ETS_CTRL_AVALG_MASK        (0x4U)
#define EMAC_MTL_TXQX_ETS_CTRL_AVALG_SHIFT       (2U)
/*! AVALG - AV Algorithm
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define EMAC_MTL_TXQX_ETS_CTRL_AVALG(x)          (((uint32_t)(((uint32_t)(x)) << EMAC_MTL_TXQX_ETS_CTRL_AVALG_SHIFT)) & EMAC_MTL_TXQX_ETS_CTRL_AVALG_MASK)

#define EMAC_MTL_TXQX_ETS_CTRL_CC_MASK           (0x8U)
#define EMAC_MTL_TXQX_ETS_CTRL_CC_SHIFT          (3U)
/*! CC - Credit Control
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define EMAC_MTL_TXQX_ETS_CTRL_CC(x)             (((uint32_t)(((uint32_t)(x)) << EMAC_MTL_TXQX_ETS_CTRL_CC_SHIFT)) & EMAC_MTL_TXQX_ETS_CTRL_CC_MASK)

#define EMAC_MTL_TXQX_ETS_CTRL_SLC_MASK          (0x70U)
#define EMAC_MTL_TXQX_ETS_CTRL_SLC_SHIFT         (4U)
/*! SLC - Slot Count
 *  0b000..1 slot
 *  0b001..2 slots
 *  0b010..4 slots
 *  0b011..8 slots
 *  0b100..16 slots
 *  0b101..Reserved
 */
#define EMAC_MTL_TXQX_ETS_CTRL_SLC(x)            (((uint32_t)(((uint32_t)(x)) << EMAC_MTL_TXQX_ETS_CTRL_SLC_SHIFT)) & EMAC_MTL_TXQX_ETS_CTRL_SLC_MASK)
/*! @} */

/* The count of EMAC_MTL_TXQX_ETS_CTRL */
#define EMAC_MTL_TXQX_ETS_CTRL_COUNT             (2U)

/*! @name MTL_TXQX_ETS_STAT - MTL Tx Queue 0 ETS Status..MTL Tx Queue 1 ETS Status */
/*! @{ */

#define EMAC_MTL_TXQX_ETS_STAT_ABS_MASK          (0xFFFFFFU)
#define EMAC_MTL_TXQX_ETS_STAT_ABS_SHIFT         (0U)
/*! ABS - Average Bits per Slot */
#define EMAC_MTL_TXQX_ETS_STAT_ABS(x)            (((uint32_t)(((uint32_t)(x)) << EMAC_MTL_TXQX_ETS_STAT_ABS_SHIFT)) & EMAC_MTL_TXQX_ETS_STAT_ABS_MASK)
/*! @} */

/* The count of EMAC_MTL_TXQX_ETS_STAT */
#define EMAC_MTL_TXQX_ETS_STAT_COUNT             (2U)

/*! @name MTL_TXQX_QNTM_WGHT - MTL Tx Queue Quantum Weight..MTL Tx Queue 1 Quantum Weight */
/*! @{ */

#define EMAC_MTL_TXQX_QNTM_WGHT_ISCQW_MASK       (0x1FFFFFU)
#define EMAC_MTL_TXQX_QNTM_WGHT_ISCQW_SHIFT      (0U)
/*! ISCQW - idleSlopeCredit, Quantum or Weights */
#define EMAC_MTL_TXQX_QNTM_WGHT_ISCQW(x)         (((uint32_t)(((uint32_t)(x)) << EMAC_MTL_TXQX_QNTM_WGHT_ISCQW_SHIFT)) & EMAC_MTL_TXQX_QNTM_WGHT_ISCQW_MASK)
/*! @} */

/* The count of EMAC_MTL_TXQX_QNTM_WGHT */
#define EMAC_MTL_TXQX_QNTM_WGHT_COUNT            (2U)

/*! @name MTL_TXQX_SNDSLP_CRDT - MTL Tx Queue 1 Sendslope Credit */
/*! @{ */

#define EMAC_MTL_TXQX_SNDSLP_CRDT_SSC_MASK       (0x3FFFU)
#define EMAC_MTL_TXQX_SNDSLP_CRDT_SSC_SHIFT      (0U)
/*! SSC - sendSlopeCredit Value */
#define EMAC_MTL_TXQX_SNDSLP_CRDT_SSC(x)         (((uint32_t)(((uint32_t)(x)) << EMAC_MTL_TXQX_SNDSLP_CRDT_SSC_SHIFT)) & EMAC_MTL_TXQX_SNDSLP_CRDT_SSC_MASK)
/*! @} */

/* The count of EMAC_MTL_TXQX_SNDSLP_CRDT */
#define EMAC_MTL_TXQX_SNDSLP_CRDT_COUNT          (2U)

