zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXE/periph6/PERI_EMAC.h
/*! @name MTL_TXQX_HI_CRDT - MTL Tx Queue 1 HiCredit */
/*! @{ */

#define EMAC_MTL_TXQX_HI_CRDT_HC_MASK            (0x1FFFFFFFU)
#define EMAC_MTL_TXQX_HI_CRDT_HC_SHIFT           (0U)
/*! HC - hiCredit Value */
#define EMAC_MTL_TXQX_HI_CRDT_HC(x)              (((uint32_t)(((uint32_t)(x)) << EMAC_MTL_TXQX_HI_CRDT_HC_SHIFT)) & EMAC_MTL_TXQX_HI_CRDT_HC_MASK)
/*! @} */

/* The count of EMAC_MTL_TXQX_HI_CRDT */
#define EMAC_MTL_TXQX_HI_CRDT_COUNT              (2U)

/*! @name MTL_TXQX_LO_CRDT - MTL Tx Queue 1 LoCredit */
/*! @{ */

#define EMAC_MTL_TXQX_LO_CRDT_LC_MASK            (0x1FFFFFFFU)
#define EMAC_MTL_TXQX_LO_CRDT_LC_SHIFT           (0U)
/*! LC - loCredit Value */
#define EMAC_MTL_TXQX_LO_CRDT_LC(x)              (((uint32_t)(((uint32_t)(x)) << EMAC_MTL_TXQX_LO_CRDT_LC_SHIFT)) & EMAC_MTL_TXQX_LO_CRDT_LC_MASK)
/*! @} */

/* The count of EMAC_MTL_TXQX_LO_CRDT */
#define EMAC_MTL_TXQX_LO_CRDT_COUNT              (2U)

/*! @name MTL_QX_INTCTRL_STAT - MTL Queue 0 Interrupt Control Status..MTL Queue 1 Interrupt Control Status */
/*! @{ */

#define EMAC_MTL_QX_INTCTRL_STAT_TXUNFIS_MASK    (0x1U)
#define EMAC_MTL_QX_INTCTRL_STAT_TXUNFIS_SHIFT   (0U)
/*! TXUNFIS - Transmit Queue Underflow Interrupt Status
 *  0b0..Not detected
 *  0b1..Detected
 */
#define EMAC_MTL_QX_INTCTRL_STAT_TXUNFIS(x)      (((uint32_t)(((uint32_t)(x)) << EMAC_MTL_QX_INTCTRL_STAT_TXUNFIS_SHIFT)) & EMAC_MTL_QX_INTCTRL_STAT_TXUNFIS_MASK)

#define EMAC_MTL_QX_INTCTRL_STAT_ABPSIS_MASK     (0x2U)
#define EMAC_MTL_QX_INTCTRL_STAT_ABPSIS_SHIFT    (1U)
/*! ABPSIS - Average Bits Per Slot Interrupt Status
 *  0b0..Not detected
 *  0b1..Detected
 */
#define EMAC_MTL_QX_INTCTRL_STAT_ABPSIS(x)       (((uint32_t)(((uint32_t)(x)) << EMAC_MTL_QX_INTCTRL_STAT_ABPSIS_SHIFT)) & EMAC_MTL_QX_INTCTRL_STAT_ABPSIS_MASK)

#define EMAC_MTL_QX_INTCTRL_STAT_TXUIE_MASK      (0x100U)
#define EMAC_MTL_QX_INTCTRL_STAT_TXUIE_SHIFT     (8U)
/*! TXUIE - Transmit Queue Underflow Interrupt Enable
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define EMAC_MTL_QX_INTCTRL_STAT_TXUIE(x)        (((uint32_t)(((uint32_t)(x)) << EMAC_MTL_QX_INTCTRL_STAT_TXUIE_SHIFT)) & EMAC_MTL_QX_INTCTRL_STAT_TXUIE_MASK)

#define EMAC_MTL_QX_INTCTRL_STAT_ABPSIE_MASK     (0x200U)
#define EMAC_MTL_QX_INTCTRL_STAT_ABPSIE_SHIFT    (9U)
/*! ABPSIE - Average Bits Per Slot Interrupt Enable
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define EMAC_MTL_QX_INTCTRL_STAT_ABPSIE(x)       (((uint32_t)(((uint32_t)(x)) << EMAC_MTL_QX_INTCTRL_STAT_ABPSIE_SHIFT)) & EMAC_MTL_QX_INTCTRL_STAT_ABPSIE_MASK)

#define EMAC_MTL_QX_INTCTRL_STAT_RXOVFIS_MASK    (0x10000U)
#define EMAC_MTL_QX_INTCTRL_STAT_RXOVFIS_SHIFT   (16U)
/*! RXOVFIS - Receive Queue Overflow Interrupt Status
 *  0b0..Not detected
 *  0b1..Detected
 */
#define EMAC_MTL_QX_INTCTRL_STAT_RXOVFIS(x)      (((uint32_t)(((uint32_t)(x)) << EMAC_MTL_QX_INTCTRL_STAT_RXOVFIS_SHIFT)) & EMAC_MTL_QX_INTCTRL_STAT_RXOVFIS_MASK)

#define EMAC_MTL_QX_INTCTRL_STAT_RXOIE_MASK      (0x1000000U)
#define EMAC_MTL_QX_INTCTRL_STAT_RXOIE_SHIFT     (24U)
/*! RXOIE - Receive Queue Overflow Interrupt Enable
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define EMAC_MTL_QX_INTCTRL_STAT_RXOIE(x)        (((uint32_t)(((uint32_t)(x)) << EMAC_MTL_QX_INTCTRL_STAT_RXOIE_SHIFT)) & EMAC_MTL_QX_INTCTRL_STAT_RXOIE_MASK)
/*! @} */

/* The count of EMAC_MTL_QX_INTCTRL_STAT */
#define EMAC_MTL_QX_INTCTRL_STAT_COUNT           (2U)

/*! @name MTL_RXQX_OP_MODE - MTL Rx Queue 0 Operation Mode..MTL Rx Queue 1 Operation Mode */
/*! @{ */

#define EMAC_MTL_RXQX_OP_MODE_RTC_MASK           (0x3U)
#define EMAC_MTL_RXQX_OP_MODE_RTC_SHIFT          (0U)
/*! RTC - Receive Queue Threshold Control
 *  0b00..64
 *  0b01..32
 *  0b10..96
 *  0b11..128
 */
#define EMAC_MTL_RXQX_OP_MODE_RTC(x)             (((uint32_t)(((uint32_t)(x)) << EMAC_MTL_RXQX_OP_MODE_RTC_SHIFT)) & EMAC_MTL_RXQX_OP_MODE_RTC_MASK)

#define EMAC_MTL_RXQX_OP_MODE_FUP_MASK           (0x8U)
#define EMAC_MTL_RXQX_OP_MODE_FUP_SHIFT          (3U)
/*! FUP - Forward Undersized Good Packets
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define EMAC_MTL_RXQX_OP_MODE_FUP(x)             (((uint32_t)(((uint32_t)(x)) << EMAC_MTL_RXQX_OP_MODE_FUP_SHIFT)) & EMAC_MTL_RXQX_OP_MODE_FUP_MASK)

#define EMAC_MTL_RXQX_OP_MODE_FEP_MASK           (0x10U)
#define EMAC_MTL_RXQX_OP_MODE_FEP_SHIFT          (4U)
/*! FEP - Forward Error Packets
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define EMAC_MTL_RXQX_OP_MODE_FEP(x)             (((uint32_t)(((uint32_t)(x)) << EMAC_MTL_RXQX_OP_MODE_FEP_SHIFT)) & EMAC_MTL_RXQX_OP_MODE_FEP_MASK)

#define EMAC_MTL_RXQX_OP_MODE_RSF_MASK           (0x20U)
#define EMAC_MTL_RXQX_OP_MODE_RSF_SHIFT          (5U)
/*! RSF - Receive Queue Store and Forward
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define EMAC_MTL_RXQX_OP_MODE_RSF(x)             (((uint32_t)(((uint32_t)(x)) << EMAC_MTL_RXQX_OP_MODE_RSF_SHIFT)) & EMAC_MTL_RXQX_OP_MODE_RSF_MASK)

#define EMAC_MTL_RXQX_OP_MODE_DIS_TCP_EF_MASK    (0x40U)
#define EMAC_MTL_RXQX_OP_MODE_DIS_TCP_EF_SHIFT   (6U)
/*! DIS_TCP_EF - Disable Dropping of TCP or IP Checksum Error Packets
 *  0b0..Enabled
 *  0b1..Disabled
 */
#define EMAC_MTL_RXQX_OP_MODE_DIS_TCP_EF(x)      (((uint32_t)(((uint32_t)(x)) << EMAC_MTL_RXQX_OP_MODE_DIS_TCP_EF_SHIFT)) & EMAC_MTL_RXQX_OP_MODE_DIS_TCP_EF_MASK)

#define EMAC_MTL_RXQX_OP_MODE_EHFC_MASK          (0x80U)
#define EMAC_MTL_RXQX_OP_MODE_EHFC_SHIFT         (7U)
/*! EHFC - Enable Hardware Flow Control
 *  0b0..Disable
 *  0b1..Enable
 */
#define EMAC_MTL_RXQX_OP_MODE_EHFC(x)            (((uint32_t)(((uint32_t)(x)) << EMAC_MTL_RXQX_OP_MODE_EHFC_SHIFT)) & EMAC_MTL_RXQX_OP_MODE_EHFC_MASK)

#define EMAC_MTL_RXQX_OP_MODE_RFA_MASK           (0xF00U)
#define EMAC_MTL_RXQX_OP_MODE_RFA_SHIFT          (8U)
/*! RFA - Threshold for Activating Flow Control (in half-duplex and full-duplex) */
#define EMAC_MTL_RXQX_OP_MODE_RFA(x)             (((uint32_t)(((uint32_t)(x)) << EMAC_MTL_RXQX_OP_MODE_RFA_SHIFT)) & EMAC_MTL_RXQX_OP_MODE_RFA_MASK)

#define EMAC_MTL_RXQX_OP_MODE_RFD_MASK           (0x3C000U)
#define EMAC_MTL_RXQX_OP_MODE_RFD_SHIFT          (14U)
/*! RFD - Threshold for Deactivating Flow Control (in half-duplex and full-duplex modes) */
#define EMAC_MTL_RXQX_OP_MODE_RFD(x)             (((uint32_t)(((uint32_t)(x)) << EMAC_MTL_RXQX_OP_MODE_RFD_SHIFT)) & EMAC_MTL_RXQX_OP_MODE_RFD_MASK)

