zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXE/periph6/PERI_EMAC.h
#define EMAC_MTL_RXQX_OP_MODE_RQS_MASK           (0x1F00000U)
#define EMAC_MTL_RXQX_OP_MODE_RQS_SHIFT          (20U)
/*! RQS - Receive Queue Size */
#define EMAC_MTL_RXQX_OP_MODE_RQS(x)             (((uint32_t)(((uint32_t)(x)) << EMAC_MTL_RXQX_OP_MODE_RQS_SHIFT)) & EMAC_MTL_RXQX_OP_MODE_RQS_MASK)
/*! @} */

/* The count of EMAC_MTL_RXQX_OP_MODE */
#define EMAC_MTL_RXQX_OP_MODE_COUNT              (2U)

/*! @name MTL_RXQX_MISSPKT_OVRFLW_CNT - MTL Rx Queue Missed Packet Overflow Count..MTL Rx Queue 1 Missed Packet Overflow Counter */
/*! @{ */

#define EMAC_MTL_RXQX_MISSPKT_OVRFLW_CNT_OVFPKTCNT_MASK (0x7FFU)
#define EMAC_MTL_RXQX_MISSPKT_OVRFLW_CNT_OVFPKTCNT_SHIFT (0U)
/*! OVFPKTCNT - Overflow Packet Counter */
#define EMAC_MTL_RXQX_MISSPKT_OVRFLW_CNT_OVFPKTCNT(x) (((uint32_t)(((uint32_t)(x)) << EMAC_MTL_RXQX_MISSPKT_OVRFLW_CNT_OVFPKTCNT_SHIFT)) & EMAC_MTL_RXQX_MISSPKT_OVRFLW_CNT_OVFPKTCNT_MASK)

#define EMAC_MTL_RXQX_MISSPKT_OVRFLW_CNT_OVFCNTOVF_MASK (0x800U)
#define EMAC_MTL_RXQX_MISSPKT_OVRFLW_CNT_OVFCNTOVF_SHIFT (11U)
/*! OVFCNTOVF - Overflow Counter Overflow Bit
 *  0b0..Not detected
 *  0b1..Detected
 */
#define EMAC_MTL_RXQX_MISSPKT_OVRFLW_CNT_OVFCNTOVF(x) (((uint32_t)(((uint32_t)(x)) << EMAC_MTL_RXQX_MISSPKT_OVRFLW_CNT_OVFCNTOVF_SHIFT)) & EMAC_MTL_RXQX_MISSPKT_OVRFLW_CNT_OVFCNTOVF_MASK)

#define EMAC_MTL_RXQX_MISSPKT_OVRFLW_CNT_MISPKTCNT_MASK (0x7FF0000U)
#define EMAC_MTL_RXQX_MISSPKT_OVRFLW_CNT_MISPKTCNT_SHIFT (16U)
/*! MISPKTCNT - Missed Packet Counter */
#define EMAC_MTL_RXQX_MISSPKT_OVRFLW_CNT_MISPKTCNT(x) (((uint32_t)(((uint32_t)(x)) << EMAC_MTL_RXQX_MISSPKT_OVRFLW_CNT_MISPKTCNT_SHIFT)) & EMAC_MTL_RXQX_MISSPKT_OVRFLW_CNT_MISPKTCNT_MASK)

#define EMAC_MTL_RXQX_MISSPKT_OVRFLW_CNT_MISCNTOVF_MASK (0x8000000U)
#define EMAC_MTL_RXQX_MISSPKT_OVRFLW_CNT_MISCNTOVF_SHIFT (27U)
/*! MISCNTOVF - Missed Packet Counter Overflow Bit
 *  0b0..Not detected
 *  0b1..Detected
 */
#define EMAC_MTL_RXQX_MISSPKT_OVRFLW_CNT_MISCNTOVF(x) (((uint32_t)(((uint32_t)(x)) << EMAC_MTL_RXQX_MISSPKT_OVRFLW_CNT_MISCNTOVF_SHIFT)) & EMAC_MTL_RXQX_MISSPKT_OVRFLW_CNT_MISCNTOVF_MASK)
/*! @} */

/* The count of EMAC_MTL_RXQX_MISSPKT_OVRFLW_CNT */
#define EMAC_MTL_RXQX_MISSPKT_OVRFLW_CNT_COUNT   (2U)

/*! @name MTL_RXQX_DBG - MTL Rx Queue 0 Debug..MTL Rx Queue 1 Debug */
/*! @{ */

#define EMAC_MTL_RXQX_DBG_RWCSTS_MASK            (0x1U)
#define EMAC_MTL_RXQX_DBG_RWCSTS_SHIFT           (0U)
/*! RWCSTS - MTL Rx Queue Write Controller Active Status
 *  0b0..Not detected
 *  0b1..Detected
 */
#define EMAC_MTL_RXQX_DBG_RWCSTS(x)              (((uint32_t)(((uint32_t)(x)) << EMAC_MTL_RXQX_DBG_RWCSTS_SHIFT)) & EMAC_MTL_RXQX_DBG_RWCSTS_MASK)

#define EMAC_MTL_RXQX_DBG_RRCSTS_MASK            (0x6U)
#define EMAC_MTL_RXQX_DBG_RRCSTS_SHIFT           (1U)
/*! RRCSTS - MTL Rx Queue Read Controller State
 *  0b00..Idle state
 *  0b01..Reading packet data
 *  0b10..Reading packet status (or timestamp)
 *  0b11..Flushing the packet data and status
 */
#define EMAC_MTL_RXQX_DBG_RRCSTS(x)              (((uint32_t)(((uint32_t)(x)) << EMAC_MTL_RXQX_DBG_RRCSTS_SHIFT)) & EMAC_MTL_RXQX_DBG_RRCSTS_MASK)

#define EMAC_MTL_RXQX_DBG_RXQSTS_MASK            (0x30U)
#define EMAC_MTL_RXQX_DBG_RXQSTS_SHIFT           (4U)
/*! RXQSTS - MTL Rx Queue Fill-Level Status
 *  0b00..Rx Queue empty
 *  0b01..Rx Queue fill-level below flow-control deactivate threshold
 *  0b10..Rx Queue fill-level above flow-control activate threshold
 *  0b11..Rx Queue full
 */
#define EMAC_MTL_RXQX_DBG_RXQSTS(x)              (((uint32_t)(((uint32_t)(x)) << EMAC_MTL_RXQX_DBG_RXQSTS_SHIFT)) & EMAC_MTL_RXQX_DBG_RXQSTS_MASK)

#define EMAC_MTL_RXQX_DBG_PRXQ_MASK              (0x3FFF0000U)
#define EMAC_MTL_RXQX_DBG_PRXQ_SHIFT             (16U)
/*! PRXQ - Number of Packets in Receive Queue */
#define EMAC_MTL_RXQX_DBG_PRXQ(x)                (((uint32_t)(((uint32_t)(x)) << EMAC_MTL_RXQX_DBG_PRXQ_SHIFT)) & EMAC_MTL_RXQX_DBG_PRXQ_MASK)
/*! @} */

/* The count of EMAC_MTL_RXQX_DBG */
#define EMAC_MTL_RXQX_DBG_COUNT                  (2U)

/*! @name MTL_RXQX_CTRL - MTL Rx Queue 0 Control 0..MTL Rx Queue 1 Control */
/*! @{ */

#define EMAC_MTL_RXQX_CTRL_RXQ_WEGT_MASK         (0x7U)
#define EMAC_MTL_RXQX_CTRL_RXQ_WEGT_SHIFT        (0U)
/*! RXQ_WEGT - Receive Queue Weight */
#define EMAC_MTL_RXQX_CTRL_RXQ_WEGT(x)           (((uint32_t)(((uint32_t)(x)) << EMAC_MTL_RXQX_CTRL_RXQ_WEGT_SHIFT)) & EMAC_MTL_RXQX_CTRL_RXQ_WEGT_MASK)

#define EMAC_MTL_RXQX_CTRL_RXQ_FRM_ARBIT_MASK    (0x8U)
#define EMAC_MTL_RXQX_CTRL_RXQ_FRM_ARBIT_SHIFT   (3U)
/*! RXQ_FRM_ARBIT - Receive Queue Packet Arbitration
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define EMAC_MTL_RXQX_CTRL_RXQ_FRM_ARBIT(x)      (((uint32_t)(((uint32_t)(x)) << EMAC_MTL_RXQX_CTRL_RXQ_FRM_ARBIT_SHIFT)) & EMAC_MTL_RXQX_CTRL_RXQ_FRM_ARBIT_MASK)
/*! @} */

/* The count of EMAC_MTL_RXQX_CTRL */
#define EMAC_MTL_RXQX_CTRL_COUNT                 (2U)

/*! @name DMA_MODE - DMA Mode */
/*! @{ */

#define EMAC_DMA_MODE_SWR_MASK                   (0x1U)
#define EMAC_DMA_MODE_SWR_SHIFT                  (0U)
/*! SWR - Software Reset
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define EMAC_DMA_MODE_SWR(x)                     (((uint32_t)(((uint32_t)(x)) << EMAC_DMA_MODE_SWR_SHIFT)) & EMAC_DMA_MODE_SWR_MASK)

#define EMAC_DMA_MODE_DA_MASK                    (0x2U)
#define EMAC_DMA_MODE_DA_SHIFT                   (1U)
/*! DA - DMA Tx or Rx Arbitration Scheme
 *  0b0..Weighted Round-Robin with Rx:Tx or Tx:Rx
 *  0b1..Fixed Priority
 */
#define EMAC_DMA_MODE_DA(x)                      (((uint32_t)(((uint32_t)(x)) << EMAC_DMA_MODE_DA_SHIFT)) & EMAC_DMA_MODE_DA_MASK)

#define EMAC_DMA_MODE_TAA_MASK                   (0x1CU)
#define EMAC_DMA_MODE_TAA_SHIFT                  (2U)
/*! TAA - Transmit Arbitration Algorithm
 *  0b000..Fixed priority (Channel 0 has the lowest priority and the last channel has the highest priority)
 *  0b001..Weighted Strict Priority (WSP)
 *  0b010..Weighted Round-Robin (WRR)
 *  0b011..Reserved (for 3'b011 to 3'b111)
 */
#define EMAC_DMA_MODE_TAA(x)                     (((uint32_t)(((uint32_t)(x)) << EMAC_DMA_MODE_TAA_SHIFT)) & EMAC_DMA_MODE_TAA_MASK)

