zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXE/periph6/PERI_EMAC.h
#define EMAC_DMA_MODE_ARBC_MASK                  (0x200U)
#define EMAC_DMA_MODE_ARBC_SHIFT                 (9U)
/*! ARBC
 *  0b0..NXP reserved field disabled
 *  0b1..NXP reserved field enabled up on NXP request
 */
#define EMAC_DMA_MODE_ARBC(x)                    (((uint32_t)(((uint32_t)(x)) << EMAC_DMA_MODE_ARBC_SHIFT)) & EMAC_DMA_MODE_ARBC_MASK)

#define EMAC_DMA_MODE_TXPR_MASK                  (0x800U)
#define EMAC_DMA_MODE_TXPR_SHIFT                 (11U)
/*! TXPR - Transmit Priority
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define EMAC_DMA_MODE_TXPR(x)                    (((uint32_t)(((uint32_t)(x)) << EMAC_DMA_MODE_TXPR_SHIFT)) & EMAC_DMA_MODE_TXPR_MASK)

#define EMAC_DMA_MODE_PR_MASK                    (0x7000U)
#define EMAC_DMA_MODE_PR_SHIFT                   (12U)
/*! PR - Priority Ratio
 *  0b000..The priority ratio is 1:1
 *  0b001..The priority ratio is 2:1
 *  0b010..The priority ratio is 3:1
 *  0b011..The priority ratio is 4:1
 *  0b100..The priority ratio is 5:1
 *  0b101..The priority ratio is 6:1
 *  0b110..The priority ratio is 7:1
 *  0b111..The priority ratio is 8:1
 */
#define EMAC_DMA_MODE_PR(x)                      (((uint32_t)(((uint32_t)(x)) << EMAC_DMA_MODE_PR_SHIFT)) & EMAC_DMA_MODE_PR_MASK)

#define EMAC_DMA_MODE_INTM_MASK                  (0x30000U)
#define EMAC_DMA_MODE_INTM_SHIFT                 (16U)
/*! INTM - Interrupt Mode
 *  0b00..See above description
 *  0b01..See above description
 *  0b10..See above description
 *  0b11..Reserved
 */
#define EMAC_DMA_MODE_INTM(x)                    (((uint32_t)(((uint32_t)(x)) << EMAC_DMA_MODE_INTM_SHIFT)) & EMAC_DMA_MODE_INTM_MASK)
/*! @} */

/*! @name DMA_SYSBUS_MODE - DMA System Bus Mode */
/*! @{ */

#define EMAC_DMA_SYSBUS_MODE_FB_MASK             (0x1U)
#define EMAC_DMA_SYSBUS_MODE_FB_SHIFT            (0U)
/*! FB - Fixed Burst Length
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define EMAC_DMA_SYSBUS_MODE_FB(x)               (((uint32_t)(((uint32_t)(x)) << EMAC_DMA_SYSBUS_MODE_FB_SHIFT)) & EMAC_DMA_SYSBUS_MODE_FB_MASK)

#define EMAC_DMA_SYSBUS_MODE_AAL_MASK            (0x1000U)
#define EMAC_DMA_SYSBUS_MODE_AAL_SHIFT           (12U)
/*! AAL - Address-Aligned Beats
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define EMAC_DMA_SYSBUS_MODE_AAL(x)              (((uint32_t)(((uint32_t)(x)) << EMAC_DMA_SYSBUS_MODE_AAL_SHIFT)) & EMAC_DMA_SYSBUS_MODE_AAL_MASK)

#define EMAC_DMA_SYSBUS_MODE_MB_MASK             (0x4000U)
#define EMAC_DMA_SYSBUS_MODE_MB_SHIFT            (14U)
/*! MB - Mixed Burst
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define EMAC_DMA_SYSBUS_MODE_MB(x)               (((uint32_t)(((uint32_t)(x)) << EMAC_DMA_SYSBUS_MODE_MB_SHIFT)) & EMAC_DMA_SYSBUS_MODE_MB_MASK)

#define EMAC_DMA_SYSBUS_MODE_RB_MASK             (0x8000U)
#define EMAC_DMA_SYSBUS_MODE_RB_SHIFT            (15U)
/*! RB - Rebuild INCRx Burst
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define EMAC_DMA_SYSBUS_MODE_RB(x)               (((uint32_t)(((uint32_t)(x)) << EMAC_DMA_SYSBUS_MODE_RB_SHIFT)) & EMAC_DMA_SYSBUS_MODE_RB_MASK)
/*! @} */

/*! @name DMA_INTERRUPT_STATUS - DMA Interrupt Status */
/*! @{ */

#define EMAC_DMA_INTERRUPT_STATUS_DC0IS_MASK     (0x1U)
#define EMAC_DMA_INTERRUPT_STATUS_DC0IS_SHIFT    (0U)
/*! DC0IS - DMA Channel 0 Interrupt Status
 *  0b0..Not detected
 *  0b1..Detected
 */
#define EMAC_DMA_INTERRUPT_STATUS_DC0IS(x)       (((uint32_t)(((uint32_t)(x)) << EMAC_DMA_INTERRUPT_STATUS_DC0IS_SHIFT)) & EMAC_DMA_INTERRUPT_STATUS_DC0IS_MASK)

#define EMAC_DMA_INTERRUPT_STATUS_DC1IS_MASK     (0x2U)
#define EMAC_DMA_INTERRUPT_STATUS_DC1IS_SHIFT    (1U)
/*! DC1IS - DMA Channel 1 Interrupt Status
 *  0b0..Not detected
 *  0b1..Detected
 */
#define EMAC_DMA_INTERRUPT_STATUS_DC1IS(x)       (((uint32_t)(((uint32_t)(x)) << EMAC_DMA_INTERRUPT_STATUS_DC1IS_SHIFT)) & EMAC_DMA_INTERRUPT_STATUS_DC1IS_MASK)

#define EMAC_DMA_INTERRUPT_STATUS_MTLIS_MASK     (0x10000U)
#define EMAC_DMA_INTERRUPT_STATUS_MTLIS_SHIFT    (16U)
/*! MTLIS - MTL Interrupt Status
 *  0b0..Not detected
 *  0b1..Detected
 */
#define EMAC_DMA_INTERRUPT_STATUS_MTLIS(x)       (((uint32_t)(((uint32_t)(x)) << EMAC_DMA_INTERRUPT_STATUS_MTLIS_SHIFT)) & EMAC_DMA_INTERRUPT_STATUS_MTLIS_MASK)

#define EMAC_DMA_INTERRUPT_STATUS_MACIS_MASK     (0x20000U)
#define EMAC_DMA_INTERRUPT_STATUS_MACIS_SHIFT    (17U)
/*! MACIS - MAC Interrupt Status
 *  0b0..Not detected
 *  0b1..Detected
 */
#define EMAC_DMA_INTERRUPT_STATUS_MACIS(x)       (((uint32_t)(((uint32_t)(x)) << EMAC_DMA_INTERRUPT_STATUS_MACIS_SHIFT)) & EMAC_DMA_INTERRUPT_STATUS_MACIS_MASK)
/*! @} */

/*! @name DMA_DEBUG_STATUS0 - DMA Debug Status 0 */
/*! @{ */

#define EMAC_DMA_DEBUG_STATUS0_AXWHSTS_MASK      (0x1U)
#define EMAC_DMA_DEBUG_STATUS0_AXWHSTS_SHIFT     (0U)
/*! AXWHSTS - AHB Master Status
 *  0b0..Not detected
 *  0b1..detected
 */
#define EMAC_DMA_DEBUG_STATUS0_AXWHSTS(x)        (((uint32_t)(((uint32_t)(x)) << EMAC_DMA_DEBUG_STATUS0_AXWHSTS_SHIFT)) & EMAC_DMA_DEBUG_STATUS0_AXWHSTS_MASK)

#define EMAC_DMA_DEBUG_STATUS0_RPS0_MASK         (0xF00U)
#define EMAC_DMA_DEBUG_STATUS0_RPS0_SHIFT        (8U)
/*! RPS0 - DMA Channel 0 Receive Process State
 *  0b0000..Stopped (Reset or stop receive command issued)
 *  0b0001..Running (Fetching receive transfer descriptor)
 *  0b0010..Reserved for future use
 *  0b0011..Running (Waiting for receive packet)
 *  0b0100..Suspended (Receive descriptor unavailable)
 *  0b0101..Running (Closing the receive descriptor)
 *  0b0110..Timestamp write state
 *  0b0111..Running (Transferring the received packet data from the receive buffer to the system memory)
 */
#define EMAC_DMA_DEBUG_STATUS0_RPS0(x)           (((uint32_t)(((uint32_t)(x)) << EMAC_DMA_DEBUG_STATUS0_RPS0_SHIFT)) & EMAC_DMA_DEBUG_STATUS0_RPS0_MASK)

#define EMAC_DMA_DEBUG_STATUS0_TPS0_MASK         (0xF000U)
#define EMAC_DMA_DEBUG_STATUS0_TPS0_SHIFT        (12U)
/*! TPS0 - DMA Channel 0 Transmit Process State
 *  0b0000..Stopped (Reset or stop transmit command issued)
 *  0b0001..Running (Fetching transmit transfer descriptor)
 *  0b0010..Running (Waiting for status)
 *  0b0011..Running (Reading data from system memory buffer and queuing it to the transmit buffer (Tx FIFO))
 *  0b0100..Timestamp write state
 *  0b0101..Reserved for future use
 *  0b0110..Suspended (Transmit descriptor unavailable or transmit buffer underflow)
 *  0b0111..Running (Closing transmit descriptor)
 */
#define EMAC_DMA_DEBUG_STATUS0_TPS0(x)           (((uint32_t)(((uint32_t)(x)) << EMAC_DMA_DEBUG_STATUS0_TPS0_SHIFT)) & EMAC_DMA_DEBUG_STATUS0_TPS0_MASK)

#define EMAC_DMA_DEBUG_STATUS0_RPS1_MASK         (0xF0000U)
#define EMAC_DMA_DEBUG_STATUS0_RPS1_SHIFT        (16U)
/*! RPS1 - DMA Channel 1 Receive Process State
 *  0b0000..Stopped (Reset or Stop receive command issued)
 *  0b0001..Running (Fetching receive transfer descriptor)
 *  0b0010..Reserved for future use
 *  0b0011..Running (Waiting for receive packet)
 *  0b0100..Suspended (Receive descriptor unavailable)
 *  0b0101..Running (Closing the receive descriptor)
 *  0b0110..Timestamp write state
 *  0b0111..Running (Transferring the received packet data from the receive buffer to the system memory)
 */
#define EMAC_DMA_DEBUG_STATUS0_RPS1(x)           (((uint32_t)(((uint32_t)(x)) << EMAC_DMA_DEBUG_STATUS0_RPS1_SHIFT)) & EMAC_DMA_DEBUG_STATUS0_RPS1_MASK)

#define EMAC_DMA_DEBUG_STATUS0_TPS1_MASK         (0xF00000U)
#define EMAC_DMA_DEBUG_STATUS0_TPS1_SHIFT        (20U)
/*! TPS1 - DMA Channel 1 Transmit Process State
 *  0b0000..Stopped (Reset or stop transmit command issued)
 *  0b0001..Running (Fetching transmit transfer descriptor)
 *  0b0010..Running (Waiting for status)
 *  0b0011..Running (Reading data from system memory buffer and queuing it to the transmit buffer (Tx FIFO))
 *  0b0100..Timestamp write state
 *  0b0101..Reserved for future use
 *  0b0110..Suspended (Transmit descriptor unavailable or transmit buffer underflow)
 *  0b0111..Running (Closing transmit descriptor)
 */
#define EMAC_DMA_DEBUG_STATUS0_TPS1(x)           (((uint32_t)(((uint32_t)(x)) << EMAC_DMA_DEBUG_STATUS0_TPS1_SHIFT)) & EMAC_DMA_DEBUG_STATUS0_TPS1_MASK)
/*! @} */

/*! @name DMA_TBS_CTRL - DMA TBS Control */
/*! @{ */

#define EMAC_DMA_TBS_CTRL_FTOV_MASK              (0x1U)
#define EMAC_DMA_TBS_CTRL_FTOV_SHIFT             (0U)
/*! FTOV - Fetch Time Offset Valid
 *  0b0..Invalid
 *  0b1..Valid
 */
#define EMAC_DMA_TBS_CTRL_FTOV(x)                (((uint32_t)(((uint32_t)(x)) << EMAC_DMA_TBS_CTRL_FTOV_SHIFT)) & EMAC_DMA_TBS_CTRL_FTOV_MASK)

#define EMAC_DMA_TBS_CTRL_FGOS_MASK              (0x70U)
#define EMAC_DMA_TBS_CTRL_FGOS_SHIFT             (4U)
/*! FGOS - Fetch GSN Offset */
#define EMAC_DMA_TBS_CTRL_FGOS(x)                (((uint32_t)(((uint32_t)(x)) << EMAC_DMA_TBS_CTRL_FGOS_SHIFT)) & EMAC_DMA_TBS_CTRL_FGOS_MASK)

