zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXE/periph6/PERI_EMAC.h
#define EMAC_DMA_TBS_CTRL_FTOS_MASK              (0xFFFFFF00U)
#define EMAC_DMA_TBS_CTRL_FTOS_SHIFT             (8U)
/*! FTOS - Fetch Time Offset */
#define EMAC_DMA_TBS_CTRL_FTOS(x)                (((uint32_t)(((uint32_t)(x)) << EMAC_DMA_TBS_CTRL_FTOS_SHIFT)) & EMAC_DMA_TBS_CTRL_FTOS_MASK)
/*! @} */

/*! @name DMA_SAFETY_INTERRUPT_STATUS - DMA Safety Interrupt Status */
/*! @{ */

#define EMAC_DMA_SAFETY_INTERRUPT_STATUS_DECIS_MASK (0x1U)
#define EMAC_DMA_SAFETY_INTERRUPT_STATUS_DECIS_SHIFT (0U)
/*! DECIS - DMA ECC Correctable Error Interrupt Status
 *  0b0..Not detected
 *  0b1..Detected
 */
#define EMAC_DMA_SAFETY_INTERRUPT_STATUS_DECIS(x) (((uint32_t)(((uint32_t)(x)) << EMAC_DMA_SAFETY_INTERRUPT_STATUS_DECIS_SHIFT)) & EMAC_DMA_SAFETY_INTERRUPT_STATUS_DECIS_MASK)

#define EMAC_DMA_SAFETY_INTERRUPT_STATUS_DEUIS_MASK (0x2U)
#define EMAC_DMA_SAFETY_INTERRUPT_STATUS_DEUIS_SHIFT (1U)
/*! DEUIS - DMA ECC Uncorrectable Error Interrupt Status
 *  0b0..Not detected
 *  0b1..Detected
 */
#define EMAC_DMA_SAFETY_INTERRUPT_STATUS_DEUIS(x) (((uint32_t)(((uint32_t)(x)) << EMAC_DMA_SAFETY_INTERRUPT_STATUS_DEUIS_SHIFT)) & EMAC_DMA_SAFETY_INTERRUPT_STATUS_DEUIS_MASK)

#define EMAC_DMA_SAFETY_INTERRUPT_STATUS_MSCIS_MASK (0x10000000U)
#define EMAC_DMA_SAFETY_INTERRUPT_STATUS_MSCIS_SHIFT (28U)
/*! MSCIS - MTL Safety Correctable Error Interrupt Status
 *  0b0..Not detected
 *  0b1..Detected
 */
#define EMAC_DMA_SAFETY_INTERRUPT_STATUS_MSCIS(x) (((uint32_t)(((uint32_t)(x)) << EMAC_DMA_SAFETY_INTERRUPT_STATUS_MSCIS_SHIFT)) & EMAC_DMA_SAFETY_INTERRUPT_STATUS_MSCIS_MASK)

#define EMAC_DMA_SAFETY_INTERRUPT_STATUS_MSUIS_MASK (0x20000000U)
#define EMAC_DMA_SAFETY_INTERRUPT_STATUS_MSUIS_SHIFT (29U)
/*! MSUIS - MTL Safety Uncorrectable Error Interrupt Status
 *  0b0..Not detected
 *  0b1..Detected
 */
#define EMAC_DMA_SAFETY_INTERRUPT_STATUS_MSUIS(x) (((uint32_t)(((uint32_t)(x)) << EMAC_DMA_SAFETY_INTERRUPT_STATUS_MSUIS_SHIFT)) & EMAC_DMA_SAFETY_INTERRUPT_STATUS_MSUIS_MASK)

#define EMAC_DMA_SAFETY_INTERRUPT_STATUS_MCSIS_MASK (0x80000000U)
#define EMAC_DMA_SAFETY_INTERRUPT_STATUS_MCSIS_SHIFT (31U)
/*! MCSIS - MAC Safety Uncorrectable Interrupt Status
 *  0b0..Not detected
 *  0b1..Detected
 */
#define EMAC_DMA_SAFETY_INTERRUPT_STATUS_MCSIS(x) (((uint32_t)(((uint32_t)(x)) << EMAC_DMA_SAFETY_INTERRUPT_STATUS_MCSIS_SHIFT)) & EMAC_DMA_SAFETY_INTERRUPT_STATUS_MCSIS_MASK)
/*! @} */

/*! @name DMA_CHX_CTRL - DMA Channel 0 Control..DMA Channel 1 Control */
/*! @{ */

#define EMAC_DMA_CHX_CTRL_PBLx8_MASK             (0x10000U)
#define EMAC_DMA_CHX_CTRL_PBLx8_SHIFT            (16U)
/*! PBLx8 - 8xPBL mode
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define EMAC_DMA_CHX_CTRL_PBLx8(x)               (((uint32_t)(((uint32_t)(x)) << EMAC_DMA_CHX_CTRL_PBLx8_SHIFT)) & EMAC_DMA_CHX_CTRL_PBLx8_MASK)

#define EMAC_DMA_CHX_CTRL_DSL_MASK               (0x1C0000U)
#define EMAC_DMA_CHX_CTRL_DSL_SHIFT              (18U)
/*! DSL - Descriptor Skip Length */
#define EMAC_DMA_CHX_CTRL_DSL(x)                 (((uint32_t)(((uint32_t)(x)) << EMAC_DMA_CHX_CTRL_DSL_SHIFT)) & EMAC_DMA_CHX_CTRL_DSL_MASK)
/*! @} */

/* The count of EMAC_DMA_CHX_CTRL */
#define EMAC_DMA_CHX_CTRL_COUNT                  (2U)

/*! @name DMA_CHX_TX_CTRL - DMA Channel Tx Control..DMA Channel 1 Tx Control */
/*! @{ */

#define EMAC_DMA_CHX_TX_CTRL_ST_MASK             (0x1U)
#define EMAC_DMA_CHX_TX_CTRL_ST_SHIFT            (0U)
/*! ST - Start or Stop Transmission Command
 *  0b0..Stop
 *  0b1..Start
 */
#define EMAC_DMA_CHX_TX_CTRL_ST(x)               (((uint32_t)(((uint32_t)(x)) << EMAC_DMA_CHX_TX_CTRL_ST_SHIFT)) & EMAC_DMA_CHX_TX_CTRL_ST_MASK)

#define EMAC_DMA_CHX_TX_CTRL_TCW_MASK            (0xEU)
#define EMAC_DMA_CHX_TX_CTRL_TCW_SHIFT           (1U)
/*! TCW - Transmit Channel Weight */
#define EMAC_DMA_CHX_TX_CTRL_TCW(x)              (((uint32_t)(((uint32_t)(x)) << EMAC_DMA_CHX_TX_CTRL_TCW_SHIFT)) & EMAC_DMA_CHX_TX_CTRL_TCW_MASK)

#define EMAC_DMA_CHX_TX_CTRL_OSF_MASK            (0x10U)
#define EMAC_DMA_CHX_TX_CTRL_OSF_SHIFT           (4U)
/*! OSF - Operate on Second Packet
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define EMAC_DMA_CHX_TX_CTRL_OSF(x)              (((uint32_t)(((uint32_t)(x)) << EMAC_DMA_CHX_TX_CTRL_OSF_SHIFT)) & EMAC_DMA_CHX_TX_CTRL_OSF_MASK)

#define EMAC_DMA_CHX_TX_CTRL_TxPBL_MASK          (0x3F0000U)
#define EMAC_DMA_CHX_TX_CTRL_TxPBL_SHIFT         (16U)
/*! TxPBL - Transmit Programmable Burst Length */
#define EMAC_DMA_CHX_TX_CTRL_TxPBL(x)            (((uint32_t)(((uint32_t)(x)) << EMAC_DMA_CHX_TX_CTRL_TxPBL_SHIFT)) & EMAC_DMA_CHX_TX_CTRL_TxPBL_MASK)

#define EMAC_DMA_CHX_TX_CTRL_ETIC_MASK           (0x400000U)
#define EMAC_DMA_CHX_TX_CTRL_ETIC_SHIFT          (22U)
/*! ETIC - Early Transmit Interrupt Control
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define EMAC_DMA_CHX_TX_CTRL_ETIC(x)             (((uint32_t)(((uint32_t)(x)) << EMAC_DMA_CHX_TX_CTRL_ETIC_SHIFT)) & EMAC_DMA_CHX_TX_CTRL_ETIC_MASK)

#define EMAC_DMA_CHX_TX_CTRL_EDSE_MASK           (0x10000000U)
#define EMAC_DMA_CHX_TX_CTRL_EDSE_SHIFT          (28U)
/*! EDSE - Enhanced Descriptor Enable
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define EMAC_DMA_CHX_TX_CTRL_EDSE(x)             (((uint32_t)(((uint32_t)(x)) << EMAC_DMA_CHX_TX_CTRL_EDSE_SHIFT)) & EMAC_DMA_CHX_TX_CTRL_EDSE_MASK)
/*! @} */

/* The count of EMAC_DMA_CHX_TX_CTRL */
#define EMAC_DMA_CHX_TX_CTRL_COUNT               (2U)

/*! @name DMA_CHX_RX_CTRL - DMA Channel Rx Control..DMA Channel 1 Rx Control */
/*! @{ */

#define EMAC_DMA_CHX_RX_CTRL_SR_MASK             (0x1U)
#define EMAC_DMA_CHX_RX_CTRL_SR_SHIFT            (0U)
/*! SR - Start or Stop Receive
 *  0b0..Stop
 *  0b1..Start
 */
#define EMAC_DMA_CHX_RX_CTRL_SR(x)               (((uint32_t)(((uint32_t)(x)) << EMAC_DMA_CHX_RX_CTRL_SR_SHIFT)) & EMAC_DMA_CHX_RX_CTRL_SR_MASK)

#define EMAC_DMA_CHX_RX_CTRL_RBSZ_x_0_MASK       (0x6U)
#define EMAC_DMA_CHX_RX_CTRL_RBSZ_x_0_SHIFT      (1U)
/*! RBSZ_x_0 - Receive Buffer size Low */
#define EMAC_DMA_CHX_RX_CTRL_RBSZ_x_0(x)         (((uint32_t)(((uint32_t)(x)) << EMAC_DMA_CHX_RX_CTRL_RBSZ_x_0_SHIFT)) & EMAC_DMA_CHX_RX_CTRL_RBSZ_x_0_MASK)

#define EMAC_DMA_CHX_RX_CTRL_RBSZ_13_y_MASK      (0x7FF8U)
#define EMAC_DMA_CHX_RX_CTRL_RBSZ_13_y_SHIFT     (3U)
/*! RBSZ_13_y - Receive Buffer size High */
#define EMAC_DMA_CHX_RX_CTRL_RBSZ_13_y(x)        (((uint32_t)(((uint32_t)(x)) << EMAC_DMA_CHX_RX_CTRL_RBSZ_13_y_SHIFT)) & EMAC_DMA_CHX_RX_CTRL_RBSZ_13_y_MASK)

