zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXE/periph6/PERI_EMAC.h
#define EMAC_DMA_CHX_RX_CTRL_RxPBL_MASK          (0x3F0000U)
#define EMAC_DMA_CHX_RX_CTRL_RxPBL_SHIFT         (16U)
/*! RxPBL - Receive Programmable Burst Length */
#define EMAC_DMA_CHX_RX_CTRL_RxPBL(x)            (((uint32_t)(((uint32_t)(x)) << EMAC_DMA_CHX_RX_CTRL_RxPBL_SHIFT)) & EMAC_DMA_CHX_RX_CTRL_RxPBL_MASK)

#define EMAC_DMA_CHX_RX_CTRL_ERIC_MASK           (0x400000U)
#define EMAC_DMA_CHX_RX_CTRL_ERIC_SHIFT          (22U)
/*! ERIC - Early Receive Interrupt Control
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define EMAC_DMA_CHX_RX_CTRL_ERIC(x)             (((uint32_t)(((uint32_t)(x)) << EMAC_DMA_CHX_RX_CTRL_ERIC_SHIFT)) & EMAC_DMA_CHX_RX_CTRL_ERIC_MASK)

#define EMAC_DMA_CHX_RX_CTRL_RPF_MASK            (0x80000000U)
#define EMAC_DMA_CHX_RX_CTRL_RPF_SHIFT           (31U)
/*! RPF - Rx Packet Flush
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define EMAC_DMA_CHX_RX_CTRL_RPF(x)              (((uint32_t)(((uint32_t)(x)) << EMAC_DMA_CHX_RX_CTRL_RPF_SHIFT)) & EMAC_DMA_CHX_RX_CTRL_RPF_MASK)
/*! @} */

/* The count of EMAC_DMA_CHX_RX_CTRL */
#define EMAC_DMA_CHX_RX_CTRL_COUNT               (2U)

/*! @name DMA_CHX_TXDESC_LIST_ADDR - DMA Channel 0 Tx Descriptor List Address..DMA Channel 1 Tx Descriptor List Address */
/*! @{ */

#define EMAC_DMA_CHX_TXDESC_LIST_ADDR_TDESLA_MASK (0xFFFFFFFCU)
#define EMAC_DMA_CHX_TXDESC_LIST_ADDR_TDESLA_SHIFT (2U)
/*! TDESLA - Start of Transmit List */
#define EMAC_DMA_CHX_TXDESC_LIST_ADDR_TDESLA(x)  (((uint32_t)(((uint32_t)(x)) << EMAC_DMA_CHX_TXDESC_LIST_ADDR_TDESLA_SHIFT)) & EMAC_DMA_CHX_TXDESC_LIST_ADDR_TDESLA_MASK)
/*! @} */

/* The count of EMAC_DMA_CHX_TXDESC_LIST_ADDR */
#define EMAC_DMA_CHX_TXDESC_LIST_ADDR_COUNT      (2U)

/*! @name DMA_CHX_RXDESC_LIST_ADDR - DMA Channel 0 Rx Descriptor List Address..DMA Channel 1 Rx Descriptor List Address */
/*! @{ */

#define EMAC_DMA_CHX_RXDESC_LIST_ADDR_RDESLA_MASK (0xFFFFFFFCU)
#define EMAC_DMA_CHX_RXDESC_LIST_ADDR_RDESLA_SHIFT (2U)
/*! RDESLA - Start of Receive List */
#define EMAC_DMA_CHX_RXDESC_LIST_ADDR_RDESLA(x)  (((uint32_t)(((uint32_t)(x)) << EMAC_DMA_CHX_RXDESC_LIST_ADDR_RDESLA_SHIFT)) & EMAC_DMA_CHX_RXDESC_LIST_ADDR_RDESLA_MASK)
/*! @} */

/* The count of EMAC_DMA_CHX_RXDESC_LIST_ADDR */
#define EMAC_DMA_CHX_RXDESC_LIST_ADDR_COUNT      (2U)

/*! @name DMA_CHX_TXDESC_TAIL_PTR - DMA Channel 0 Tx Descriptor Tail Pointer..DMA Channel 1 Tx Descriptor Tail Pointer */
/*! @{ */

#define EMAC_DMA_CHX_TXDESC_TAIL_PTR_TDTP_MASK   (0xFFFFFFFCU)
#define EMAC_DMA_CHX_TXDESC_TAIL_PTR_TDTP_SHIFT  (2U)
/*! TDTP - Transmit Descriptor Tail Pointer */
#define EMAC_DMA_CHX_TXDESC_TAIL_PTR_TDTP(x)     (((uint32_t)(((uint32_t)(x)) << EMAC_DMA_CHX_TXDESC_TAIL_PTR_TDTP_SHIFT)) & EMAC_DMA_CHX_TXDESC_TAIL_PTR_TDTP_MASK)
/*! @} */

/* The count of EMAC_DMA_CHX_TXDESC_TAIL_PTR */
#define EMAC_DMA_CHX_TXDESC_TAIL_PTR_COUNT       (2U)

/*! @name DMA_CHX_RXDESC_TAIL_PTR - DMA Channeli 0 Rx Descriptor List Pointer..DMA Channel 1 Rx Descriptor Tail Pointer */
/*! @{ */

#define EMAC_DMA_CHX_RXDESC_TAIL_PTR_RDTP_MASK   (0xFFFFFFFCU)
#define EMAC_DMA_CHX_RXDESC_TAIL_PTR_RDTP_SHIFT  (2U)
/*! RDTP - Receive Descriptor Tail Pointer */
#define EMAC_DMA_CHX_RXDESC_TAIL_PTR_RDTP(x)     (((uint32_t)(((uint32_t)(x)) << EMAC_DMA_CHX_RXDESC_TAIL_PTR_RDTP_SHIFT)) & EMAC_DMA_CHX_RXDESC_TAIL_PTR_RDTP_MASK)
/*! @} */

/* The count of EMAC_DMA_CHX_RXDESC_TAIL_PTR */
#define EMAC_DMA_CHX_RXDESC_TAIL_PTR_COUNT       (2U)

/*! @name DMA_CHX_TXDESC_RING_LENGTH - DMA Channel 0 Tx Descriptor Ring Length..DMA Channel 1 Tx Descriptor Ring Length */
/*! @{ */

#define EMAC_DMA_CHX_TXDESC_RING_LENGTH_TDRL_MASK (0x3FFU)
#define EMAC_DMA_CHX_TXDESC_RING_LENGTH_TDRL_SHIFT (0U)
/*! TDRL - Transmit Descriptor Ring Length */
#define EMAC_DMA_CHX_TXDESC_RING_LENGTH_TDRL(x)  (((uint32_t)(((uint32_t)(x)) << EMAC_DMA_CHX_TXDESC_RING_LENGTH_TDRL_SHIFT)) & EMAC_DMA_CHX_TXDESC_RING_LENGTH_TDRL_MASK)
/*! @} */

/* The count of EMAC_DMA_CHX_TXDESC_RING_LENGTH */
#define EMAC_DMA_CHX_TXDESC_RING_LENGTH_COUNT    (2U)

/*! @name DMA_CHX_RXDESC_RING_LENGTH - DMA Channel 0 Rx Descriptor Ring Length..DMA Channel 1 Rx Descriptor Ring Length */
/*! @{ */

#define EMAC_DMA_CHX_RXDESC_RING_LENGTH_RDRL_MASK (0x3FFU)
#define EMAC_DMA_CHX_RXDESC_RING_LENGTH_RDRL_SHIFT (0U)
/*! RDRL - Receive Descriptor Ring Length */
#define EMAC_DMA_CHX_RXDESC_RING_LENGTH_RDRL(x)  (((uint32_t)(((uint32_t)(x)) << EMAC_DMA_CHX_RXDESC_RING_LENGTH_RDRL_SHIFT)) & EMAC_DMA_CHX_RXDESC_RING_LENGTH_RDRL_MASK)
/*! @} */

/* The count of EMAC_DMA_CHX_RXDESC_RING_LENGTH */
#define EMAC_DMA_CHX_RXDESC_RING_LENGTH_COUNT    (2U)

/*! @name DMA_CHX_INT_EN - DMA Channel 0 Interrupt Enable..DMA Channel 1 Interrupt Enable */
/*! @{ */

#define EMAC_DMA_CHX_INT_EN_TIE_MASK             (0x1U)
#define EMAC_DMA_CHX_INT_EN_TIE_SHIFT            (0U)
/*! TIE - Transmit Interrupt Enable
 *  0b0..Disable
 *  0b1..Enable
 */
#define EMAC_DMA_CHX_INT_EN_TIE(x)               (((uint32_t)(((uint32_t)(x)) << EMAC_DMA_CHX_INT_EN_TIE_SHIFT)) & EMAC_DMA_CHX_INT_EN_TIE_MASK)

#define EMAC_DMA_CHX_INT_EN_TXSE_MASK            (0x2U)
#define EMAC_DMA_CHX_INT_EN_TXSE_SHIFT           (1U)
/*! TXSE - Transmit Stopped Enable
 *  0b0..Disable
 *  0b1..Enable
 */
#define EMAC_DMA_CHX_INT_EN_TXSE(x)              (((uint32_t)(((uint32_t)(x)) << EMAC_DMA_CHX_INT_EN_TXSE_SHIFT)) & EMAC_DMA_CHX_INT_EN_TXSE_MASK)

#define EMAC_DMA_CHX_INT_EN_TBUE_MASK            (0x4U)
#define EMAC_DMA_CHX_INT_EN_TBUE_SHIFT           (2U)
/*! TBUE - Transmit Buffer Unavailable Enable
 *  0b0..Disable
 *  0b1..Enable
 */
#define EMAC_DMA_CHX_INT_EN_TBUE(x)              (((uint32_t)(((uint32_t)(x)) << EMAC_DMA_CHX_INT_EN_TBUE_SHIFT)) & EMAC_DMA_CHX_INT_EN_TBUE_MASK)

#define EMAC_DMA_CHX_INT_EN_RIE_MASK             (0x40U)
#define EMAC_DMA_CHX_INT_EN_RIE_SHIFT            (6U)
/*! RIE - Receive Interrupt Enable
 *  0b0..Disable
 *  0b1..Enable
 */
#define EMAC_DMA_CHX_INT_EN_RIE(x)               (((uint32_t)(((uint32_t)(x)) << EMAC_DMA_CHX_INT_EN_RIE_SHIFT)) & EMAC_DMA_CHX_INT_EN_RIE_MASK)

#define EMAC_DMA_CHX_INT_EN_RBUE_MASK            (0x80U)
#define EMAC_DMA_CHX_INT_EN_RBUE_SHIFT           (7U)
/*! RBUE - Receive Buffer Unavailable Enable
 *  0b0..Disable
 *  0b1..Enable
 */
#define EMAC_DMA_CHX_INT_EN_RBUE(x)              (((uint32_t)(((uint32_t)(x)) << EMAC_DMA_CHX_INT_EN_RBUE_SHIFT)) & EMAC_DMA_CHX_INT_EN_RBUE_MASK)

#define EMAC_DMA_CHX_INT_EN_RSE_MASK             (0x100U)
#define EMAC_DMA_CHX_INT_EN_RSE_SHIFT            (8U)
/*! RSE - Receive Stopped Enable
 *  0b0..Disable
 *  0b1..Enable
 */
#define EMAC_DMA_CHX_INT_EN_RSE(x)               (((uint32_t)(((uint32_t)(x)) << EMAC_DMA_CHX_INT_EN_RSE_SHIFT)) & EMAC_DMA_CHX_INT_EN_RSE_MASK)

