zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXE/periph6/PERI_EMAC.h
#define EMAC_DMA_CHX_INT_EN_RWTE_MASK            (0x200U)
#define EMAC_DMA_CHX_INT_EN_RWTE_SHIFT           (9U)
/*! RWTE - Receive Watchdog Timeout Enable
 *  0b0..Disable
 *  0b1..Enable
 */
#define EMAC_DMA_CHX_INT_EN_RWTE(x)              (((uint32_t)(((uint32_t)(x)) << EMAC_DMA_CHX_INT_EN_RWTE_SHIFT)) & EMAC_DMA_CHX_INT_EN_RWTE_MASK)

#define EMAC_DMA_CHX_INT_EN_ETIE_MASK            (0x400U)
#define EMAC_DMA_CHX_INT_EN_ETIE_SHIFT           (10U)
/*! ETIE - Early Transmit Interrupt Enable
 *  0b0..Disable
 *  0b1..Enable
 */
#define EMAC_DMA_CHX_INT_EN_ETIE(x)              (((uint32_t)(((uint32_t)(x)) << EMAC_DMA_CHX_INT_EN_ETIE_SHIFT)) & EMAC_DMA_CHX_INT_EN_ETIE_MASK)

#define EMAC_DMA_CHX_INT_EN_ERIE_MASK            (0x800U)
#define EMAC_DMA_CHX_INT_EN_ERIE_SHIFT           (11U)
/*! ERIE - Early Receive Interrupt Enable
 *  0b0..Disable
 *  0b1..Enable
 */
#define EMAC_DMA_CHX_INT_EN_ERIE(x)              (((uint32_t)(((uint32_t)(x)) << EMAC_DMA_CHX_INT_EN_ERIE_SHIFT)) & EMAC_DMA_CHX_INT_EN_ERIE_MASK)

#define EMAC_DMA_CHX_INT_EN_FBEE_MASK            (0x1000U)
#define EMAC_DMA_CHX_INT_EN_FBEE_SHIFT           (12U)
/*! FBEE - Fatal Bus Error Enable
 *  0b0..Disable
 *  0b1..Enable
 */
#define EMAC_DMA_CHX_INT_EN_FBEE(x)              (((uint32_t)(((uint32_t)(x)) << EMAC_DMA_CHX_INT_EN_FBEE_SHIFT)) & EMAC_DMA_CHX_INT_EN_FBEE_MASK)

#define EMAC_DMA_CHX_INT_EN_CDEE_MASK            (0x2000U)
#define EMAC_DMA_CHX_INT_EN_CDEE_SHIFT           (13U)
/*! CDEE - Context Descriptor Error Enable
 *  0b0..Disable
 *  0b1..Enable
 */
#define EMAC_DMA_CHX_INT_EN_CDEE(x)              (((uint32_t)(((uint32_t)(x)) << EMAC_DMA_CHX_INT_EN_CDEE_SHIFT)) & EMAC_DMA_CHX_INT_EN_CDEE_MASK)

#define EMAC_DMA_CHX_INT_EN_AIE_MASK             (0x4000U)
#define EMAC_DMA_CHX_INT_EN_AIE_SHIFT            (14U)
/*! AIE - Abnormal Interrupt Summary Enable
 *  0b0..Disable
 *  0b1..Enable
 */
#define EMAC_DMA_CHX_INT_EN_AIE(x)               (((uint32_t)(((uint32_t)(x)) << EMAC_DMA_CHX_INT_EN_AIE_SHIFT)) & EMAC_DMA_CHX_INT_EN_AIE_MASK)

#define EMAC_DMA_CHX_INT_EN_NIE_MASK             (0x8000U)
#define EMAC_DMA_CHX_INT_EN_NIE_SHIFT            (15U)
/*! NIE - Normal Interrupt Summary Enable
 *  0b0..Disable
 *  0b1..Enable
 */
#define EMAC_DMA_CHX_INT_EN_NIE(x)               (((uint32_t)(((uint32_t)(x)) << EMAC_DMA_CHX_INT_EN_NIE_SHIFT)) & EMAC_DMA_CHX_INT_EN_NIE_MASK)
/*! @} */

/* The count of EMAC_DMA_CHX_INT_EN */
#define EMAC_DMA_CHX_INT_EN_COUNT                (2U)

/*! @name DMA_CHX_RX_INT_WDTIMER - DMA Channel 0 Rx Interrupt Watchdog Timer..DMA Channel 1 Rx Interrupt Watchdog Timer */
/*! @{ */

#define EMAC_DMA_CHX_RX_INT_WDTIMER_RWT_MASK     (0xFFU)
#define EMAC_DMA_CHX_RX_INT_WDTIMER_RWT_SHIFT    (0U)
/*! RWT - Receive Interrupt Watchdog Timer Count */
#define EMAC_DMA_CHX_RX_INT_WDTIMER_RWT(x)       (((uint32_t)(((uint32_t)(x)) << EMAC_DMA_CHX_RX_INT_WDTIMER_RWT_SHIFT)) & EMAC_DMA_CHX_RX_INT_WDTIMER_RWT_MASK)

#define EMAC_DMA_CHX_RX_INT_WDTIMER_RWTU_MASK    (0x30000U)
#define EMAC_DMA_CHX_RX_INT_WDTIMER_RWTU_SHIFT   (16U)
/*! RWTU - Receive Interrupt Watchdog Timer Count Units */
#define EMAC_DMA_CHX_RX_INT_WDTIMER_RWTU(x)      (((uint32_t)(((uint32_t)(x)) << EMAC_DMA_CHX_RX_INT_WDTIMER_RWTU_SHIFT)) & EMAC_DMA_CHX_RX_INT_WDTIMER_RWTU_MASK)
/*! @} */

/* The count of EMAC_DMA_CHX_RX_INT_WDTIMER */
#define EMAC_DMA_CHX_RX_INT_WDTIMER_COUNT        (2U)

/*! @name DMA_CHX_SLOT_FUNC_CTRL_STAT - DMA Channel 0 Slot Function Control Status..DMA Channel 1 Slot Function Control Status */
/*! @{ */

#define EMAC_DMA_CHX_SLOT_FUNC_CTRL_STAT_ESC_MASK (0x1U)
#define EMAC_DMA_CHX_SLOT_FUNC_CTRL_STAT_ESC_SHIFT (0U)
/*! ESC - Enable Slot Comparison
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define EMAC_DMA_CHX_SLOT_FUNC_CTRL_STAT_ESC(x)  (((uint32_t)(((uint32_t)(x)) << EMAC_DMA_CHX_SLOT_FUNC_CTRL_STAT_ESC_SHIFT)) & EMAC_DMA_CHX_SLOT_FUNC_CTRL_STAT_ESC_MASK)

#define EMAC_DMA_CHX_SLOT_FUNC_CTRL_STAT_ASC_MASK (0x2U)
#define EMAC_DMA_CHX_SLOT_FUNC_CTRL_STAT_ASC_SHIFT (1U)
/*! ASC - Advance Slot Check
 *  0b0..Disabled
 *  0b1..Enabled
 */
#define EMAC_DMA_CHX_SLOT_FUNC_CTRL_STAT_ASC(x)  (((uint32_t)(((uint32_t)(x)) << EMAC_DMA_CHX_SLOT_FUNC_CTRL_STAT_ASC_SHIFT)) & EMAC_DMA_CHX_SLOT_FUNC_CTRL_STAT_ASC_MASK)

#define EMAC_DMA_CHX_SLOT_FUNC_CTRL_STAT_SIV_MASK (0xFFF0U)
#define EMAC_DMA_CHX_SLOT_FUNC_CTRL_STAT_SIV_SHIFT (4U)
/*! SIV - Slot Interval Value */
#define EMAC_DMA_CHX_SLOT_FUNC_CTRL_STAT_SIV(x)  (((uint32_t)(((uint32_t)(x)) << EMAC_DMA_CHX_SLOT_FUNC_CTRL_STAT_SIV_SHIFT)) & EMAC_DMA_CHX_SLOT_FUNC_CTRL_STAT_SIV_MASK)

#define EMAC_DMA_CHX_SLOT_FUNC_CTRL_STAT_RSN_MASK (0xF0000U)
#define EMAC_DMA_CHX_SLOT_FUNC_CTRL_STAT_RSN_SHIFT (16U)
/*! RSN - Reference Slot Number */
#define EMAC_DMA_CHX_SLOT_FUNC_CTRL_STAT_RSN(x)  (((uint32_t)(((uint32_t)(x)) << EMAC_DMA_CHX_SLOT_FUNC_CTRL_STAT_RSN_SHIFT)) & EMAC_DMA_CHX_SLOT_FUNC_CTRL_STAT_RSN_MASK)
/*! @} */

/* The count of EMAC_DMA_CHX_SLOT_FUNC_CTRL_STAT */
#define EMAC_DMA_CHX_SLOT_FUNC_CTRL_STAT_COUNT   (2U)

/*! @name DMA_CHX_CUR_HST_TXDESC - DMA Channel 0 Current Application Transmit Descriptor..DMA Channel 1 Current Application Transmit Descriptor */
/*! @{ */

#define EMAC_DMA_CHX_CUR_HST_TXDESC_CURTDESAPTR_MASK (0xFFFFFFFFU)
#define EMAC_DMA_CHX_CUR_HST_TXDESC_CURTDESAPTR_SHIFT (0U)
/*! CURTDESAPTR - Application Transmit Descriptor Address Pointer */
#define EMAC_DMA_CHX_CUR_HST_TXDESC_CURTDESAPTR(x) (((uint32_t)(((uint32_t)(x)) << EMAC_DMA_CHX_CUR_HST_TXDESC_CURTDESAPTR_SHIFT)) & EMAC_DMA_CHX_CUR_HST_TXDESC_CURTDESAPTR_MASK)
/*! @} */

/* The count of EMAC_DMA_CHX_CUR_HST_TXDESC */
#define EMAC_DMA_CHX_CUR_HST_TXDESC_COUNT        (2U)

/*! @name DMA_CHX_CUR_HST_RXDESC - DMA Channel 0 Current Application Receive Descriptor..DMA Channel 1 Current Application Receive Descriptor */
/*! @{ */

#define EMAC_DMA_CHX_CUR_HST_RXDESC_CURRDESAPTR_MASK (0xFFFFFFFFU)
#define EMAC_DMA_CHX_CUR_HST_RXDESC_CURRDESAPTR_SHIFT (0U)
/*! CURRDESAPTR - Application Receive Descriptor Address Pointer */
#define EMAC_DMA_CHX_CUR_HST_RXDESC_CURRDESAPTR(x) (((uint32_t)(((uint32_t)(x)) << EMAC_DMA_CHX_CUR_HST_RXDESC_CURRDESAPTR_SHIFT)) & EMAC_DMA_CHX_CUR_HST_RXDESC_CURRDESAPTR_MASK)
/*! @} */

/* The count of EMAC_DMA_CHX_CUR_HST_RXDESC */
#define EMAC_DMA_CHX_CUR_HST_RXDESC_COUNT        (2U)

/*! @name DMA_CHX_CUR_HST_TXBUF - DMA Channel 0 Current Application Transmit Descriptor..DMA Channel 1 Current Application Transmit Buffer */
/*! @{ */

#define EMAC_DMA_CHX_CUR_HST_TXBUF_CURTBUFAPTR_MASK (0xFFFFFFFFU)
#define EMAC_DMA_CHX_CUR_HST_TXBUF_CURTBUFAPTR_SHIFT (0U)
/*! CURTBUFAPTR - Application Transmit Buffer Address Pointer */
#define EMAC_DMA_CHX_CUR_HST_TXBUF_CURTBUFAPTR(x) (((uint32_t)(((uint32_t)(x)) << EMAC_DMA_CHX_CUR_HST_TXBUF_CURTBUFAPTR_SHIFT)) & EMAC_DMA_CHX_CUR_HST_TXBUF_CURTBUFAPTR_MASK)
/*! @} */

/* The count of EMAC_DMA_CHX_CUR_HST_TXBUF */
#define EMAC_DMA_CHX_CUR_HST_TXBUF_COUNT         (2U)

