zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXE/periph6/PERI_EMAC.h
/*! @name DMA_CHX_CUR_HST_RXBUF - DMA Channel 0 Current Application Receive Buffer..DMA Channel 1 Current Application Receive Buffer */
/*! @{ */

#define EMAC_DMA_CHX_CUR_HST_RXBUF_CURRBUFAPTR_MASK (0xFFFFFFFFU)
#define EMAC_DMA_CHX_CUR_HST_RXBUF_CURRBUFAPTR_SHIFT (0U)
/*! CURRBUFAPTR - Application Receive Buffer Address Pointer */
#define EMAC_DMA_CHX_CUR_HST_RXBUF_CURRBUFAPTR(x) (((uint32_t)(((uint32_t)(x)) << EMAC_DMA_CHX_CUR_HST_RXBUF_CURRBUFAPTR_SHIFT)) & EMAC_DMA_CHX_CUR_HST_RXBUF_CURRBUFAPTR_MASK)
/*! @} */

/* The count of EMAC_DMA_CHX_CUR_HST_RXBUF */
#define EMAC_DMA_CHX_CUR_HST_RXBUF_COUNT         (2U)

/*! @name DMA_CHX_STAT - DMA Channel 0 Status..DMA Channel 1 Status */
/*! @{ */

#define EMAC_DMA_CHX_STAT_TI_MASK                (0x1U)
#define EMAC_DMA_CHX_STAT_TI_SHIFT               (0U)
/*! TI - Transmit Interrupt
 *  0b0..Not detected
 *  0b1..Detected
 */
#define EMAC_DMA_CHX_STAT_TI(x)                  (((uint32_t)(((uint32_t)(x)) << EMAC_DMA_CHX_STAT_TI_SHIFT)) & EMAC_DMA_CHX_STAT_TI_MASK)

#define EMAC_DMA_CHX_STAT_TPS_MASK               (0x2U)
#define EMAC_DMA_CHX_STAT_TPS_SHIFT              (1U)
/*! TPS - Transmit Process Stopped
 *  0b0..Not detected
 *  0b1..Detected
 */
#define EMAC_DMA_CHX_STAT_TPS(x)                 (((uint32_t)(((uint32_t)(x)) << EMAC_DMA_CHX_STAT_TPS_SHIFT)) & EMAC_DMA_CHX_STAT_TPS_MASK)

#define EMAC_DMA_CHX_STAT_TBU_MASK               (0x4U)
#define EMAC_DMA_CHX_STAT_TBU_SHIFT              (2U)
/*! TBU - Transmit Buffer Unavailable
 *  0b0..Not detected
 *  0b1..Detected
 */
#define EMAC_DMA_CHX_STAT_TBU(x)                 (((uint32_t)(((uint32_t)(x)) << EMAC_DMA_CHX_STAT_TBU_SHIFT)) & EMAC_DMA_CHX_STAT_TBU_MASK)

#define EMAC_DMA_CHX_STAT_RI_MASK                (0x40U)
#define EMAC_DMA_CHX_STAT_RI_SHIFT               (6U)
/*! RI - Receive Interrupt
 *  0b0..Not detected
 *  0b1..Detected
 */
#define EMAC_DMA_CHX_STAT_RI(x)                  (((uint32_t)(((uint32_t)(x)) << EMAC_DMA_CHX_STAT_RI_SHIFT)) & EMAC_DMA_CHX_STAT_RI_MASK)

#define EMAC_DMA_CHX_STAT_RBU_MASK               (0x80U)
#define EMAC_DMA_CHX_STAT_RBU_SHIFT              (7U)
/*! RBU - Receive Buffer Unavailable
 *  0b0..Not detected
 *  0b1..Detected
 */
#define EMAC_DMA_CHX_STAT_RBU(x)                 (((uint32_t)(((uint32_t)(x)) << EMAC_DMA_CHX_STAT_RBU_SHIFT)) & EMAC_DMA_CHX_STAT_RBU_MASK)

#define EMAC_DMA_CHX_STAT_RPS_MASK               (0x100U)
#define EMAC_DMA_CHX_STAT_RPS_SHIFT              (8U)
/*! RPS - Receive Process Stopped
 *  0b0..Not detected
 *  0b1..Detected
 */
#define EMAC_DMA_CHX_STAT_RPS(x)                 (((uint32_t)(((uint32_t)(x)) << EMAC_DMA_CHX_STAT_RPS_SHIFT)) & EMAC_DMA_CHX_STAT_RPS_MASK)

#define EMAC_DMA_CHX_STAT_RWT_MASK               (0x200U)
#define EMAC_DMA_CHX_STAT_RWT_SHIFT              (9U)
/*! RWT - Receive Watchdog Timeout
 *  0b0..Not detected
 *  0b1..Detected
 */
#define EMAC_DMA_CHX_STAT_RWT(x)                 (((uint32_t)(((uint32_t)(x)) << EMAC_DMA_CHX_STAT_RWT_SHIFT)) & EMAC_DMA_CHX_STAT_RWT_MASK)

#define EMAC_DMA_CHX_STAT_ETI_MASK               (0x400U)
#define EMAC_DMA_CHX_STAT_ETI_SHIFT              (10U)
/*! ETI - Early Transmit Interrupt
 *  0b0..Not detected
 *  0b1..Detected
 */
#define EMAC_DMA_CHX_STAT_ETI(x)                 (((uint32_t)(((uint32_t)(x)) << EMAC_DMA_CHX_STAT_ETI_SHIFT)) & EMAC_DMA_CHX_STAT_ETI_MASK)

#define EMAC_DMA_CHX_STAT_ERI_MASK               (0x800U)
#define EMAC_DMA_CHX_STAT_ERI_SHIFT              (11U)
/*! ERI - Early Receive Interrupt
 *  0b0..Not detected
 *  0b1..Detected
 */
#define EMAC_DMA_CHX_STAT_ERI(x)                 (((uint32_t)(((uint32_t)(x)) << EMAC_DMA_CHX_STAT_ERI_SHIFT)) & EMAC_DMA_CHX_STAT_ERI_MASK)

#define EMAC_DMA_CHX_STAT_FBE_MASK               (0x1000U)
#define EMAC_DMA_CHX_STAT_FBE_SHIFT              (12U)
/*! FBE - Fatal Bus Error
 *  0b0..Not detected
 *  0b1..Detected
 */
#define EMAC_DMA_CHX_STAT_FBE(x)                 (((uint32_t)(((uint32_t)(x)) << EMAC_DMA_CHX_STAT_FBE_SHIFT)) & EMAC_DMA_CHX_STAT_FBE_MASK)

#define EMAC_DMA_CHX_STAT_CDE_MASK               (0x2000U)
#define EMAC_DMA_CHX_STAT_CDE_SHIFT              (13U)
/*! CDE - Context Descriptor Error
 *  0b0..Not detected
 *  0b1..Detected
 */
#define EMAC_DMA_CHX_STAT_CDE(x)                 (((uint32_t)(((uint32_t)(x)) << EMAC_DMA_CHX_STAT_CDE_SHIFT)) & EMAC_DMA_CHX_STAT_CDE_MASK)

#define EMAC_DMA_CHX_STAT_AIS_MASK               (0x4000U)
#define EMAC_DMA_CHX_STAT_AIS_SHIFT              (14U)
/*! AIS - Abnormal Interrupt Summary
 *  0b0..Not detected
 *  0b1..Detected
 */
#define EMAC_DMA_CHX_STAT_AIS(x)                 (((uint32_t)(((uint32_t)(x)) << EMAC_DMA_CHX_STAT_AIS_SHIFT)) & EMAC_DMA_CHX_STAT_AIS_MASK)

#define EMAC_DMA_CHX_STAT_NIS_MASK               (0x8000U)
#define EMAC_DMA_CHX_STAT_NIS_SHIFT              (15U)
/*! NIS - Normal Interrupt Summary
 *  0b0..Not detected
 *  0b1..Detected
 */
#define EMAC_DMA_CHX_STAT_NIS(x)                 (((uint32_t)(((uint32_t)(x)) << EMAC_DMA_CHX_STAT_NIS_SHIFT)) & EMAC_DMA_CHX_STAT_NIS_MASK)

#define EMAC_DMA_CHX_STAT_TEB_MASK               (0x70000U)
#define EMAC_DMA_CHX_STAT_TEB_SHIFT              (16U)
/*! TEB - Tx DMA Error Bits */
#define EMAC_DMA_CHX_STAT_TEB(x)                 (((uint32_t)(((uint32_t)(x)) << EMAC_DMA_CHX_STAT_TEB_SHIFT)) & EMAC_DMA_CHX_STAT_TEB_MASK)

#define EMAC_DMA_CHX_STAT_REB_MASK               (0x380000U)
#define EMAC_DMA_CHX_STAT_REB_SHIFT              (19U)
/*! REB - Rx DMA Error Bits */
#define EMAC_DMA_CHX_STAT_REB(x)                 (((uint32_t)(((uint32_t)(x)) << EMAC_DMA_CHX_STAT_REB_SHIFT)) & EMAC_DMA_CHX_STAT_REB_MASK)
/*! @} */

/* The count of EMAC_DMA_CHX_STAT */
#define EMAC_DMA_CHX_STAT_COUNT                  (2U)

/*! @name DMA_CHX_MISS_FRAME_CNT - DMA Channel 0 Miss Frame Counter..DMA Channel 1 Miss Frame Counter */
/*! @{ */

#define EMAC_DMA_CHX_MISS_FRAME_CNT_MFC_MASK     (0x7FFU)
#define EMAC_DMA_CHX_MISS_FRAME_CNT_MFC_SHIFT    (0U)
/*! MFC - Dropped Packet Counters */
#define EMAC_DMA_CHX_MISS_FRAME_CNT_MFC(x)       (((uint32_t)(((uint32_t)(x)) << EMAC_DMA_CHX_MISS_FRAME_CNT_MFC_SHIFT)) & EMAC_DMA_CHX_MISS_FRAME_CNT_MFC_MASK)

