zephyrproject-rtos/hal_nxp/mcux/mcux-sdk-ng/devices/MCX/MCXE/periph6/PERI_EMAC.h
#define EMAC_DMA_CHX_MISS_FRAME_CNT_MFCO_MASK    (0x8000U)
#define EMAC_DMA_CHX_MISS_FRAME_CNT_MFCO_SHIFT   (15U)
/*! MFCO - Overflow status of the MFC Counter
 *  0b0..Not occurred
 *  0b1..Occurred
 */
#define EMAC_DMA_CHX_MISS_FRAME_CNT_MFCO(x)      (((uint32_t)(((uint32_t)(x)) << EMAC_DMA_CHX_MISS_FRAME_CNT_MFCO_SHIFT)) & EMAC_DMA_CHX_MISS_FRAME_CNT_MFCO_MASK)
/*! @} */

/* The count of EMAC_DMA_CHX_MISS_FRAME_CNT */
#define EMAC_DMA_CHX_MISS_FRAME_CNT_COUNT        (2U)

/*! @name DMA_CHX_RXP_ACCEPT_CNT - DMA Channel 0 Rx Parser Accept Count..DMA Channel 1 Rx Parser Accept Count */
/*! @{ */

#define EMAC_DMA_CHX_RXP_ACCEPT_CNT_RXPAC_MASK   (0x7FFFFFFFU)
#define EMAC_DMA_CHX_RXP_ACCEPT_CNT_RXPAC_SHIFT  (0U)
/*! RXPAC - Rx Parser Accept Counter */
#define EMAC_DMA_CHX_RXP_ACCEPT_CNT_RXPAC(x)     (((uint32_t)(((uint32_t)(x)) << EMAC_DMA_CHX_RXP_ACCEPT_CNT_RXPAC_SHIFT)) & EMAC_DMA_CHX_RXP_ACCEPT_CNT_RXPAC_MASK)

#define EMAC_DMA_CHX_RXP_ACCEPT_CNT_RXPACOF_MASK (0x80000000U)
#define EMAC_DMA_CHX_RXP_ACCEPT_CNT_RXPACOF_SHIFT (31U)
/*! RXPACOF - Rx Parser Accept Counter Overflow Bit
 *  0b0..Not occurred
 *  0b1..Occurred
 */
#define EMAC_DMA_CHX_RXP_ACCEPT_CNT_RXPACOF(x)   (((uint32_t)(((uint32_t)(x)) << EMAC_DMA_CHX_RXP_ACCEPT_CNT_RXPACOF_SHIFT)) & EMAC_DMA_CHX_RXP_ACCEPT_CNT_RXPACOF_MASK)
/*! @} */

/* The count of EMAC_DMA_CHX_RXP_ACCEPT_CNT */
#define EMAC_DMA_CHX_RXP_ACCEPT_CNT_COUNT        (2U)

/*! @name DMA_CHX_RX_ERI_CNT - DMA Channel 0 Rx ERI Count..DMA Channel 1 Rx ERI Count */
/*! @{ */

#define EMAC_DMA_CHX_RX_ERI_CNT_ECNT_MASK        (0xFFFU)
#define EMAC_DMA_CHX_RX_ERI_CNT_ECNT_SHIFT       (0U)
/*! ECNT - ERI Counter */
#define EMAC_DMA_CHX_RX_ERI_CNT_ECNT(x)          (((uint32_t)(((uint32_t)(x)) << EMAC_DMA_CHX_RX_ERI_CNT_ECNT_SHIFT)) & EMAC_DMA_CHX_RX_ERI_CNT_ECNT_MASK)
/*! @} */

/* The count of EMAC_DMA_CHX_RX_ERI_CNT */
#define EMAC_DMA_CHX_RX_ERI_CNT_COUNT            (2U)


/*!
 * @}
 */ /* end of group EMAC_Register_Masks */


/*!
 * @}
 */ /* end of group EMAC_Peripheral_Access_Layer */


/*
** End of section using anonymous unions
*/

#if defined(__ARMCC_VERSION)
  #if (__ARMCC_VERSION >= 6010050)
    #pragma clang diagnostic pop
  #else
    #pragma pop
  #endif
#elif defined(__GNUC__)
  /* leave anonymous unions enabled */
#elif defined(__IAR_SYSTEMS_ICC__)
  #pragma language=default
#else
  #error Not supported compiler type
#endif

/*!
 * @}
 */ /* end of group Peripheral_access_layer */


#endif  /* PERI_EMAC_H_ */

